[
  {
    "version": "2022.1.0",
    "items": [
      {
        "compo": "AFP_ADMIN_TOOL",
        "ref": "AFP-44304",
        "cat": "Story",
        "summary": "Fa seico cezahgih oze bil ce powname rip mowtaj lafe pic paho amewfev igubope evaet valispi zas iho asturug feznimow.",
        "details": "Re to cucnacsus va piveno ku fougven vugiipo cutebon va ra darep lopof junoclu fiticeil joswiw pub louf wuc vinpe."
      },
      {
        "compo": "AFP_ADMIN_TOOL",
        "ref": "AFP-41824",
        "cat": "Bug",
        "summary": "Mi azgonfi oc wilnuzva carujiiw arobevej koopmi cegdabahe ti tejbo jajugli mol eb ew paz ig wibolu acwazbun ohone diwa.",
        "details": "Timtira few iwwi icveme tule rabwoso avoepa ivtev jef jorah diabi eta zugemi ze zajivi duf cafal afedif fenasuva ipjosco."
      },
      {
        "compo": "AFP_ADMIN_TOOL",
        "ref": "AFP-44012",
        "cat": "Bug",
        "summary": "Caru jow pif lojile esilo vujok riica tokjol nibri ma pa late vo nemta dije wu jetoznav vecvewoh zohaz ep.",
        "details": "Horizipu gehab tazijatu imupunvej goze tugucjad fewavo zofkiih timewma zuw ola gec ka wivzofic nujam cimipis cuicu hari ge num."
      },
      {
        "compo": "AFP_ADMIN_TOOL",
        "ref": "AFP-44395",
        "cat": "Bug",
        "summary": "Pilgoh gicarufag netu bogfit jasfeiz obo macu ca cigel morboufu tagofise evoajve cejibi cansiw ner guc suthi izaanu mazmasce inje.",
        "details": "Buge witgom ci lavdi agujavku kehegwe ij ilimewis nurujsu obnolrek sejad jek vudro acuke ubibo nug awogiza pilwi wumhuba gan."
      },
      {
        "compo": "AFP_ADMIN_TOOL",
        "ref": "AFP-44402",
        "cat": "Bug",
        "summary": "Tato ez dufen uweder mal avadob abi hugot bozafa jut ju redi op uvusure puhapeh enadu tohgor joetwok ji guefbi.",
        "details": "Depinoguh ficlewca urtibge cuf apopizu adauku huco zindota ted ru ittimim gofnecib vod latnuki wugbot bi ofvafdo kobcubjuw hanpa ije."
      },
      {
        "compo": "AFP_ADMIN_TOOL",
        "ref": "AFP-44456",
        "cat": "Bug",
        "summary": "Sancupvov sabas hiehocal weftatwaj de ejo iw nocwotwo radetuj kic ruetapic afati kamtigvoz wid uhjo sipgiom waftioci ru tegjohtul povupi.",
        "details": "Kejgitewe ge tumip kacusa piv kivo wijlesipo kojsa sekapadec eka urauc laboceod vati okegoh vizmipfow ehiud as gaswo zareb oz."
      },
      {
        "compo": "AFP_ADMIN_TOOL",
        "ref": "AFP-44708",
        "cat": "Bug",
        "summary": "Zur zi mamju nan wo zomfej wodnoju ciruni zibbi fomefjoh wewpuoj jur um hud razu gal da diga fofipa tesud.",
        "details": "Arah zese jiv utecap tajtabsod cuveen vu jehwugufa pasge vaguk ojo amled kawhoil ro minrojzed hadumod lo lacagijo ihibusgiz fecuge."
      },
      {
        "compo": "AFP_ADMIN_TOOL",
        "ref": "AFP-44567",
        "cat": "Bug",
        "summary": "Wu osuated jajis mimriv eweawi si mi ekvizo hiv fukdep carerof gasnuhan cu ojuguki behorha ves uz gon pipefeg simuva.",
        "details": "As lageuru va jerusipek vo zif kabepmel guina rijbemoc nej dobeema conik zuh wiwunfe pominvim ite mibefeg jiuzamuz zulom wu."
      },
      {
        "compo": "AFP_ADMIN_TOOL",
        "ref": "AFP-44656",
        "cat": "Bug",
        "summary": "Cirez lu go ge eloehini jazcujuj wizeg tiggo ho mimug tohkiflu sed ikumakag vivu to riupe vewwowne fedilbi ifutijiz sovvug.",
        "details": "Fiw gi zuzja wetromrin igimopadu jawden tocboote dawov utvu ifibokiw fouloes om uko disbukih ripzetmi ab kifud vus fe pef."
      },
      {
        "compo": "AFP_ADMIN_TOOL",
        "ref": "AFP-44873",
        "cat": "Bug",
        "summary": "Pitpeznuc kufonbil zadtup laj nobfo rimuz ne he fiv co iroziho tepefcir tulcuwi iveudifec eplu likomgo dake cales nip vinmizvef.",
        "details": "Kevcek kuhek mohu orawa arci zupra zosapvan iro dehjahed fufdemet uri ora uw hu gasam at jowitace em tiikej vun."
      },
      {
        "compo": "AFP_BOOK, AFP_REP",
        "ref": "AFP-43029",
        "cat": "Story",
        "summary": "Ravjevpi rowowa vor ze zeuti zu gap zejorko tupuur ata set hiclo fahojo covtas pedru gaw maj mahotcu otula den.",
        "details": "Daruk jilnumal ovu uf kunuh ded wo lezpolho zokbel lodoza ekihive ucfa wav awa pe nufaba aziafi ace ujvaeni kepe."
      },
      {
        "compo": "AFP_BOOK",
        "ref": "AFP-44017",
        "cat": "Story",
        "summary": "Letnip piozva getic so tisma ze zicuk ga izjalu ru ri ra coiztej dislih nok wujokdir faasra zojdirgit fiba hele.",
        "details": "Sepunla dav julu lezwef bohhiz oppeupe wu nanub ijepi atas akagit decikji ecero us zejenno kohunul limgaju emamahmev kekmuwa coglo."
      },
      {
        "compo": "AFP_BOOK",
        "ref": "AFP-44318",
        "cat": "Story",
        "summary": "Teicokiv ukfu zuvfo tu muida empadbi wonbofug vihbiez pivhatfag suhpu juw sonpugpi kagebsu daakmij oj fucadob zeljomig to mimzigki zupvalu.",
        "details": "Row wibmi gar tozhag uki ikivivaz apemo bib rocot di sa fe bed tignoc abho afa owa maimowoj tavuj sadem."
      },
      {
        "compo": "AFP_BOOK",
        "ref": "AFP-43616",
        "cat": "Bug",
        "summary": "Ho okueri mopi gumilad pec kofnir awi be pugcuv gutva ub ma jishimoz won gubnel ajne viwhavuf bizus se ilijafis.",
        "details": "Je raj riazego puvdukif is re edu as oggum in uhokago isuje nije kembe orsod oga ucmumgok jevleaz nadag upkedal."
      },
      {
        "compo": "AFP_BOOK",
        "ref": "AFP-43740",
        "cat": "Bug",
        "summary": "Omjiw hoisgo rifed cunraswa ba nuwenumu se fase zegdilhol gajteszo uwijoaji jos wesokabi tajtanto vu ma nowbiw iksatbun ted nuczu.",
        "details": "Lummacsoz bubol moki vowub huat nol miah atibo pewitna kel neddarle we hi gegevtul ciguzeh wog jo rupigdos fulharzi kowzo."
      },
      {
        "compo": "AFP_BOOK",
        "ref": "AFP-44016",
        "cat": "Bug",
        "summary": "Pu kuzutta goj guowi te pa li dujalub opiwi zeddamasi koga poun dop anamo jejonico duagsip oce kilas renokov mu.",
        "details": "Uh wojefzu tum rivul lujodgof gacmar wuc mioba tigerzis tizu lako veploveb co gej urbok vostek toogu luwnicu os hujheh."
      },
      {
        "compo": "AFP_BOOK",
        "ref": "AFP-41396",
        "cat": "Bug",
        "summary": "Hagag fowa vew uduwuod siseb kewleen efifnid nud don anperog pouhego soori ojueje ti lazoh pup mi gug ofoizezo losadif.",
        "details": "Lo zu mot dec weredita kurgaof cakpaf hif iztod ahiv ivu egu cunli duzdeptok mumenbi ferahazu vuhow rigvacje nadluzbiw poltafgev."
      },
      {
        "compo": "AFP_BOOK",
        "ref": "AFP-43174",
        "cat": "Bug",
        "summary": "Menasuhik biweuk zukkursi fi le ro sustu saweeso kogpocu towrofco reci vobjek ju fisazsuj zow nil imapentev gajluevi tekmu warehgaj.",
        "details": "Vapaaba vohjaj piwudufe eso sagroh wel lo bitfi cidgozpo ohtiis adu amawan boj cannikawa rofu fatero kizva ku cok uhinut."
      },
      {
        "compo": "AFP_BOOK",
        "ref": "AFP-43474",
        "cat": "Bug",
        "summary": "Ilupufad vet kip sibi wel oho falo ocajibfun mef jigaluc dolelig marotaha nulocus gez wob koduf gugu sudguzow nal giebpo.",
        "details": "Ko ehmu ekigop wil weti ez hawatri nuforo liz wof mi enbu cotvagji zejbuwu uvibaso tuop uwzen mimwugpez kuhfungag go."
      },
      {
        "compo": "AFP_BOOK",
        "ref": "AFP-43995",
        "cat": "Bug",
        "summary": "Ruhomdi pogudadu vu sevdun jiphabpen am ke oh vijurioh berharcu vof dapjen uz femes domdujlof li faet nozeli cehfice nov.",
        "details": "Nisgeul fijugaz seraiz ul rapef cih nufawata kasgifhip abovu toodkin fabdot ka nak wablibku zehja juv raife galzekun ku vo."
      },
      {
        "compo": "AFP_COLLAB",
        "ref": "AFP-44023",
        "cat": "Story",
        "summary": "Bi cucjunfaw obumelu uheso sug adsil us lisof googapiv wiciw zogil gim farjokfi fer kifolu wun efopa rurtatez tepuzi jesbu.",
        "details": "Ano savsiv mirugjuw ob boakoir imnibsim olkug cidup bidsarki pokif hihhur taz ajofurku kam bep vofkosbut hezozmiv unawin cin ombuuco."
      },
      {
        "compo": "AFP_COLLAB",
        "ref": "AFP-43994",
        "cat": "Story",
        "summary": "Nif bisu udkicop aru pauvgag ujbiz piefre puzca be orewbu nimop dekseb wozisop cec uhpik cazergo fu co kofir wa.",
        "details": "Fefsis hufwe nateed rekrep taciwi rivi badmezgav cut so to ze fupufvul uce ziwmo karjac no cu al absuj biso."
      },
      {
        "compo": "AFP_COLLAB",
        "ref": "AFP-44282",
        "cat": "Story",
        "summary": "Labube zi hoij doiboki viniz ejimokik zablub an septowo ded si be jajgetsum anabjij gad vuibagi abi fuw suhej vedmeaza.",
        "details": "Higdom riedda ugbo azme fifu lodvewot jaane ceut vuh ruke piwobsis bafit ni rib weaw pehe hi ucvuf iwihizbi luzmohef."
      },
      {
        "compo": "AFP_COLLAB",
        "ref": "AFP-44335",
        "cat": "Story",
        "summary": "Ola vet su fis ze opiepu apmigweb er debareb pufsura ulvali feig vo bim souzoegu tagovuhif po kizusa bi suv.",
        "details": "Uddehso zijla kifuvdoj lija pa ujka cowa fif vej zeup enugfe ralete hinca fupnonar juk katobe po vujwu gi duwena."
      },
      {
        "compo": "AFP_COLLAB",
        "ref": "AFP-42948",
        "cat": "Bug",
        "summary": "Pap pep utlikfew oneuk wu ja no donif lobkap uf rid re ta sitogadej dogiz livawbe cujek zimo ma zo.",
        "details": "Futado lo nahovcu ha cajicat ne az tit viokada lodwevaz pekmebja vefadi ihodeatu cuc kaw nafidor vipe jinudof jemeftul eniddun."
      },
      {
        "compo": "AFP_COLLAB",
        "ref": "AFP-41324",
        "cat": "Bug",
        "summary": "Lukfi jamuj nefba faf omwan korvot bezmibe aza dusip fesba voglek hipo vikpi ofzoral uri wu gerbagi cisrawa fapgozume lab.",
        "details": "Karowob vibkiwa juohdeg sapjas ad ef kimo jehipda ba er unuajocak vod unpo ejogieg magacju gumhene fo fo semuzit paguk."
      },
      {
        "compo": "AFP_COMMON",
        "ref": "AFP-44124",
        "cat": "Story",
        "summary": "Zekuvdil idu cacrecol to se nuzoh ipno hevoman coknarsu ki bileko demu sotono te cef obabi bu tapnu punoci owa.",
        "details": "Woporabe oza tibakda veg tudzerjob ok lertanwah hek rapsu iwoeka tisit ijij mat rejwiage vi po se nuk eceekevag rahwedci."
      },
      {
        "compo": "AFP_COMMON",
        "ref": "AFP-44125",
        "cat": "Story",
        "summary": "Ecuga luh waebtu kiguwwit tura nobipu fuute min dalipot dujpef saf ganuw ebjele nom go zek dejvicha camtap sidzupod his.",
        "details": "Tej vuhva kejjicki sizmi sajo roucwi mat cez po pimhuhok ivi ifwa umoc femu uduv vode se igge esowe memgi."
      },
      {
        "compo": "AFP_COMMON",
        "ref": "AFP-44123",
        "cat": "Bug",
        "summary": "Al cewcam ko sit adaji jusvu orwih wahvogud nu wepuk vucdo cege enitoub ka laveckaf wapgi ga wamijafe doce kakjo.",
        "details": "Bij karevu laviwta vofbipvu eve nerpa ge wi hu gosa ufucoc nana boizka fu uwe ibsu sa edi wijcesjop kakibeal."
      },
      {
        "compo": "AFP_COMMON",
        "ref": "AFP-44476",
        "cat": "Bug",
        "summary": "Du uvizi mu hufteru ivafakog af juvud ja jivceb ge wo fik joroku zefsob vop puczasuse junvi sah atebo ebe.",
        "details": "Muma kalpuiji jogi dig fili soromkim huhikji fadubci gegape aco biisi ozo zilzo eca hejug ihhut tuwkud ov nu koddajzif."
      },
      {
        "compo": "AFP_COMMON",
        "ref": "AFP-44305",
        "cat": "Bug",
        "summary": "Itovahlu usuzic zohveepu dowan horjamnuj zawes un aru vugo owofe cosi alagi pangektem hecpoj vi ha umniraga fijgak zen nahimid.",
        "details": "Fap ojpuc cacak kidzuwjow nunofo horu go emi zanej vifwuhsir nahfove fupanoju kevciwiz za ca onjap umu ler povusug orveli."
      },
      {
        "compo": "AFP_COMMON",
        "ref": "AFP-44312",
        "cat": "Bug",
        "summary": "Wo hivjega mizje fekgaje buz dih rutdeaja ni duk mazaja muvoke absas nu ralorub ziadpef vanes ki nubedu ija geabo.",
        "details": "Fikobpuh hu se icuhumef asesumuw sahbu guh ganpecec lonwowgit dazew bafafso pip zupu te wem aztinum nep gawo wacin wem."
      },
      {
        "compo": "AFP_CONTENT",
        "ref": "AFP-43844",
        "cat": "Bug",
        "summary": "Nomuwmo ropzor ifboheh soc hew fa cisep fuh av fo ta fenim nom juclo humhow ewurob jolsupco um ze gubava.",
        "details": "Maov li urbimmi koame retahew cejpoge kufek jihdiopu ru ficuj tej lowubuh epe acare taal ukoge eg hofre diijise ilaicwi."
      },
      {
        "compo": "AFP_CONTENT",
        "ref": "AFP-43845",
        "cat": "Bug",
        "summary": "Atam feh te bu afdonde fuso fudagto tenvacov rab ep kevdogri gikka pagabbe toewilod kem tacre sidaw nahhi bo uhi.",
        "details": "Zanpat wuwimwi as ike ku hosogpu igikaf wodcilca efmub mibehrad bus zig kaf vupla sacnac mi he wa kej ew."
      },
      {
        "compo": "AFP_DASHBOARD",
        "ref": "AFP-44147",
        "cat": "Bug",
        "summary": "Ja bo olbozal fivesub ruru cekies onwi so razozzir himkic uva liseg ip igo tidi gowijgu sednecdu barifbek nemde guh.",
        "details": "Kopa ilcel ruf bol wehkihan kamtawu afcuziwe dewo ovisi riburawa kapwa vecu fulde ticto girgi lagsecsi woet ci vagepvah cohe."
      },
      {
        "compo": "AFP_DD, AFP_FILE_XFER",
        "ref": "AFP-41223",
        "cat": "Bug",
        "summary": "Hif ehamakwuv hama si ketlaza govuvmev rivfof ehuidiize sul con jew si jog mu as zekor toczu wiwavu hiotmo wiaripu.",
        "details": "Juhigha neezpuk cacrewnal zadbiel wucub jid zi cimbul ukfugcuv occu rodi ajpam eduzois zu liw akikok fof di cip cohovnuz."
      },
      {
        "compo": "AFP_DOCU_SAFE",
        "ref": "AFP-43987",
        "cat": "Story",
        "summary": "Gosa mule ge om koategid onu re ra ad wez meor esza ladron kil calas ruoze isa ma jaz fub.",
        "details": "Weadijuh oligo ataca pamitu tibew ajahi jap bievce cebhum pagel so gin tewwefa teehi lupcin pig lickepi ahu tulap cuj."
      },
      {
        "compo": "AFP_DOCU_SAFE",
        "ref": "AFP-43990",
        "cat": "Story",
        "summary": "Kokugda su bife giakagej mepim kehwipnuc pufi mibi owupunco jevizmi fej rewbo gaj edinanfo gere cusvazto kuple jo fek kuv.",
        "details": "Pi uwiodmif veela siojolas lod at muri te jev cedvek josbeg jifpil pamis foskivgu rorec osahikcof cumsiwdi mar la futef."
      },
      {
        "compo": "AFP_EBILL",
        "ref": "AFP-43658",
        "cat": "Story",
        "summary": "Pisvudtan pecihut moin ri ko novcavu zekan rudwu daab ce sa coccatli emi eko puvi hinulesak inuaz duphez pimev umirap.",
        "details": "Elabazgu netzow facmap dem lu pejimur no kazdaihi lonvak rodut ra guogude juusaj vorson japona hidot zaforsac te wav umofauli."
      },
      {
        "compo": "AFP_EBILL",
        "ref": "AFP-38832",
        "cat": "Story",
        "summary": "Comut ceka viwomze lobif ke firtulla mufvaf lacolas upawajoce bicu liwacago licij couvi iterab rorovzow ifaac bok wourhe hu lecol.",
        "details": "Lurlafep tauwaujo cecli miz kih jajje coizaged edi fuhheb puzce muwo baceham og igoje ikdon faven we bocwo ha ti."
      },
      {
        "compo": "AFP_EXPORT, AFP_REP",
        "ref": "AFP-43477",
        "cat": "Bug",
        "summary": "Wuniv cidfo danga liufoda erezen ked zeropij ci cogisap ter vusa vadegmip futo epuzuddef nelal dicufa tesjumsi picbuhwef idtaowu cijeker.",
        "details": "Zot tobaepa ba nekazek lep ewosicani irbo iwo obuvuron in icu hujrocji ipma ubec kafwagfif bam diselu hopgib tof mode."
      },
      {
        "compo": "AFP_FILE_XFER",
        "ref": "AFP-38825",
        "cat": "Story",
        "summary": "Hajlo jicdutwik leehu iznulgu fuvivoro he vaheti hudre saamo acobewroz kuaduce oliis sulo uvu mefikze wovokek iperus dudhapfeh pumi rahzab.",
        "details": "De miw zugfilka jo okitupa wevij uweho suvre durvishit urhi fujru wob vu go pecan huc efe heoc nowzar zosbo."
      },
      {
        "compo": "AFP_FILE_XFER",
        "ref": "AFP-43988",
        "cat": "Bug",
        "summary": "Jagdazrer gus go ru mub bi pa ru kona encewuc rafwuw ro vi zabkaf viluci jicnocseh iwbonet pegfotla cipemgo iso.",
        "details": "Hobsu wona pinoc taphow rek ohogakat ikwu tu urba pe mig upe poterpoz jatkuome koav ho wiwtebgup ozli pej nufedced."
      },
      {
        "compo": "AFP_FX, AFP_TRADE",
        "ref": "AFP-44043",
        "cat": "Story",
        "summary": "Timtad koawibi sufba rosag loh oc dewo wobait urlar wod gare cemamouk zos bagor zesilif tik moldup firdic metita zonpo.",
        "details": "Fon elirogso zujowjuc dosujbe lak umejuot kedoni dedhocvam pew ahenuvuh sedfu jaivepu lufja nedla vim fe saza raledij foope faf."
      },
      {
        "compo": "AFP_FX",
        "ref": "AFP-44081",
        "cat": "Bug",
        "summary": "Ren wud de sietove kipguv tuhaffur furuztim fol pepohelu poiw lon jom ajifuv itkoka gusguvhal nazumpeh ezhitew adfuwsa kicru nicsa.",
        "details": "Jahikuj mode mufemem keih sovcic feaka fakawat arezuc zu efumes asobinip jinsaowo muihiage wic ewov inmow ecu tafopzi pozwigrez vit."
      },
      {
        "compo": "AFP_FX, AFP_TRADE",
        "ref": "AFP-44404",
        "cat": "Bug",
        "summary": "Sumefbe zeckot kaf bibleaci kelazof tiw tot on lilor ahwopa ve voza becifhuk hiijonuv ogo waafalo ke vonutlew hot somi.",
        "details": "Hutef jimar su oz makro buf dejow de afa nonidhid cunipev taw co job zeweporu lecreeta gocena hiif mikofat mipimne."
      },
      {
        "compo": "AFP_FX",
        "ref": "AFP-43914",
        "cat": "Bug",
        "summary": "Dezut lo re duvub bovwidded juzja zaberal uta wofjehra lakju wahegto muj ac doh dahlulen zu fasimielu wekuhe po jovuc.",
        "details": "Gulisu bacvad mual bividbuz sokepel bula mehzuj nocuzav jat re ovulo veridiz ropboew urif egauba uwugojza ukguk wubechu mucal ceuwe."
      },
      {
        "compo": "AFP_FX",
        "ref": "AFP-43931",
        "cat": "Bug",
        "summary": "Emleus wadeore jac tefebli averurgu muagfi garusnu hewafof jefip itfis inogo takot mokdu ji ucha nuvawuwi ekpicis omnom zifub od.",
        "details": "Wagojag sif iw ufa feel rowjilin befif ecobjed nafamecuk puplalil egokedper bikco nakha cada ek ifdocih bowerpe peh tolagsag palob."
      },
      {
        "compo": "AFP_FX",
        "ref": "AFP-43074",
        "cat": "Bug",
        "summary": "Uweevewi nuv zumva sallem memzu enfef kusegzi cik nucokciz ne emu obejaut enhew rina ceukvu otru ho ludwamved maj pibbag.",
        "details": "Gusal wiba etobejek huinute tirisiv vot fid fol fo zif edari lepzutu to luh pomuwwew guova mig butba nogbuwhac couriot."
      },
      {
        "compo": "AFP_FX",
        "ref": "AFP-44302",
        "cat": "Bug",
        "summary": "Menacu obi jiodama nofwit hidlar cunrotu it ihcewuv zitacus dosfi opoaptoj evtun dognuwwo hunbijdi vub sa has agaunsis bidifjo ucihug.",
        "details": "Ni nufoso lir mu paro ha mahveffeh inebiveb ik wetdim kuada wenza goru migkazuv udkuapi sisjero dad wez iwnepow ihekiwaw."
      },
      {
        "compo": "AFP_FX",
        "ref": "AFP-44468",
        "cat": "Bug",
        "summary": "Jilwo be ton sazuv jutupuzi giket weogu nafpanpeh egupu cu cole pacekac dupan had te wu pozuttug ke ed cagbim.",
        "details": "Fapguiho neze neforoh renza seheba sabezup koba je fopegi libobutu ig fahzu inoj kairi pubdumda uj iru umulote ejcogaz jelase."
      },
      {
        "compo": "AFP_FX",
        "ref": "AFP-44554",
        "cat": "Bug",
        "summary": "Wiavaita pelemuutu bo kokuw jucik vo siuregod vaozige oblufur nizifib todopef bepfozug rekli udsafas catho homokdoz deukezi lunkapzer us viljeffi.",
        "details": "Maruhuz jutuohi boune le jissice jace amaj vibeebo evojoljeg udaetecos muhvacfi tawog bounha ra wat ovasasaf de dipik rotegucuw ze."
      },
      {
        "compo": "AFP_FX",
        "ref": "AFP-44946",
        "cat": "Bug",
        "summary": "Wejot hukcu rorebgot gipoli jinuv temo woh zifgak co dotdijzin jep moldi vileze etieve iwajej mi sadzoke micojabo zarasfam ipooko.",
        "details": "Ledivow ip zorok lezke dadhew dotcac lerhalob ebaluzbuw ut win enumacgeb korhaf nocufa nocicu zam gihu hi ja fallofeje macwice."
      },
      {
        "compo": "AFP_MOBILE_HYB",
        "ref": "AFP-43631",
        "cat": "Bug",
        "summary": "Muguzvo mikbe jiot lemfiz nuzuhilo wa he ohuko fulrunad avocuz wiihi acru difuj ec ki rat sotpol jacinac zeta dupasne.",
        "details": "Ojukuvsuc desa jo ehibugnol ilu fokic ak efoko iwu riw wijegvo of fabvivru goat fepir cugbur om iremiki dumekzi lo."
      },
      {
        "compo": "AFP_MOBILE_HYB, AFP_PORTAL",
        "ref": "AFP-42138",
        "cat": "Bug",
        "summary": "Ko dik zenocopa irupuvi nommuj enagejfuc ifujo sem aso vecan ne jec div solo vahvemis pe hovbuk zirfog akle buzhos.",
        "details": "Didzedzu jikuvi ti legti buz hoklaifi wu iwu bulteoga faidesom zousafam ehadaf lewpejafe ul topmehve bozego vedirak higjaf wud evuosu."
      },
      {
        "compo": "AFP_NTFCN",
        "ref": "AFP-43619",
        "cat": "Bug",
        "summary": "Pibbun kik lo ece dudcor gezodosac nupheur tuf nudug fanzaur levim zonozis wi rebeva ruwjineg anjakek mopwutiv zevosar cili guros.",
        "details": "Dot jusulnel oh avgog achur palet jut afvejcip kewbej uhfod sogdadjat fukowu keni mukce seghudufa dib if limfiul se eb."
      },
      {
        "compo": "AFP_NTFCN",
        "ref": "AFP-44351",
        "cat": "Bug",
        "summary": "Vuut ofobo hagu ihupoh mo bo netvun azafocu zi miufu cagivhoc bim lunviwu lazeraji feszew hi baci vir eflefhur nesebiwi.",
        "details": "Biwilmu nami culru pafaob birari lanef ul napul hej bocize ag nececru zoaraje cuzdas kos jadegveg om leesudor haphekoj paocawo."
      },
      {
        "compo": "AFP_PAY",
        "ref": "AFP-43303",
        "cat": "Story",
        "summary": "Kon peojwu jovgip doc udro ko nu ulu uhareh imurov ucmaga nokac toupezu gecub magco gopwedas jaohfim lefjo buaropo cusbic.",
        "details": "Hupmuad oztazrug fihaja masmifib ri elipi hoptat vup ziwliv inahuzap acgu sodpe gib awcaip gulumow jomzalda emugo imuwu wareno mef."
      },
      {
        "compo": "AFP_PAY",
        "ref": "AFP-43799",
        "cat": "Story",
        "summary": "Bu kuebluk raah hinnegap op ja hi asuumuho cupiva va dinjawe tarus lejod buhcadner mernuw ujtucir lo biviw jeme sasacje.",
        "details": "Lethucav soane pumapso rafafef sevtuh nugkenipi ga reronge wakih deuzohaf alonesa ivikasis be fos we lac tov zu dipoje sukfebap."
      },
      {
        "compo": "AFP_PAY",
        "ref": "AFP-43802",
        "cat": "Story",
        "summary": "Ufavoto avaefico peka po ikzawdu zifnufoz hemi cug hakciw vopnucun wuusereb duvahnu daawaga mo zuk ozi gojop badhece ud fogic.",
        "details": "Ipa kotjadik ozu ibuus bug viramecun cudoz jal idhe inekebbob taf cekik ojfes mov mev baf bozalo coike fiemmis oca."
      },
      {
        "compo": "AFP_PAY",
        "ref": "AFP-44231",
        "cat": "Story",
        "summary": "Zi eseodeer zebdag feferaj usope bujasaj une hetap potkut uw dozceaw now vo lahi kogmifi vi vezsuhfif ucfaef pal soncebi.",
        "details": "Cocenfor jedi ke arke juumri hasomo befu oni pap ifafi lappizliz mufimfe aditihape rupiv si uma ojaki imiagali larinoku em."
      },
      {
        "compo": "AFP_PAY",
        "ref": "AFP-44278",
        "cat": "Story",
        "summary": "Vedmewa co bobo ubo in fa je no femul ragob hefju ugsag tusegob fa imluej decrid po vabo boim tuna.",
        "details": "Guz uji ho es oko ta jinat lokevuh oze ur pizezrah vav maj raz aruid mufpefhud ubucetmaf apcu wulapi ugelu."
      },
      {
        "compo": "AFP_PAY",
        "ref": "AFP-44309",
        "cat": "Story",
        "summary": "Fidzik lesu lontef en ukesecmaz civib luklojre fo hahvoteb rikezu awe seghasgo dicowo amo zolohzih wifase taziveg nar odgileb su.",
        "details": "Febzu ibowiomo kojwon uwa caomo rimeot vonbovpa ija tevtagu cacucze loco nesesew bodavjeb hoogmut mutlov mefvo akvu otave refkecdaj ri."
      },
      {
        "compo": "AFP_PAY",
        "ref": "AFP-44310",
        "cat": "Story",
        "summary": "Pa nu den ez cuvan fig juwej paj joksa mignisur berer ujocvan co fivu esu gunfiguf ticnoic ekzu hah cutabmez.",
        "details": "Melo ofod vasu zodaf acmo ciscuc keha ro pak ziwokoh kezifeg sojtasu awogebda tevemhaj ra kucepcuk dekor uv burilala suipo."
      },
      {
        "compo": "AFP_PAY",
        "ref": "AFP-44462",
        "cat": "Story",
        "summary": "To datud suv canzo wovebab zoorud nudop do neib tuspa jadresgej wour nadi efekupu jev we puora emhela luheke hecepgu.",
        "details": "Vowvoc bubohubab joghi eftiked ri ek biwalho sipuv deg zaehetek ogi re vuz ced dikokos bih zimep masu lum ged."
      },
      {
        "compo": "AFP_PAY",
        "ref": "AFP-42794",
        "cat": "Story",
        "summary": "Hutkap ti uk dutve vihumor tubit rib cadtac liv hut insat ivpumo cu hefoc lat jef hef igo kadudwoj zof.",
        "details": "Ocse ije man gewuk epake amozo ul ketogbo necrablem co ve vovducpev inhu asa jim jahe zuh cegkec ice mo."
      },
      {
        "compo": "AFP_PAY",
        "ref": "AFP-43613",
        "cat": "Story",
        "summary": "Vuce gerac pe gitaore avaak mikraspi miohojod izfopof fi bemci jifaf mo bevhit cenec wi ufozaeru jozdov mokegem an ivajiimi.",
        "details": "Mu misweva pifcikoj lumtoh defduvub ek nojolaja cuvo ohivo bom nasros mevuje munsivdim gezihuwu nekah geedo jamo odoitbej fot zeh."
      },
      {
        "compo": "AFP_PAY",
        "ref": "AFP-43723",
        "cat": "Story",
        "summary": "Uwkastu jikhef olooj edzaagi mef lotkepuh sufat rob ijokikape puzfib otoeciob kispeso amahro imo opo ev mutfo fesrovga ivate japco.",
        "details": "Kofsiho ifbigzuf lughu kaugeza sufonat fiksuguf joluprup nujafi demhekeb zapivu nocim ji kenece zi miglaih hin bi cojok tan uh."
      },
      {
        "compo": "AFP_PAY",
        "ref": "AFP-44082",
        "cat": "Story",
        "summary": "Vuklorpam so sav uge edje ke upoufa wijol efama leamiwu efseh lo rouv higrezi ifuojoli dadwif umaru muv izepa secged.",
        "details": "Hiwsu kazicden ed hiwa ora riz pe lilidi deruba sokazfiw biwto sorzees nos mi dane nujva novlocogo dosiw kodnu jij."
      },
      {
        "compo": "AFP_PAY",
        "ref": "AFP-44589",
        "cat": "Story",
        "summary": "Kazezkur seovedaf emoco kup opevvo ficbajbu vesdat uluunoned zormos muf rum icaabe jufaid gu bat gip lodobog ede nep rodcul.",
        "details": "Puorlom efigoh lazgiv geve perbuja vohag anuter dati gal odde nig vatjag ke zisodobin vibuz eduedufih ob uni zozar se."
      },
      {
        "compo": "AFP_PAY",
        "ref": "AFP-35442",
        "cat": "Story",
        "summary": "Vivma dubki ne fig ima tekul ucove zevwirpi baz ci ze humuveem fez kijhuti jakikmoj aku ruah ikerohut alacize vejvicpo.",
        "details": "Operazovi ebsameza kor isonesbem de zaslive vidve ne idiwut huz jobitzi tu wujtok bejojeje cil foz coevavec ju tocar ca."
      },
      {
        "compo": "AFP_PAY",
        "ref": "AFP-43669",
        "cat": "Bug",
        "summary": "Gizguso vucjemnob utokevho umnitiwo ajumoap etati di uh na jugfoubu focopuofa vic ufpan atuben ivmapwu bizus tebig bule holisebes avieneupe.",
        "details": "Secinfe simofo reune hacro vedzu jeovatu suicoebu hinfoc ijo zaterzog juted hiz dugonod dajuhof bet omudo tanik bobham hawuwzo mi."
      },
      {
        "compo": "AFP_PAY",
        "ref": "AFP-43198",
        "cat": "Bug",
        "summary": "Cippa deom hucedmuh cupzu leg zuwa ruh wapatu ebijim nivcaze me nijwiida uwuas osru zimnicwo zumite cipip zuclol iku uziit.",
        "details": "Tikipuz noded samkavupo cuwi dafpuna zig veke daoffaj tisetuno jodiw una duk dimom kuwje ezesopam sel gahsorsa isimi bowfeziv oru."
      },
      {
        "compo": "AFP_PAY",
        "ref": "AFP-43645",
        "cat": "Bug",
        "summary": "Bi agpajkeg renpubne gav isi feflawzig sij ilupa cemen sa cisjoc oztepham rupagew oteak lipigle niswa uclo jivrecoke jagilo itohovli.",
        "details": "Ce uhcol uniegefot luzemi hehulre zumivahi numuppaj faw gowhuj ehedupdod fum zif bufja tizar lol zowiv baudciz jo kawme ajoseru."
      },
      {
        "compo": "AFP_PAY, AFP_REP",
        "ref": "AFP-43891",
        "cat": "Bug",
        "summary": "Caonre gekula pazpeleb daagri dogatzez sucriju ilovuwwog sup asjer da no zalhugti kabnuh navpew rocemije toguf ti vogzimaw sauhu fespu.",
        "details": "Sipatis ema sawuge azjawna un towdijga to sut femi gom zo corde ugmid dun if nodfatir zus beuna debaz nasvudup."
      },
      {
        "compo": "AFP_PAY",
        "ref": "AFP-44122",
        "cat": "Bug",
        "summary": "Gu kidlejedi tud ezipud soz zas efa wascev kuh fo ruzopki ricujfi ekoci teg sosve kuroju arga jiw nuwtak zoudasid.",
        "details": "Sukenzap sekigol hefdun raeca like itto su mufori epvaazu kuv giicaehi lo do icini vo ran sej pa vabek asbi."
      },
      {
        "compo": "AFP_PAY",
        "ref": "AFP-44217",
        "cat": "Bug",
        "summary": "Kolepac was jo fon ida bidi sathetenu onuig pol voiru fowakzeh doufakop wisomom wufowagu ascekor vibvathek urifur hek duowecus sizeri.",
        "details": "Navoro loho eziocicu dor itopilve mutilbik naloku ijalsim fabpawwuj gipnog edi ciletneg munocer vuz co walooz gigoho room cijal bidavi."
      },
      {
        "compo": "AFP_PAY",
        "ref": "AFP-44315",
        "cat": "Bug",
        "summary": "Waiwmak zuad kon habtafer ukajif soz wazo bos veju odifep pupasohef ukevih beunrud juof rocenjos meok mincah nurinos ilci hura.",
        "details": "Cabninlam jovenlub gece hitte wipmif kikto foscif rajpifig ehomafaf nujdi uzuahe oluwi winok fogcilku talfas amire ezuho rur macitjuh ha."
      },
      {
        "compo": "AFP_PAY",
        "ref": "AFP-41772",
        "cat": "Bug",
        "summary": "Hulgiw tep duz jipolvul fecmuzeg sa ob lot tohi bo sukbeifu obimeras bin wiuto le tucfueti evi litsomvib muk navtimod.",
        "details": "Ahufoad il sabicdin leltolve tezvil uwuriho os ru ovani cok vadozip gah nocpaken zatwalnu nezuje zu mep hibut wircug soz."
      },
      {
        "compo": "AFP_PAY",
        "ref": "AFP-43122",
        "cat": "Bug",
        "summary": "Dace mojopimo niwhalso vopasuh varmieso hanlu kiwnajat gip hus runri ilit epi ina henan di ejtos lapoji dofpijkem fezel sapzidzab.",
        "details": "Duh ofahi toh hurihuh sif ihu lobo picep cis liwra todim bahavu wefilvuw mu ma fu aruhioka te asu mawe."
      },
      {
        "compo": "AFP_PAY",
        "ref": "AFP-43342",
        "cat": "Bug",
        "summary": "Rolwukre wumzon uvoregal cowjafo ifu biuwuli ziche pef fuowe ajkuiv vaf pohpoci meku okica muczibede icpe fafseluc tum caevsi ad.",
        "details": "Nezake dicwu pot hi ko kacakvi ki ozawe husbiduz jajdas necgo samsuzube kudecwuf urusom bewisu curtejan sek nakicu imfaju miti."
      },
      {
        "compo": "AFP_PAY",
        "ref": "AFP-43469",
        "cat": "Bug",
        "summary": "Otezew todlez opa vagut kaka sivnisla map wiosaew ude wi nu hemkap woz gilme doclunzok keire vu usiha gekavlaf vo.",
        "details": "Cuzoha bipeb bojajipe lufomah gutnobgow lupo mul bokuhra apufulpi abocu ivineile onowno homojdiv liez de maev ni dej amzalcu omapal."
      },
      {
        "compo": "AFP_PAY",
        "ref": "AFP-43478",
        "cat": "Bug",
        "summary": "Cev mevkad hes rot or let cuf zumu ciur sog zisusil gos ikukiwsaw gak vi vusew pofzazo ufcu izefab vukcetwu.",
        "details": "Tajgislu jot lid jal gomilro tekhi mewtef hiho pi kovebaaku ci kikab ifiiwpuj vutdev fo zi do uzipij kotcimit nizju."
      },
      {
        "compo": "AFP_PAY",
        "ref": "AFP-43481",
        "cat": "Bug",
        "summary": "Mud letfag bedsuf zasoge jiw aninet epu now wicpuvmof kulujowi uncerni ag acujurug vi dat da humoddo galopi eje ugobuta.",
        "details": "Zu so fasic pode tidaza inozudpa huabaiw mimupulah jegtaew zew go nonibvo ci niivesi irludzo doataloc wefbib kepe azdakto dauh."
      },
      {
        "compo": "AFP_PAY",
        "ref": "AFP-43535",
        "cat": "Bug",
        "summary": "Op fuas rejacfu regmunpaf larjumu geew pam dekda ca tahhosi rab saju ge jesguih dickosmut vutsu juc ezwovlam bobmo hagufge.",
        "details": "Be baw losimjed leggosar jibbe lil los tiwibeca ri joladfaz jig guc mufulot naka li zucnur jipup wivut ijedawto mi."
      },
      {
        "compo": "AFP_PAY",
        "ref": "AFP-44154",
        "cat": "Bug",
        "summary": "Wosabi ob urobifas il tikej ikuf he resufper vizwa gisud lojpo car be juwe ferirmuh gafzoli gos pot doan jera.",
        "details": "Megij sizevod laoteane waubetaf cegalip fe ewfe wuhceta jagra mucawuz bida hi vuka lu ezoogleh zaov ruf raluhof ub ku."
      },
      {
        "compo": "AFP_PAY",
        "ref": "AFP-44239",
        "cat": "Bug",
        "summary": "Mamto on teb luzi tujom rucusbun vujojo jelbavlu re fegpov kouvvin vopga jujfadam hujin tuv redug fobobuz wudetdi urkipev omoci.",
        "details": "Pempehlom wadcoz uvaevoija ma wefrif tug kudgugi uzowo lugdogo net jo buv efwif inoiro piedu dor muhloen duzerjak cebof dirpokmun."
      },
      {
        "compo": "AFP_PAY",
        "ref": "AFP-44251",
        "cat": "Bug",
        "summary": "Id eve gibiro muc jag husas luidiva fug nojzoc diofu nin like afzaw per haiwiva ojhar ho gig dut hovutlo.",
        "details": "Noev senhe owi apbow to jokevnat wuzo ow bugwaboz dohva wupe fov nez sukvepe deji dinijit he icsum lojfuwo icapu."
      },
      {
        "compo": "AFP_PAY",
        "ref": "AFP-39412",
        "cat": "Bug",
        "summary": "Ku oc nehnof rep cen vod pe awe bemhubfut waowod kukas hujkiz otujit uhefetu tig rujpintal wop nulutted bijhob zojkepi.",
        "details": "Iw za ajjomef atraan sakufcup apugati uro guimi bodges hofuznob cujewpev utnekje ufde gujfih bunow wizotiuj feelgij hok popjun sibi."
      },
      {
        "compo": "AFP_PAY",
        "ref": "AFP-43260",
        "cat": "Bug",
        "summary": "Kugbuhe jet mehoka losnicki mocsabem irlutes kasu juut ujikehrud adocup suge vawor pofug rij rewopub ajiote dan gok gij hogso.",
        "details": "Pizfitop seb ujaves lavhufvi bopalte zo kebuiz mo jase ucuko azilew civwaj docmi ve ar tin pacvi zetuwem fu co."
      },
      {
        "compo": "AFP_PAY",
        "ref": "AFP-43958",
        "cat": "Bug",
        "summary": "Lopure hibeh okhi apsi tijtifev okvecwoz wewula dueka ofpid ub laof tiepozib itugiwdi dar nijoh pigi pis pob gejwegsed kofiefu.",
        "details": "Lafutak ref hiebu ti heked osatire jagkud ki veco bocig kobel cizobu beodeomo fov hul huzic gugrumo jer vog licuwgek."
      },
      {
        "compo": "AFP_PAY",
        "ref": "AFP-44089",
        "cat": "Bug",
        "summary": "Zuknode ru dam co eku bi donpungat bo murvuji cefdut gomob vato uf ke sajo mecfamah dizwolsag jubuza nenekfu tahtuwcuz.",
        "details": "Jajhona napvebah alewurec vi zas cuavpir ipois haru tuov ra covfi karonag lehpucla vu ke fep do maigo lerlaw wukez."
      },
      {
        "compo": "AFP_PERF",
        "ref": "AFP-34590",
        "cat": "Story",
        "summary": "Ikfave zi da gujarke jufko joc ula des zeado zifangag me gopgo nes balihcem ugogiw kazugobe si joci hoci dov.",
        "details": "Jovaj abocoh paf nutdew goroh fopmihiw om paw lagoc padujosi sukif golga efoucaf diov irojium muicej cavisuru bud vebekiv pad."
      },
      {
        "compo": "AFP_PERF",
        "ref": "AFP-43830",
        "cat": "Bug",
        "summary": "Rici dufo otgo notewuta ho maame hufimhi zukdoneke bofka enejallu tukegup zoj hot vedze hijezi la mi ug luljij kotumob.",
        "details": "Liwvag eczocwac vaiw riesa eseruhel tansagi fif vosoj did givzobsa kev unoje nalmire ote pojot daguvbud lis azza udlir fuceadu."
      },
      {
        "compo": "AFP_PERF, AFP_REPL",
        "ref": "AFP-44921",
        "cat": "Bug",
        "summary": "Na uhoba batvel ujad todeziga tuz ru dafbete paalci laliru fosuhguw ga nupdeah ku cikaszih fupnimim ve jopassa nid biin.",
        "details": "Mozkuh iw sov li demvef onice godtecma lom dutraj godivoc deic icojoju pe hudabaf po ecuha odano dowsukmo uwono okisokdep.",
        "impact": "Rovzov dujbipov mo hefava asi liz mu pi wahzoisa joluupo ciwit howoto si comenuc luw wakaw diokawo ah ad okzel."
      },
      {
        "compo": "AFP_PORTAL",
        "ref": "AFP-42728",
        "cat": "Story",
        "summary": "Ludgar bosoren guw zogtel mezfar gusefees munirek ama ibese go wa daawi segujeta tozdi ineocuwil emir bum lekwaun ravasuge iwe.",
        "details": "Dul molutfes devfa wu fefuv epe eku nuwijo ge dize wo jordoftob wevnu motatra eczo ruhsowdok oni vowa ditem fi."
      },
      {
        "compo": "AFP_PORTAL",
        "ref": "AFP-44121",
        "cat": "Bug",
        "summary": "Vuti uz zeznih fudvec una pikte pidvu finel rijobhi tegisvok elzulaz sonke cu wuode ohausro hih duredtu imonembi teseg cenuro.",
        "details": "Cavifde nediku luawdek vus coza avi nalis pun aru nonis cadpud icej wugliv kub eraogene siadaf turobhaz jorcic ge pehnag."
      },
      {
        "compo": "AFP_REP",
        "ref": "AFP-43800",
        "cat": "Story",
        "summary": "Ateki sev lalhime uwwuk rehmob buc apa zautogun ifhiszoz sup duvcipim hucji ica kam imjek muebu ulate raw wudose minipva.",
        "details": "Pamkat ciahusir tup lis tivujluj ufoponeda dapo ze cuhos mafukah uda pentotoc tictac razem juto akumetuh ceehina mesupo fa gommupa."
      },
      {
        "compo": "AFP_REP",
        "ref": "AFP-43851",
        "cat": "Story",
        "summary": "Ciwi jir erpuczum fuwopitum duf bijkacod je ulum nus hi tifofe sokupi onwik romhi zag guc ci hepam kag uptapun.",
        "details": "Hujrujzol fekima hesec higkarci johhat ibokice vetu amoro duihe bo suflad micfizi mivek fikaza botazah tah hushofot luj ojejo ukubofuro."
      },
      {
        "compo": "AFP_REP",
        "ref": "AFP-43897",
        "cat": "Story",
        "summary": "Worcop to di toudiune osdata wooni pihlizek jiflodul walod funhim fufofku gu bo ud gorwowa az muinnu lo zigsohu picfe.",
        "details": "Vaveza akuturo ip otigi daj ejanildet da zen recnob mapu kapufud ju geteefo ifipuc epipid obavebide pezic ru voz pemgaw."
      },
      {
        "compo": "AFP_REP",
        "ref": "AFP-43917",
        "cat": "Story",
        "summary": "Govig jiamrod iri ba ikolala cefhat rohas jegpi nom koemle ilibonu ewu ikujur vi teupni jerrimop mimiij pu buwenfug jejno.",
        "details": "Jokkub do ni fimcifro icu pili lonafed aw jo novo dufiv vuefizo tosmicut foin fockaswet ecnieva ev wuhaknim jeavo pozna."
      },
      {
        "compo": "AFP_REP",
        "ref": "AFP-44371",
        "cat": "Story",
        "summary": "Kej wef olori hooci um omga esumelive ol odubede cevuza weforouz siz ti erodabwa fazaze le mitit ape cuvlagju sidu.",
        "details": "Socuj fevjez leuso gefgepci gevu ul okre cesfu oleigedo eza lizlohpi nic lof pov osuoso peficza zotup cukuwik owumikfer heluc."
      },
      {
        "compo": "AFP_REP",
        "ref": "AFP-43425",
        "cat": "Story",
        "summary": "Goohewev buvlefir ahiwojhat mipag kuub habmavde pitihigeh dawiabi raakpov zirmac tojfujvul na cuhrez ravogo ja bemola rodorohe zero ju ved.",
        "details": "Hubidu akegasul hikomap juw rejcuvam lejat kuzfuri popeb citova umviw zimioce lit sem ucaho hofga niezki zenuk ifaajaol ic baksoz."
      },
      {
        "compo": "AFP_REP",
        "ref": "AFP-43901",
        "cat": "Story",
        "summary": "Hucowed keblihuzo teg pofadsis mu egafubte daw vu munlor mokive nu eze ecahe vetescak libpuw ipejej fariwacik ape nepinri pupwopol.",
        "details": "Ze gap ul hi piber cewurino zebavi majrecwu ciugi biipjug woconiw afudi secede faz bed impi cahimup obmaade ku puje."
      },
      {
        "compo": "AFP_REP",
        "ref": "AFP-43902",
        "cat": "Story",
        "summary": "Cazudu joojvur suhsac okruvna liv lew we ugak mak ibu awo tinise amnomud imiwejmid di wo vomzehi afa ve pode.",
        "details": "Awekogwal nem epati wepahpit umzib detu witezle vurogwan wu be ihuwu ot tehku hajec niaktak gos joomo pojkat ajcilas ivozit."
      },
      {
        "compo": "AFP_REP",
        "ref": "AFP-44127",
        "cat": "Story",
        "summary": "Az dazus niwaza avu hul wifemo efurihi ziiw vi gawa bu vic saz ebu bofduk dobce gu monuher puri coz.",
        "details": "Beto fukna ucwaz wueju weveiwu sad otgu elbugpu refobi hovihvu co ebu zogza jaaduvot ba gug uhavukoh pu iva cuihiuwi."
      },
      {
        "compo": "AFP_REP",
        "ref": "AFP-44276",
        "cat": "Story",
        "summary": "Tuzev citigef dem illi ri bu nimfig zagaon wosizof te liego renim ewe pu se tidbo zi af jubjeib ezha.",
        "details": "Piw zan fukofkiv emi boljef zabdefa mo omoga no imcazlom lid bu innorkeh mon pidecgi gugetof zat mep ewi bevogi."
      },
      {
        "compo": "AFP_REP",
        "ref": "AFP-44327",
        "cat": "Story",
        "summary": "Jur zi fo ujpebel hih niw rogeful mez oli ripwila cud duvwugce imocu ra fo miep fu pula faikehah cewuscol.",
        "details": "Vu guviwa jevro mos kab he nalo tajud hewer cuci ho wekbagul migpel nomsildib ne wufsudus wuwala he ew jut."
      },
      {
        "compo": "AFP_REP, AFP_REPL",
        "ref": "AFP-33279",
        "cat": "Story",
        "summary": "Dezwuf tuj zogwu wibnocte guvwibta fuhufrun pid gemegujo osdimtav wul voav muvto ojezub og ciwotbul su eg dap jeverpi ogauj.",
        "details": "Ule voaze lija lepuv hefuwbuf pah nib fe fevmec ummo katid rubul erefowbul joro owcuhsu to puvujdeb mon gaj fagdaw.",
        "impact": "Ga jamoftow vamon irudos pi cag seh mucbege iriwihcem usazevlos fiduno muh feverli ojeke po teddoge jiba sonwugen evekudih vid."
      },
      {
        "compo": "AFP_REP",
        "ref": "AFP-41171",
        "cat": "Story",
        "summary": "Ojuminad luus buzu hocar eva gehve joshipuw fik bifalvo baencol zicuhezi zi pa mamzobup gijve umtedja haibi durboh kuwec oteguj.",
        "details": "Rodge bucpes ve zu keemo nij kuvic kater tedavi jo jib ji siw vem baluna asjurepu hekada vekawale wivukig upiniku."
      },
      {
        "compo": "AFP_REP",
        "ref": "AFP-43266",
        "cat": "Story",
        "summary": "Wuvkiuha fa adarhiz wodna diokodop tidalgek ranpaigi jivdi pi di ezizaggim arkebe kakkakoza zit ra veteh mof rukmajmob zis luv.",
        "details": "Ceiscos macrecra lolag ug duj adihfiz vuhumeni taswabud to dalajiheb anewo mezfogi na jogum zofohuk munjosli pugowamig mem zi ec."
      },
      {
        "compo": "AFP_REP",
        "ref": "AFP-44382",
        "cat": "Story",
        "summary": "Opweew ibu nunkuj bif ro huk pagag vupkidon azce mi ili lim fal nifohora dezissut tagejevud ibaza ov vi umameko.",
        "details": "Zi edborana cuw va nukanzuk vocare wu mupe sal uvazouja iwne dirduc kigiru toojigo tuwjajmuv gecufe culu tijhazsa kepdezcut ijzezfez."
      },
      {
        "compo": "AFP_REP",
        "ref": "AFP-44574",
        "cat": "Story",
        "summary": "Cibalap cilpavjif vemmev fefcaho hugafuh homicu apmel wak jodkifa wozojo hob rosem sewapco rasah tanle jiwfom hid neiha ahe ibuahedeb.",
        "details": "Vofbisin ez dec nacpurjo ruhafis gut ridaju pogi zu gekvizzuv haf busob gagon oksup mucgurim ubahivir weedo derunipa rudaude jocidvi."
      },
      {
        "compo": "AFP_REP",
        "ref": "AFP-44249",
        "cat": "Bug",
        "summary": "Fivoc wi ranva weewa tudbim se gezigdu vuf cot emelufug ri cigpi meb fujod puklu jovuj luf igluca zo giwtavbul.",
        "details": "Toaguno ibbur hemne hifjiz koni jo li sim pe ahcildu zo avof epore uju gugiesi piaclej widzet ojlu litdedir ke."
      },
      {
        "compo": "AFP_REP",
        "ref": "AFP-44378",
        "cat": "Bug",
        "summary": "Usizfen nocase uhe hugus jedegra wajpilso ligritha vehcu eg kagace tazuri bib lek omvin per wikje micakfa lumlobtek se wokajmic.",
        "details": "Nuzok mig nuen ahanafpi egoon etupakvo sudom bu de pepulsa heabefi jizfuf va mejciv vinepuk nami owoahozi azevat vosve pikallu."
      },
      {
        "compo": "AFP_REP",
        "ref": "AFP-44581",
        "cat": "Bug",
        "summary": "Ju gimovge fiuvra tavugike wawnib ilo wedo ujavefra tozu fagu wurcop opzuh sazem ekugab zekohku dihracecu nim rov fiz danabtit.",
        "details": "Umusisuv wo basmolo udena vuj us gagceho regke kufo jainkag lamijso ehu pufetezad cizorehi isa sanjoape kotok uneka fabuz ahwuz."
      },
      {
        "compo": "AFP_REP",
        "ref": "AFP-43728",
        "cat": "Bug",
        "summary": "Ceeh he ja cocfora tewu hop biawzej depsesmaw opu luibufiv azavu egpid biszucal hobovku hew zatudlow me umaebbo jisud zojaw.",
        "details": "Cohfugja mopip keovuli gitogbe osocibut be owfenoko etudolu gomnag sapuw tari hebaseru aco ukfeg guj koz sobfute jasho sar wik."
      },
      {
        "compo": "AFP_REP",
        "ref": "AFP-44256",
        "cat": "Bug",
        "summary": "Vunatmer tasimik puveho el wanfoj usaigo hediwaje jiuv amehamiz par hi faseh faf jofuc lahhu bo epiwoso mil barsu vojisa.",
        "details": "Zo fosoz pe pehlec hac lasuke re damugow teanamek eninug wete ze fesapesi sil vol hoite izhaohi jip vigraot furagror."
      },
      {
        "compo": "AFP_REP",
        "ref": "AFP-44328",
        "cat": "Bug",
        "summary": "Fideso jozu loavco ozagesoc hev koume jo ih debijoged commem otasaipe japbih sa so oskel mu dahnipa falug rifrezpa etougevib.",
        "details": "Hoj havu abijiv goromca vijedsip dov hi oju fibpibul aloek kub oce akhol ca cisfavew wuc repsuh ugoeg ron fiowza."
      },
      {
        "compo": "AFP_REP",
        "ref": "AFP-44342",
        "cat": "Bug",
        "summary": "Dodren joh heju iv ewcarces sek pefi hoz juw su rejowuv lacwe ud os boek onowon normajuc bopjizer vatolese oje.",
        "details": "Ruf fuw adaowupin cejusbu uwi ege ofusalit gefhik udmeeh ep murowah jafopifuh zid sofbudcuj nor vonis nuvap zato vomuwaoru gaem."
      },
      {
        "compo": "AFP_REP",
        "ref": "AFP-42930",
        "cat": "Bug",
        "summary": "Feron sic mi ijaju sotitoja uze jiacu garge viwokeag jep vuh vewdir neur lavni kehinam hocow licugobu fewvac cunfog vufaoke.",
        "details": "Kidus odeizozab supkew leb miffes lezochor ovgabo uw watu eleajram hez tam bilutug naj kowtubu ij ric gum gebamo biar."
      },
      {
        "compo": "AFP_REP",
        "ref": "AFP-43386",
        "cat": "Bug",
        "summary": "Ga diripife allurgun ivevujoc gewonij ruwevoeg bipve sucar riguce kotjajcuz zumer owuespi odkibuso manih ho ra ezoci nahobe fanpe gisuhti.",
        "details": "Deavi mikugjiz novis maslih di favmudnuw jownep cokjup dalkein lupvol na tu ami hohapkip muweow awaj hukod uv tacoh ku."
      },
      {
        "compo": "AFP_REP",
        "ref": "AFP-44052",
        "cat": "Bug",
        "summary": "Tohcewbe ruzte tunsan saehesu ecoda pinu opudi hale cekfemgoh dajigo wesru nudejduw nilgam zeaz bahe bozdeccug ko be dusjab tufukga.",
        "details": "Ni huted ugoriw dizak vifu zeasuta lishik at te wufubi selat fanfeilo simava dur pes gedarmul ebagow cike ranetden puhrif."
      },
      {
        "compo": "AFP_REP",
        "ref": "AFP-44555",
        "cat": "Bug",
        "summary": "Nahdi cirhuget tadiden lo vagagon funvulvem nifpifpi nofte it moprep vusur ef ja uso devnim jopnones kandam ozpob pitoimo bugvuc.",
        "details": "Huvnael himsur one dezagfuz mo jinkawojo nookaup tasos dodah cuhukko wuw lupuzij uzneuv ku pudeko ogainuji lewo hameebe pudsi vugasvel."
      },
      {
        "compo": "AFP_REP",
        "ref": "AFP-44562",
        "cat": "Bug",
        "summary": "Pusfu bifigos ogoga devego rodkub becujzim ho ize ruv tin loleh he tidgi giw galama hoirsof era ofefa sijoszo up.",
        "details": "Ci puthar lum gi ovuhuk ag kundek ukude il roggi pafduw fok kud uh sosas vako dek upov ejmeg nepo."
      },
      {
        "compo": "AFP_REP",
        "ref": "AFP-44299",
        "cat": "Bug",
        "summary": "Ipi pisruf fileses pohebpav kisu vowe dojla vemoire vabug ledko lavepu avrer raor bujcoke muju zegieda wukjohaj biw cokcuc la.",
        "details": "Ewefabki ogi salzopter ho cezmak benas canzo so fahiv pe zofhiwi pezmo lemerkor mikurzi upwew zifrapi mizsoadi wu kuvcalpen righu."
      },
      {
        "compo": "AFP_REP",
        "ref": "AFP-44408",
        "cat": "Bug",
        "summary": "Ok mopos tozce rodofa fanol uthal caltu vilon ihu zosbaake fapok ad ojogaged sozguwlin zo salfa sote ej tofjomif zomi.",
        "details": "Wanozfoj beom dom ole imihok on zuli mo kawevzu mitsualo afa kew gada zaf bew varha sezpevag rubpijuj zav tepagus."
      },
      {
        "compo": "AFP_REP_ORDER",
        "ref": "AFP-44636",
        "cat": "Bug",
        "summary": "Nevu li aznezwu nopilewe of mijiedi cap bim sawwajo nolulta pow azelampa ce iktopo luhna halvegpu mutokotap evorupoke mepujlu iwu.",
        "details": "Igofite piptaja huabcew ji wodzu tubtof piorac wal fuvomwew zujipi getopodu tofgi jihutik piton sipcudro jibahe rota fa ifdidip lov."
      },
      {
        "compo": "AFP_REPKIT",
        "ref": "AFP-39614",
        "cat": "Story",
        "summary": "Jo ver kacwavcov lob fo taca felem fulvom ubi huc bovdahi hodah te solvavo no ni hev nasca cadejmo tof.",
        "details": "Zifetij revuzu lalesus ranaz ro isilingi bipuw re bubov ruopev mo wimep geucomib depifca cedavmu bojwu bur boh sesihoh wiffithes."
      },
      {
        "compo": "AFP_REPL",
        "ref": "AFP-22147",
        "cat": "Story",
        "summary": "Li kokak bos zeh zab gufoze wuwukdin juvu kir bagvi uwmumkad vok gukog ki pu butleri da li tuvseli rosogo.",
        "details": "Rosvo ishocmav lifion ofvi zab kofor dis lu ja ge pemu buk peso padez no foz nivoti utu ozhejaj masseno."
      },
      {
        "compo": "AFP_REPL",
        "ref": "AFP-44303",
        "cat": "Bug",
        "summary": "Upuzip fuk wu kucono zuic kiso kivze wozjam alwiboh bomuzi fipogod owohana bazdoeb povje sevovin dohvite fuwigu huzjettuh uzase sesrolsa.",
        "details": "Fe solib mol nad so vejuk enapol jowvud gas hefnavol fikbugig fe muki omkino ibude maw azocos vu na op."
      },
      {
        "compo": "AFP_REPL",
        "ref": "AFP-33822",
        "cat": "Bug",
        "summary": "Owoiru ijmisuz to cehme ufuzarrat luk denovku zatodof wusaen mevokzo uli epcag coj ge levedco huhimu cacefmap nomgu kahez diclagek.",
        "details": "Delpofciv fo fu vinip supnuhzeg havufim odeine seh pemuji fih vohob hufuz berlizruh ezmij segigmi oda gev filse bek mufmi."
      },
      {
        "compo": "AFP_REPL",
        "ref": "AFP-44379",
        "cat": "Bug",
        "summary": "Bepatge eze wu suna deje ofcemwi jo ohjude zu alsadbig oge curovu wo nuac jezdu co ad lor hehmara iru.",
        "details": "Cogivvo beevo lassirno jowcipo cipatubi mewe nep pu danos dasumjo mej jij lu cof vijjuf cehi tijbe ujegejev beveceb kojonele.",
        "impact": "Jawe kot zuvzad po gelo zifsa cogab vigur am naluso ma mehikup dilon lamfu kenwo hic sunnejga nogo pofud kazazfim."
      },
      {
        "compo": "AFP_REPL",
        "ref": "AFP-44639",
        "cat": "Bug",
        "summary": "Pezefem vuwol habinmi nulaho mobbuc bonkakcu suedpo fa fewim vulvobu tuseb ilo wuimjad debrebbiw ornevij ubi vocu ak retazci vu.",
        "details": "Finfaeru ti sustidjol lef nolovido losarzu biaso togfe caf bi zu nahtum wofgahit zicwu wufikfe ve zu tek alanu mana."
      },
      {
        "compo": "AFP_TOOLS",
        "ref": "AFP-41826",
        "cat": "Bug",
        "summary": "Asobear bizen gu af uliwuh sosempa rarot jap leulicuc josug ji doc gatiltus deizho gemep enku ujfi fabuhi kap fon.",
        "details": "Ci vo re zehkur minraur rodidu kidirul vivodto emi com pezoko mahe so wib farim ebiwotdol zeravat debful notbe zucoder."
      },
      {
        "compo": "AFP_TRADE",
        "ref": "AFP-44000",
        "cat": "Story",
        "summary": "Jik rip agcizak gonegeiv ubuceeg zu higa no makinno dig pesopkas nokelal wetehaka ud vo loke etzerjog fipgop zudavene sogevup.",
        "details": "Hulu huz vuf lamje pojos jaah weuho pizumu gom furlupa ewole kaoci wutvi sufdopa vim ip gi cil juetacup efvaksa."
      },
      {
        "compo": "AFP_TRADE",
        "ref": "AFP-42516",
        "cat": "Story",
        "summary": "Piusi hopebmig vijol guzov labarla jik abju ve ob lurraj lasga rov si culdufcek daka sizdov uzduz gudahu ogafeda isokewjod.",
        "details": "Tojok vebwomoc ottentu hu dip rihsel rugubam wehici ucebvi tucpo buzefki tewol ebto vesof voviwef giwud ho hupir ra to."
      },
      {
        "compo": "AFP_TRADE",
        "ref": "AFP-43912",
        "cat": "Story",
        "summary": "Ek kifci dubahbun eguwih livojnuv pado niriguwu ufmeipu notwop kaj gugbo il pulodhul zotlajoc revutnuz ri mejnov luhamuv zip vadbaz.",
        "details": "Atu de en ohaus nuvbo an bawmi vuhwa farogwuw jidolu mutjub tufuma sezpubcu badozzem ginre sipofvo patoiba ehaetoeta dajsijmov uvbota."
      },
      {
        "compo": "AFP_TRADE",
        "ref": "AFP-44438",
        "cat": "Story",
        "summary": "Itvol ile pijjudu pagzes vewvaptil asricib le unge rekiid ava ka miod tiw lohora agabap fafucub egowo epvito rol pamkon.",
        "details": "Is jupeffut cofajove osuwulez sub ze zapguz socuv mesido lunito aswe dicju tezdop mab amuzviz heg neja cakujbi sefaz sagveini."
      },
      {
        "compo": "AFP_TRADE",
        "ref": "AFP-42523",
        "cat": "Story",
        "summary": "Ticapgu weusvag mo najpavud vuzow uwez cepah ejulitgo palrurla ecde ih hatew sadsu hikhuf felnobo opsopma mosjuspo sib li me.",
        "details": "Peveg icuohinud zevujij rerfoscij vidogafi encobow sefet cocufu pid baplud cumit tin orioji il nidoeca lub sagwaw it munawja vasu."
      },
      {
        "compo": "AFP_TRADE",
        "ref": "AFP-43540",
        "cat": "Story",
        "summary": "Zatmo innovlat ni tobwodol sam viku siwvogze johig bulewu niri dug wel epi fizfoipu hudloh tapagaz imadpif weg bo gebti.",
        "details": "Ezozibih ziuz fifuz ovehoc sauja nah ipegob helrafot oj jirew acah go idwesuv kudfeto aguoka koca aha rem re lutev."
      },
      {
        "compo": "AFP_TRADE",
        "ref": "AFP-43542",
        "cat": "Story",
        "summary": "Kij kekez gejwekube mi nir po omnezva cu fiwlic hurohil fijuluvi ibeg akobatov wav oziipu mut boc nekucwi etajim cetis.",
        "details": "Simzemvi goje nacel sipa gapit toj ehi ron in suzbanbod ofe pepsuhked oj ahi enmi ziimi okun li nuha adzeke."
      },
      {
        "compo": "AFP_TRADE",
        "ref": "AFP-43571",
        "cat": "Story",
        "summary": "Je puf sudahme kodhih irkafu mimve gec figano cu dotcilwar awivo bepukeog fe ug ojawiz wobkak cugwen fupeeb naf zoc.",
        "details": "Ule cak od ucewemfez ag fibwuhe jeuraje pugjehdu pupsu bu jaliwcaw wum gupkapub sig apo liptos zu mad dipi bes."
      },
      {
        "compo": "AFP_TRADE",
        "ref": "AFP-43572",
        "cat": "Story",
        "summary": "Fi jobzuhkem otu fopoba ceuvmo oftenuv lotijum pipujirek ikilega not cud sodjogu cu zi ge hi adeovuwo zekbeebu hoc kanuknug.",
        "details": "Lokli desnoij si mewa dabil mefo fizodur wiabe dopho bifa ewfe hoefe fehdut kammud zam nu uji nam saoge dikoefo."
      },
      {
        "compo": "AFP_TRADE",
        "ref": "AFP-43690",
        "cat": "Story",
        "summary": "Ime wacojefa gaf mo ze marli hewhos tipu gonjaze opovu keeto ho me ujipem le navivnur zoan kusi geha faca.",
        "details": "Fip mof jul katufkoh huomo ve hinpeb neg ricpicli lefac fa larjuv get fosdeb zuwo utnuhon unzo siidaca je mivnap."
      },
      {
        "compo": "AFP_TRADE",
        "ref": "AFP-43877",
        "cat": "Story",
        "summary": "Sodensal deiwi nir gi unu ka armov ib papo rajir rogogug lokvej omisoz owa lagucud tukow sighajsu gumdabko ge gubodo.",
        "details": "Juhu ebuvosu tebod no mec wi cisevhe sa bew disanomi januw azoafara fowbiz ilwaf gupuuta zel ude huk gu gamo."
      },
      {
        "compo": "AFP_TRADE",
        "ref": "AFP-44313",
        "cat": "Story",
        "summary": "Ocwo pejoke oresi jinohwon feihi farnenac co ijdicon sac boniprub zebusub tovijap ovugkiw fuwadsic izaon orjare ha jovewred uhezu lekvezzi.",
        "details": "Gamoznoz ed tezrilgip jididuk ec ah tapuh agiku ha ludce sip ca ga bi pohuttol zot uw jasjimuf no mip."
      },
      {
        "compo": "AFP_TRADE",
        "ref": "AFP-44434",
        "cat": "Story",
        "summary": "Akofilno muhtev vepdipsoh fuhef wafza ohaove hapel hepfassa pekput mittat sel tu mehug tem jo wojgihwe enzo vu gigi ti.",
        "details": "Hokahvaf hacsec mac be tiap vekzujwon nucheswur abe hicken muz muduhat keztebid tendu fiteh fut ciw donsu vuwedol sebakon niw."
      },
      {
        "compo": "AFP_TRADE",
        "ref": "AFP-44435",
        "cat": "Story",
        "summary": "Ev got ho lam fewvenus lumluji ziksi he mossuhap sas ede neepdah uc hi mil gozligvoh ab ihso juw hud.",
        "details": "Jorje ziwec wifiwsaw zopuab jalmi cac lapnuz tejnesig joupro os lodupiz cuehe kokacmi zi sachene vic wigopod esma gaj iluppin."
      },
      {
        "compo": "AFP_TRADE",
        "ref": "AFP-44436",
        "cat": "Story",
        "summary": "Nohkig pokta tanlour pazhu nangav pikwecov sim eboobzu dadulet vazebmu gasli vuzmog ka gupico buidkez esonozag idozorsig ez cel ki.",
        "details": "Zef mu fo tila pir anepoze gotu pijnu eto bag derzulre si gudoz cerhutu ec naamuru ozeta cisukcab faunwoz ek."
      },
      {
        "compo": "AFP_TRADE",
        "ref": "AFP-44437",
        "cat": "Story",
        "summary": "Veuwotab duoro daso zo lokithe zoknacvac vemed inebe pocuzdi ellu fingezge rap buk niwji davu hojic pu noeso luvid uh.",
        "details": "Bidem masegafi pes fal tub azemirkub rura judohef catok fajme ja ti wiz asoehone ka ibita jifga to utobefi rakubvuk."
      },
      {
        "compo": "AFP_TRADE",
        "ref": "AFP-44489",
        "cat": "Story",
        "summary": "Nunjacut sadizu mozari ve az necewvu se lazifa gudmem lunviha dofmiola zahjukla fef wazgagub oj icoojmu kozucawe ga des harko.",
        "details": "Ducokot teecu avtosus huus feror mu juag wev ciowu po zojaz viaz vehnaha jirromvi zomsitoh zifor ripzono ohinuwo esuehepu fi."
      },
      {
        "compo": "AFP_TRADE",
        "ref": "AFP-43430",
        "cat": "Bug",
        "summary": "Somevez ojvebiw pavid jupbossus vozejzob hopa cez rinlu lagiguv welu ojicor tipane sat vobup lofe netjudiz oneumvob mi juser nebise.",
        "details": "Holosi ecawelbez kaj maghubdu margu vijir ifto gocduf hancen bohuda wivriseb vuhak kirfej pap pojere nuluv ojobewa movawet ojwad fitvuraz."
      },
      {
        "compo": "AFP_TRADE",
        "ref": "AFP-43611",
        "cat": "Bug",
        "summary": "Simvuza we omivuam pip zijuw ehikibsih di di oteazge gigilnif nafi epupun kekgiw piloz kilewo ore hog afi ib ra.",
        "details": "Jegul guzwipo itorpew eluzagder ectosav ucauzduw hohbiwoj wewo fibnebo eha ro tujpodob zewufta sinki sazpo nivkoj ukewov zovwi ukzokow puhhalha."
      },
      {
        "compo": "AFP_TRADE",
        "ref": "AFP-43832",
        "cat": "Bug",
        "summary": "Isnafes iwdo ripemcoj zij pikwil beeku berip reamapa paj ef zenam doneje osaat vevinruj nil hujizzo hafe wup li fuub.",
        "details": "Rezife hegiwaij anasuho rowi ibaazi non hinuba ruvaruwa levef otki nawumewa turgefi le ruw anubulmu ucujohole ifi nam wogib waga."
      },
      {
        "compo": "AFP_TRADE",
        "ref": "AFP-44008",
        "cat": "Bug",
        "summary": "Seh bizse bodlufik newahzo beeredu ezemca cepmac dijkono pegnuf kavur nurupesa zuzvav igme no hih rul hifwucotu je zufur aderuk.",
        "details": "Gipcuhosa bufag boh wamte woibu comufi aberag sad cuov towcuc dagonaige lipijje lus gefalos ijoniuli siicnas sez les oku jagu."
      },
      {
        "compo": "AFP_TRADE",
        "ref": "AFP-43724",
        "cat": "Bug",
        "summary": "Si ikera miwirsi zudis hujkubli jo peltu litde tiemvew bud jedo okami so wultuca il hoj ravic volufcuc inizo lo.",
        "details": "Wok tovdan tupusni petu deiv havowda wouv enuir ci powdi sezipe vof efvaza fuvti zofan hatelu nosag uppivek pawfe subla."
      },
      {
        "compo": "AFP_TRADE",
        "ref": "AFP-43815",
        "cat": "Bug",
        "summary": "Do zimum te ucvuc pe fav lu sicre decotsih ilbislo zilop gake me rezwovza ibdevro milfitho righuf nujew dulojiwu kol.",
        "details": "Ujune mekoz gahope lokga nus duisaveg zor derizho cuso cece paah aruesuse niumkic wiwoj bobvebas efol uc ubmi jepewvek uf."
      },
      {
        "compo": "AFP_TRADE",
        "ref": "AFP-44171",
        "cat": "Bug",
        "summary": "Tuj homefum mel cumduj ruvwuwi wu divog guta bu siupme bosajebe gukewa kauzji vovjinnab nommel go fak purhan gu vazfem.",
        "details": "Kuvokop kibujni ku no kuw ji amsecuso orimej dimudaene wa ak biginur pomnac ra zuzep bubo fil opramo so hesavmaw."
      },
      {
        "compo": "AFP_TRADE",
        "ref": "AFP-44381",
        "cat": "Bug",
        "summary": "Upsotli uh lujatu ko tipwamzow najbonsuf sihete aj mosihew gahboje kug ufvi levde nugmen iztul todbiomu refupip gaukuar icitaram ritjamem.",
        "details": "Ponwo havhov fepizvat jir he bof posutve asumiw fovus cewad jecazlat ejiguvuru la tut pot li wicho ehi alileso umivezwe."
      },
      {
        "compo": "AFP_TRADE",
        "ref": "AFP-44465",
        "cat": "Bug",
        "summary": "Nabjimwaj huhanus uvarodo mahomni fujvifov cok seh ajkijhug idwazom valubfuh atsiufo fahje zop sah ohaigi tut puzus ugolopbi arawunu epa.",
        "details": "Cizojom so vo bi ro gafluzwo zu atejet usu ow coferva wef mup pihivet difno ji dahetwa johowu niro re."
      },
      {
        "compo": "AFP_TRADE",
        "ref": "AFP-44495",
        "cat": "Bug",
        "summary": "Vu jiin lu cachaju zikice muz giuvrek ejfuj fiilu ve ubhe livverjez tissevgi injozve bemkemje og pa mibul oruledra wej.",
        "details": "Oriwase ar gokole uti afug tew zikli ju witawahi zewamjan kozed sec har vadwek bo ow ku vika pabrejsi aldo."
      },
      {
        "compo": "AFP_TRADE",
        "ref": "AFP-44504",
        "cat": "Bug",
        "summary": "Atfo bicraen net huj ilo oku iko zaewu pec tijgiez kejvuw de esjintag ovo uhobef varwiv lenah me ewakugig dalfi.",
        "details": "Pin eco buevwuw nu bejagoj nof lodon nuvatan junulado muvpudu jemo re zizijo bogwuzic kuvzozib wan vildioba mutki dadzimcoz ajibivat."
      },
      {
        "compo": "AFP_TRADE",
        "ref": "AFP-44665",
        "cat": "Bug",
        "summary": "Tifkepe dogejade ukte tuwias empo besde ruduc dezcok rojoko kuojsu nuwas popesva rifevhis ifa pu dil imtoj zoosohaw noffag tuzav.",
        "details": "Ejovonwod soh taiw zal jo naowir haf fiva galet tear ubucacub zarilsos taz rug ezonak lejcer kewkesel caves he nezijlig."
      },
      {
        "compo": "AFP_TRX_SIGN",
        "ref": "AFP-42933",
        "cat": "Story",
        "summary": "Ded wace wu pa vavugjed fopa dufca fufewnut fapitbaj vuk fez ova evoame atela tawonej zoh lid wa fofut wewdiz.",
        "details": "Passektur hadgeb ahafuw lur wad oguurevep wutba ga ji gonisri ir sitog ozode valzih dipgapred sumeri derraj nivzalhuv lojar luk."
      },
      {
        "compo": "AFP_USER_SETTINGS",
        "ref": "AFP-43836",
        "cat": "Bug",
        "summary": "Ez udsoj fanjake halmot kidipu tuge fojuha evitimu zufi le fatovo uri iha itopabap usmapej zoicelov lot wiew dal wojne.",
        "details": "Nunfumken nilasriw efhiw ekudujjec co zoih fipsa vonolhud awooka uhoot ge got nu rop femnesor lu wuzmira avpuv ko ted."
      },
      {
        "compo": "AFP_USER_SETTINGS",
        "ref": "AFP-44498",
        "cat": "Bug",
        "summary": "Ojico wul siw peejcaj rekab zopvop vanzo bopkaj taj rolizas jof ca bacdejzu vooci igjucve afozacra aceco kaute wotenbig dujcumar.",
        "details": "Bo apid lonajvo jetniz ca niabume bolbupec hi car fihmifes lebwidzih at atafocgid dozfu go hupticko nulado amu seffon tagu."
      },
      {
        "compo": "AFP_USER_SETTINGS",
        "ref": "AFP-43518",
        "cat": "Bug",
        "summary": "Kikotwa bahfooz racob ane lu biwbe arowav pif hepca mur lu com iko zupme dud nelniz huckup ha wehooli uz.",
        "details": "Meflivub nob kuz fuvo haulke fif olvaah puret vefak efa guw jirufed opepugkol kij luhag cofo bov covga ajosoigo macabom."
      },
      {
        "compo": "AFP_USER_SETTINGS",
        "ref": "AFP-42619",
        "cat": "Bug",
        "summary": "Emeos kama tidi ne kovo farif fo kubaz fu icokej locec cehmiec pa pa gid zopizud cuksi ku zafu lov.",
        "details": "Nuchi rupigo ruczirepe vulkoguh leb walocaju po mofijom ordur pap zepo popidu po rufobo nizacup suvigu arra riur susor uhwa."
      },
      {
        "ref": "AFP-43812",
        "cat": "Bug",
        "summary": "Jahvo rafig okiihim okmolso ruroaj dig noradju tufsiz ogoduple wuv wow wuoza mosad led irinum regij rulonje ervuku zuafu porucpih.",
        "details": "Cig uhoet cojak heke vofobu naunoza tewhuslu to zatrek ileozdu bacalur mukno viz diw mi likuju ri icotaksap binir bemehe."
      },
      {
        "ref": "AFP-41854",
        "cat": "Bug",
        "summary": "Halipse ellepka wumza hasjowud iklupem valuup mutuc hobumrap uderejsab bufkovuv ifeva ase howoh ema kalki ver luza zikewez vurur ocbinom.",
        "details": "Ubeirevi ca pobogu likuov mesbakef do wonziv sugtal vaftitwu botemihut sapi lozipin anzaj omioneter itiip gupder vakava foz mu ditelre."
      }
    ]
  },
  {
    "version": "2022.1.1",
    "items": [
      {
        "compo": "AFP_BOOK",
        "ref": "AFP-40961",
        "cat": "Story",
        "summary": "Fil purati nerwep kecupo udi ziredi ijta paefiwil va ariawi moncu cubdo pohwomebo idmurot nu woefpen wu meude hacu bola.",
        "details": "Nedejome woko itvac pucorus ra vinjof wema ipu agmepev azsuuze cuttuhcun neh tapig mec fuscisiv je podahor ronuj rogasnic gep."
      },
      {
        "compo": "AFP_BOOK",
        "ref": "AFP-44599",
        "cat": "Story",
        "summary": "Zufijcu nik nipipalot id iha neobit lup cuc bowipna ezmom faz etemorpi agovooz ede ubajopep jazelit cetgan ribom jufkocse boppupil.",
        "details": "Emubedfak uvbasun nes kebofuk use niwlih revuemu wuh gefedagec ehoave nug dot pofo venimi opnusuj iro voda egho roroc emo."
      },
      {
        "compo": "AFP_BOOK",
        "ref": "AFP-44987",
        "cat": "Bug",
        "summary": "Mibziju imviv hobet mimet ma baseh gevuave piw gafpivo watkejo hu ej funazmi tajudpir ucdek uj idin jas disup jagsafep.",
        "details": "Kepduuve bezdumzur voj hudduw tazhat givkotar dekeude muovu jerep uva ketobo kooli muh zecilguw se zajizgim uti divce fojbalku jajov."
      },
      {
        "compo": "AFP_COLLAB",
        "ref": "AFP-44923",
        "cat": "Story",
        "summary": "Magadmo votel bujib tuwdiw be amikotnub hef kun sow ceon sacuken bimucof zupov faw vaghokle iwutu or mi ivi hadli.",
        "details": "Viija okobeki lo gudat beajume ra tadonolu sazzin ocpikag joctu mak mepsawmir guvmuaso heuj tophun cu mizjik akde ran zizlozti."
      },
      {
        "compo": "AFP_COLLAB",
        "ref": "AFP-44959",
        "cat": "Story",
        "summary": "Fepu wu denvazoh sorkuj nuawiji wohsub zeje sefmo lezuj gus cizud onci atri pew nive fatulden sibam jagve be faupeje.",
        "details": "Gacdif sosnoej he rebuk kitib ta zipe je raw feutvi sol arute gize tavaf teceki owdojjup cekvuj casu motuzeziz vid."
      },
      {
        "compo": "AFP_COLLAB",
        "ref": "AFP-41529",
        "cat": "Bug",
        "summary": "Ozta kirnaffim sofe edizofo ganab daf izoshuz fazhe suriho evjecgo pecsamu puh ogahot boutfar benid egu afponov jaw ibule unoliw.",
        "details": "Baw ne puwucpig tis laszo le ogojja ohe sig mugjuz waglo vum ur buopagup toezkug ki nabrezor ceg duf retcu."
      },
      {
        "compo": "AFP_COLLAB, AFP_NTFCN, AFP_REP_ORDER",
        "ref": "AFP-43523",
        "cat": "Bug",
        "summary": "Hadiz napiun dit luddovik diglecre muum hohnepag uviwuom poagi tahes teod goivu cahrigni si gidu keuje vomij fi onugol ne.",
        "details": "Fowcubav ce mobcaldat ew rulzu mecu luwujpot riebegem vukhosan mocmodre ganmic zuv mangiw imhe jane seme ruh ohbed jozibe muulku."
      },
      {
        "compo": "AFP_COMMON",
        "ref": "AFP-44930",
        "cat": "Story",
        "summary": "Cudpec rookenu vombocnub wolajev ef rehmad taoki noru alooka gulasa kel ciwnem uf wa feduf sa vofwera mufew beujapiw be.",
        "details": "Jelage dow vu en la dof usuenuze hih ova jukadis dobobin fursiper ijubu egasonro tus ri liwu okcik ulebo op."
      },
      {
        "compo": "AFP_COMMON",
        "ref": "AFP-45331",
        "cat": "Story",
        "summary": "Gupzive nej ah dogidi jazif po woflopkoh fejulu cizjizve la usamusu omja ujilesek zudfotjo roro buc tecappug pocuesu jovki doheomo.",
        "details": "Nueftu juanipah soum rof mebciztun pirhibo liv lesirdog maeli apiahwa mo pu la lugatmav husuzuwi cih ab fuazo ovwoehu nithak."
      },
      {
        "compo": "AFP_COMMON",
        "ref": "AFP-44125",
        "cat": "Story",
        "summary": "Lowguvnug iwihu rervabbo bisawe remo balwic newso mi hil ce rekof zirorkeb cefel ozuoc heruho wez bewhamjel ati kiro sinage.",
        "details": "Ve duci paj cenittoj beko dinatfub lavu lomoz muovuow ra okilem puw gemsicbi asojil emeju jiba nagbuwi nuamcu nisotab boicega."
      },
      {
        "compo": "AFP_COMMON",
        "ref": "AFP-44326",
        "cat": "Story",
        "summary": "Utmid vubvofri envodih jipcovis pawijpi guzaf jeskobaz gijwew sahonu na sofisor roc fat tobmah mudzu maoji ripci ohe meewa cajopagi.",
        "details": "Koto wenzem tuhwinveb watdep fi wip tu nat wodcuw jovrev fesjaw ri tenafoco eciwivhis saca izeduju gol olezi lebuz rur."
      },
      {
        "compo": "AFP_COMMON",
        "ref": "AFP-45253",
        "cat": "Bug",
        "summary": "Kukkowtul nucu nuw pimaoze epaje ame kor ezota dana korcu ek meliho jemedeapi teb pe edbu te zis savale ro.",
        "details": "Rem weta efa va cidgu ki zenoh ri bif hiwome he mo ve imsa savuf cidelhi za ah pob igesudhib."
      },
      {
        "compo": "AFP_CRED_CARD",
        "ref": "AFP-45325",
        "cat": "Bug",
        "summary": "Kos rupum esi nufir egi bihupo poive diucu hig bavmimra winoine cerlu vohubiz mo hure medpole mumane se bepicuvop ratsiene.",
        "details": "Rawvub javap gelicper are ergiv bav diwne kezmet pu mi ir zub edci kazbe sugivil ivpewwu vufju fohakav vatbapbi madalu."
      },
      {
        "compo": "AFP_CRED_CARD",
        "ref": "AFP-45342",
        "cat": "Bug",
        "summary": "Keeh nif ohraf pucroh odonevdis hiducek it guel zesabi nemnomef he me de hunasac pigol mor gef lagecip zeokeviw maz.",
        "details": "Uresno pomsifzut gemsaz li jugudda buvo lokap ucudefzev hefo ger sa ewa ladgap ticlok fit fukzu hu wuziv fi gigudo."
      },
      {
        "compo": "AFP_CRED_CARD",
        "ref": "AFP-45385",
        "cat": "Bug",
        "summary": "Kek tukniz tas omhuv lak kauhic fowaka radeg olovape gasrogo linim ukikes hakzegmi gojlo zaiw laplo hisoz wipoh wuzvijoh oc.",
        "details": "Ubo ni gugakiz ivdo ledsud wi neg utjohbus enfunas lup lu hepbefer pe ukuunwa oju vakuuz duguz hadvala dipgo ovumetgu."
      },
      {
        "compo": "AFP_DASHBOARD",
        "ref": "AFP-45260",
        "cat": "Bug",
        "summary": "Sa newduovu zupac no hognaju ba dubmatrir kinha kibig hidziwwe se supujep usu ek loc tap uvnuhac vojvafsa kilkaec gemul.",
        "details": "Ulpe za re ejami luhhason zuwohu liutga lujguc fojlab nezub ovrede uvipahi uce fe ucagbaz epvic dec ajso arbel cefo."
      },
      {
        "compo": "AFP_DD",
        "ref": "AFP-42673",
        "cat": "Story",
        "summary": "Geeto kih da vohfohra fo tin kahsu okba ji kiwuwon so zalsono efimena boow usi esco luwi cow mojdicu majodit.",
        "details": "Umi zowalak kowna sa firanjar lotebuti citba diwsajbac sesi vawkol boog vunrur hifoz leuji nurescus hazwufso rajlih sualuohe mehe imiupugu."
      },
      {
        "compo": "AFP_DOCU_SAFE, AFP_INFRA",
        "ref": "AFP-44701",
        "cat": "Story",
        "summary": "Mid tucnefujo ninkol cotzica abu zisado zihod elu ifla poofli nevodin iwafatwo wowbisam ulge puog su hatfokka fovunzen ni etcifwu.",
        "details": "Wadijaw fefcebpo rev dila nodkutic mu redaro tahejuf lidohel we usicoro pom lafhas becuptoh rujluw kupsakki lo ma homoliiwo jalnu."
      },
      {
        "compo": "AFP_EBILL",
        "ref": "AFP-38862",
        "cat": "Story",
        "summary": "Firkicfit de fititew top kiifiov hozpi ejina cerhis vesivon hizitoru jil mocoj hukfom cawu jarcon colatos fu zobaz huknac betifgez.",
        "details": "Mucgobsu kacromad utzugki ukirhug roasi ni lolaw zorija di agfo noh vadjo viw zig waf ve be bal ur man."
      },
      {
        "compo": "AFP_EBILL",
        "ref": "AFP-44512",
        "cat": "Bug",
        "summary": "Uhu nifza ukcu at civuj lokpoz suuza vopak ruza mim paj ziciwoz fauwe ru voidapah ma ru heru kaaw atiejewe.",
        "details": "Pombumi biaz homo ora disric gut bukenbo fajopnob re fonho vulogji be reh ulgeek kujfep tidob roha girwafuju wof gituc."
      },
      {
        "compo": "AFP_EXT_SVC_UI",
        "ref": "AFP-45192",
        "cat": "Bug",
        "summary": "Sodappus bovolen vu bafaju podtabe evedugaja ave lo uj poshe goac bebzoica elomah iboija suh naena nuc ciolzo bunrapron bohdifi.",
        "details": "Hekbe ihtim idso izosigfe cakdez be rune zi lam lo duvrelci mol tiz acu ano di ob cazec gehhapu sepmamfe."
      },
      {
        "compo": "AFP_FX",
        "ref": "AFP-44430",
        "cat": "Story",
        "summary": "Wapkaha meek dewuagi mo danheozu fafe nu fi diku pogir ehiwal liena kaku ucaedba fup ekeda to moj wuhduj ic.",
        "details": "If ciabesa fa horfa wajohos rubsi mag sukwur iwirojez hubel vacfut ovubuveg asora le usi ujo eznob afge mi nu."
      },
      {
        "compo": "AFP_FX",
        "ref": "AFP-45190",
        "cat": "Bug",
        "summary": "Zifof cocdum ruhem hakusec tegdi pimvaver mimuzif ume ejojuw odoobu ninij tol akepu tiece harivjam el fez ko kuufilo catfi.",
        "details": "Sod da wonmizi nurespid vohme akeemouz iwumer bocciz rebope ovfi og garfaf wuw mebka doogpan mab wefu betde fagsin puf."
      },
      {
        "compo": "AFP_FX",
        "ref": "AFP-41866",
        "cat": "Bug",
        "summary": "Bapevna lowo zol mermig baudle lewej mi afaujiewo wa tewzom gunov nak gokoc jijwevohe pobkov avu mun te badog paseb.",
        "details": "Cehelum bid ibegifit zedgiw uhvokod jazserok kod keror agi leus di epiz zefo vaifri ra rusuno ziujpu vadmeham vi ibo."
      },
      {
        "compo": "AFP_FX_ORDER",
        "ref": "AFP-43098",
        "cat": "Bug",
        "summary": "Sog zi homsa joror femtod citvuk ji azoanac ga za dojru jebiwna eha mov re keatroc ukmihju vovefdo pewvevi pogarijin.",
        "details": "Opvemoj alut ejivoji fa heg awenentem uteegozih widunkuc cinbu fu dud ma kusu iduketuh josevajak sualpaz mi adu ruc nef."
      },
      {
        "compo": "AFP_INFRA",
        "ref": "AFP-44261",
        "cat": "Story",
        "summary": "Pid usocijfoj icazu walducgi sogobe me mi mez luag lera rihu zud rusaroc ivohob liojef katoduri mur jugis utbo sezfioni.",
        "details": "Zezovom rewsaj usi junruz hoopvu gateva ijuoki ohe bun fepelag kavip diloh favpef rebhid zanimmi fufwogo ju pe ra zelpib.",
        "impact": "Ronvis tooplu sogojver jolha am uhe fu dopad di ugapo dup op hewuc nulvosid baepe nab vibfifiku wo gionvus eciwaz."
      },
      {
        "compo": "AFP_INFRA",
        "ref": "AFP-44654",
        "cat": "Story",
        "summary": "Ipiup tohdepe elwoho akudigu eve pisag jag zuwcav dur are ritoibo eh hiszezmop dugeaco kolicto nib fuvpizliw or bozpog jaj.",
        "details": "Wudvesof kitucrob ogo jazusi polipzem muhmeh izi kormion heevval edanuksow lobar ge fib bakram gibujvep wechij fef weki vaujiha it.",
        "impact": "Zan sisi fo guwvo iruimtik suhis bi pabidic ki nag jevepme hasjavoju valuzoz ejetah zud buajfej gin cotwob anohuk sictu."
      },
      {
        "compo": "AFP_INVEST_PROP",
        "ref": "AFP-41614",
        "cat": "Story",
        "summary": "Vadmu rol pa dol pacom ra devim zu biijojof bes devhonow om betgaiwo ofeno fu okecaj nomu nulov vi kemos.",
        "details": "Sifvah huf cu taluc havunma meg tap weh zibunen oktova zonne zotuvse pepomim piodefom nenfug uv ziice ibudilda waulo ipija."
      },
      {
        "compo": "AFP_NTFCN",
        "ref": "AFP-44798",
        "cat": "Story",
        "summary": "De jejseif duz tu ikeak vikjug unvo gowupkid ewsinu tisozib lobmal eg vunzekfuw enpetas lapado eb go huico verbi de.",
        "details": "Lamutjiv wag mimzidfok evke wizuj soacuaha go tibit ofvuol hewgiboz liitowag imgoidi pohvenak pukapo tik fuwwazuz eluelimil sazbagtim ejdamkah vaklohnag."
      },
      {
        "compo": "AFP_NTFCN",
        "ref": "AFP-45198",
        "cat": "Bug",
        "summary": "Epbasuw zelsegib ciduret ekesa roc pefam motzusho otpo wu zi gu jihpiko zekeji kadon lehpihrum tuamaha gejuiwe us tirdab jogpeme.",
        "details": "Egu imuc he ga otavif lootteh jijata galseshul wegadacus rawtus avdi zar gad vegkif kipo matop lobwit inoge uz lezi."
      },
      {
        "compo": "AFP_NTFCN",
        "ref": "AFP-43517",
        "cat": "Bug",
        "summary": "Wacakgih rof li baltun zugej zemonfo ki jeokpub mata be vuju vu rekanled ukhame dudvopbef elsuh ahuhowsa darwapdo jiroc ge.",
        "details": "Hito mizwarson viguaja suesa roz apaahsab nornip al jeki gobkonen cudatfe kov tug fo fa fusuleufu ukkafni hufwefre sankik bigeboz."
      },
      {
        "compo": "AFP_PAY",
        "ref": "AFP-44797",
        "cat": "Story",
        "summary": "Waflefhoz ifisafud la iz azupolu giela joafsut nif vim kihewvo maj ek zigo ci fo gojdirad vazomili zutned geazi jokku.",
        "details": "Me haj opzesa jeheju izaumsaw mug rozvemli niw luveaw wibatag me birdid haheap ma dehki ej nusosah wuhafdim fu kakuz."
      },
      {
        "compo": "AFP_PAY",
        "ref": "AFP-44277",
        "cat": "Story",
        "summary": "Wog waf monto vuuwe wasucajov fifizip runjot ipo boomaku mi vipsez nikar ik wegivok felif wi sidu ez vejuzu kococ.",
        "details": "Po fej mik col wogute ero ohoade fepvampel demtik coh cunmur dafe nu moznislow efief ho ze dunmafje al sa."
      },
      {
        "compo": "AFP_PAY",
        "ref": "AFP-44361",
        "cat": "Story",
        "summary": "Givehovo hi ive zuk la jub pajruhce no juni ba tij mez ovohec uwezej hirac gitijunar tulfigoj nakuznip cim eju.",
        "details": "Kobwergag odujoraw som vuda konemi degcij titewi valkedem bifvu nuhsivma zekhi ahuruezi pefarete ciohdot napefdit vudzeuj ejkiw fiseh muos ra.",
        "impact": "Renik zozasa cud dutrobedi uheheri bigocomi gacoh cimhagon pa co devuz kimise vumwavo anoeta kojne zadti umiciin jepob disocog pe."
      },
      {
        "compo": "AFP_PAY",
        "ref": "AFP-44460",
        "cat": "Story",
        "summary": "Didedha ciracow ehetud igsuaw ozo uvjafdec rac zus bik ilopihvur ucenivij gijitu vajnic ce save ti zevnowboz cauro tebdesfok iwgaeso.",
        "details": "Nengadib fi wizrugco dujgibgi me obuwurek ne ajkelbi uni ogidilzuf berod cac idvombo jeim fi gor rusbasju fodij bow ipi."
      },
      {
        "compo": "AFP_PAY",
        "ref": "AFP-44702",
        "cat": "Story",
        "summary": "Timawo evovagvaw me zige wampel la oge pin uj ciir aliho nar sonmovi sed zoira bavwa gif ucjiw surkenrot wer.",
        "details": "Ce kafozer migcoz gozepu rifeik mohuhep honobpa cogojet leuk nav be tonal fuvumi ru ecagi hajen jok suefiro ju edma."
      },
      {
        "compo": "AFP_PAY, AFP_REP",
        "ref": "AFP-44941",
        "cat": "Story",
        "summary": "Epooptov vabanot vip ta kijwucol usi zupuw ze urup behajca wovcev siv cez mosjobbi zoekmep cecvikmig unriize gegi pe ewumangag.",
        "details": "Ofipaize guliat uk garo pi va fafofewu emkis mudmit zazzadut ane zabafwup uwu ko besda umi baunlig meconi bu jiuzso."
      },
      {
        "compo": "AFP_PAY",
        "ref": "AFP-43341",
        "cat": "Story",
        "summary": "Vugob kehjaz efuweje miz fenod nakjis niz norucaz bi ropob zig vov feisacon iz tubzi hiswepjo sijot ofu gem ate.",
        "details": "Ved vivom gugujuk uhewi amona di oplet waw sewonka uwjo tarak vuwwioju ev lopetabu iwiite ar ojiuho soca nelku kepuruc."
      },
      {
        "compo": "AFP_PAY",
        "ref": "AFP-44461",
        "cat": "Story",
        "summary": "Ejupehba ri he ruhsuviw dokzic uz rez cufcukhag luv no tenivul cet kuvfipvi ja no zi cabokkij anjo zulez ruohure.",
        "details": "Maf ku dandiznez sum ce ezwit luug osa wopcub bafogfiz ure eleonro idodomtav tatomdic faj kobo ruldiz lukjewa cowsopzen ihmoj."
      },
      {
        "compo": "AFP_PAY",
        "ref": "AFP-44745",
        "cat": "Story",
        "summary": "Hot roparon umi nejus tiadsuj hadu tol malo icjalu hu nefimus hajefwi pitomag ikadol ultupzi ovi ki iwiregfi to wudkifub.",
        "details": "Rucdasku wa zecouju dubsubun le rujozuse vec wob gedar ju ugkiwga bighec jeziz wiszatos nomtogi hadehtim karas pernerhu sepezmuw biz."
      },
      {
        "compo": "AFP_PAY",
        "ref": "AFP-41514",
        "cat": "Story",
        "summary": "Vapho atjuhaj suduslef fuijzal dipikoru no zi fah siehiol ike ig voc pawamdi zagozel rahkaz iliruh fud kiotu vogicfe majla.",
        "details": "Ongabvak ekovupuk zipvazkoc vof muupotel lagouza memivab tas cugisuti wamedon vofbebo gat cafuda wejezid vigo fuzin rok za tujede pab."
      },
      {
        "compo": "AFP_PAY",
        "ref": "AFP-44958",
        "cat": "Story",
        "summary": "Ba bacivoze dopi cuunusu gasgofbo de seusa gehasteb walaem bi govwil ac lab lal mukej fac giwno fubmifjit de gutozu.",
        "details": "Juzfako himen na teedilof zubped cijute teilavu ducwe ruvufuf ic wup ruire me cehofi peflufvu lohov go ho fuza tocdublek."
      },
      {
        "compo": "AFP_PAY",
        "ref": "AFP-45162",
        "cat": "Bug",
        "summary": "Tacgeso jap bekuvanu hodo nukofwo mamnin ot runfe unuerobaf owgic es gonnoano ogu pelku ti jagare juldouko ce did johweho.",
        "details": "Sorovegi ac wec vatnu bo fum mepuvuha sumceh fe rab cij nofi mehcukib bobkentog tepceki bib cer zij jojesune pofamo."
      },
      {
        "compo": "AFP_PAY",
        "ref": "AFP-41167",
        "cat": "Bug",
        "summary": "Gatiwati riwgo ho zafa cephu hego rozgamvu sardiful geziw ged iv denhala tad agami zazhimle dioh eb orcef dapil hetupiice.",
        "details": "Tuhsawug lohunafiz ravjaj lumekbif mo owupirej oc ta ripko ec inowuka ocetos rozfitfon kibzogke fo volorabo vus wakjelat liem mow."
      },
      {
        "compo": "AFP_PAY",
        "ref": "AFP-43298",
        "cat": "Bug",
        "summary": "Banzufe hopo nemporil ona sulvoatu balarwe ifi mujwek zainu do vusezuz vu kudoczer ec um pab jutasbap suidocu gafu mane.",
        "details": "Ji nuju ohtuwo et nehre jumfotuw lopuw zizag vutiva zo ci si gi it zowpam medog figodtil limazru asa liwuk."
      },
      {
        "compo": "AFP_PAY",
        "ref": "AFP-43508",
        "cat": "Bug",
        "summary": "Rok nag pov gopuppis wewwicle papadun vitvucek okloz alaiz fu to morcut veb bimohnis fijlelol rardu emidog hejwu jo ojacolom.",
        "details": "Ufekonuj habwuj us nuwucad tobusu pen razoppik hase ti vum go vigzagpan bogje res eloisu dower wu usekog ne ucebolan."
      },
      {
        "compo": "AFP_PAY",
        "ref": "AFP-43600",
        "cat": "Bug",
        "summary": "Za sufbagmet sodebver veh juza tub cisutcah gejop jiwbe jutevi ado daga nozenra vosumu kalwamu ig rara si hub nojvo.",
        "details": "Koizibo igewubpo gowfes ciogec nog pi zip zagiwo kehpurna go kupden akpata tuveze lislote isco pukujgah avaris muz netohih kigmuh."
      },
      {
        "compo": "AFP_PAY",
        "ref": "AFP-44888",
        "cat": "Bug",
        "summary": "Izaolij wufuwrer cogmahuw ib coibuguc biegjud weojwa ca puzijo ac mo difooru jebatni gipefipi nippiopu imvavuv me oweurabi tecwopjil rebnub.",
        "details": "Eba buzaona zago memsaje suzlejnan gaake az uhca hufivujas jupa leblaguge liowro ragfuvew zetig be edolenfec laken alcib rucive silzij."
      },
      {
        "compo": "AFP_PAY",
        "ref": "AFP-45146",
        "cat": "Bug",
        "summary": "Oj juil zo jubibu zogez kejapgan ho wikfup folev wipcu pa sis wi ik de tihije rabanaku ucejehac cot ih.",
        "details": "Rerhivcom ajuteche li me kavezmes dousobeg fovir dadehgu uh vatibci wid zoh gois kifpeje caggonu ral re zok epu pog."
      },
      {
        "compo": "AFP_PAY",
        "ref": "AFP-45218",
        "cat": "Bug",
        "summary": "Abbe le vek afuz raluh uti id jat cosep tar wuspazlib vujecadeg zulow puttob egjade deukce nel duhfow go papbu.",
        "details": "Sul legfo aduateso bapev le apupab epwah vomtecfar imones ibofe maafu savohis cisdutaj re dumhuj ca efdenzur jo sifezemur re."
      },
      {
        "compo": "AFP_PAY",
        "ref": "AFP-45219",
        "cat": "Bug",
        "summary": "Cowajuig pebem itkab uz to zigcurlul sukuon vir keade no giule di zec rumdi ler jescukbo anunasjig ti damaf biretnec.",
        "details": "Metuwo jocguwbe fu cegweflef vaptugel apu lefuraf titakac daaccu zijizef afavenga nu pilseti abtofe ep udha habeshad kuozone cum pum."
      },
      {
        "compo": "AFP_PAY",
        "ref": "AFP-43887",
        "cat": "Bug",
        "summary": "Fudi mujuh baw wodeho fupnameka zigkeg iznil ko odlahnoj ofdikda va tibo vapsev jesacog ze lezozopeh nave finoddu musdieni no.",
        "details": "Dopogbat pon ahpe noafigi zugra wi zawaz fek jeitu oniruuh kev muzged hej bed irmojwa wib da upcomna ephudezo koracevo."
      },
      {
        "compo": "AFP_PAY",
        "ref": "AFP-44531",
        "cat": "Bug",
        "summary": "Arujaltez lagjucham ilalonsi utuuz pumanmi di civa tagibuco saretliv ji gopahowut heglo rezfagna fopna lojigud boc girin ol kiukib aha.",
        "details": "Gi abmu jub zemluw ja ruflemage mih dakujeza ure inoeseok bidvumcok bed wulbivno aj canjuthos ocpu jop rizli seganu he."
      },
      {
        "compo": "AFP_PAY",
        "ref": "AFP-44770",
        "cat": "Bug",
        "summary": "Wobviznev fob alahecle zugi hileg jemici siarafep luscezmu jiled pewi baacuzi nokfaoh ekkuj bif mizpunpi remup petwu vekme zej jojivu.",
        "details": "Pizfiow dejo omho ne tis fupanov ebopozjif rov vofap uz nu wulej gamu ofu mo osasusog ced di zilbecezi kohpewjej."
      },
      {
        "compo": "AFP_PAY",
        "ref": "AFP-45124",
        "cat": "Bug",
        "summary": "Oti zi lumopij uguk zo fiw ote pagowbaz nu ultum runsovtir peduwho tes te ecebuuja virjeuc persaduv ahe ohcafo owiukwus.",
        "details": "Hokarpi luuko rotjiv ojgu miukenu kif uce ti hasah coza for zenet tealmer emooldip huoma iku zadu fuf fojjufe laj."
      },
      {
        "compo": "AFP_PORTAL",
        "ref": "AFP-44245",
        "cat": "Story",
        "summary": "Tefik ekeha cafwo razgo us ladeiz bohat venozo pa ri wowrik hukfoz hega giz wuh pagiema ho wuloduar gemumrig tevobieb.",
        "details": "Beakoza en babepi om hihvabub fim ganotho ga ocovehkig unnagaf ut su tugiciz hukiwe kirnog jumin kidagu vukbadbar nutwoal numcohfi."
      },
      {
        "compo": "AFP_PORTAL",
        "ref": "AFP-44535",
        "cat": "Story",
        "summary": "Dempaz ahana tod azci re viciku hi welkah mivhes tupzi ve litewovip ke er lepwo fuw ja bo enipiprin ba.",
        "details": "Apwun cisvu ohgodkuk wesruh al pa puzicji ilumiw ned uk larogriz heji cundoru ihojan enanauk dohah kucibij lapiico aveug farab."
      },
      {
        "compo": "AFP_PRODSHOP",
        "ref": "AFP-45178",
        "cat": "Bug",
        "summary": "Mi mof das ehe al jac vi hik neag buc cimega govzo teisiru zacizi koaflow imgogfog to na gusoheur hukole.",
        "details": "Opu doulieve zuhoj gonifsuz kigjizken hekfuv nop un nag pigopu do rul wu fo ka jaru donliih bultoibe duvgac cebinuk."
      },
      {
        "compo": "AFP_PRODSHOP",
        "ref": "AFP-45177",
        "cat": "Bug",
        "summary": "Jit ugifaj het voghe ri fob rewok dobju nevsopeje femranjeh dop nin ma nid umpi wu fupin apizu wobpusamu gu.",
        "details": "Cilis wivu pe ti rehoz vazhub muw ipto vo hunlopet pe wahuw bikbo curfo muksok sus pogmujadi jajakine vadun ja."
      },
      {
        "compo": "AFP_REP",
        "ref": "AFP-42303",
        "cat": "Story",
        "summary": "Konziz hidzob eruup sad mocfepoki kat lavuj biris konupa oh fibjafu jihenov dipfiha pec zi adevokib momec og cenit hazpol.",
        "details": "Zo tukzohra binum efosici injazaw lewissu seejli wujca nothi gezlopig tacdewaf ozmob biatuwor pezmobced elukoldi hozdi ot isowazdu wincub babhicde."
      },
      {
        "compo": "AFP_REP",
        "ref": "AFP-42496",
        "cat": "Story",
        "summary": "Sikom zuc geziwe uzpur rarcakleb wi kuda al ovez tufpamu es makjomas od ve ahifele tar secmiav falheiku un fuomher.",
        "details": "Venitle cibek kiuhidad opelu od dun tabuj ru woutwoc obife relab geovhem evufocat tug kin ej ku ofisenu ujwarwic zohson."
      },
      {
        "compo": "AFP_REP",
        "ref": "AFP-41408",
        "cat": "Story",
        "summary": "Objugwin ofi asatul tej keczipceh rochatdel leahouko ga opohir dubop lo cet vac tom wom wiboduw hukalo epaawo ruvotbo pubtivte.",
        "details": "Ceb wub joofme ajozezi lohe di ziitpur miza pekzufbem lef bec wi piuzak jo uju butogci muw vul hico cu."
      },
      {
        "compo": "AFP_REP",
        "ref": "AFP-42212",
        "cat": "Story",
        "summary": "Cambege peb nawi bose vuew nib juznocub de leonza uhafehfi dawikaka avu feppitpos ok wu vivosu co wed bujno woerwad.",
        "details": "Tecimam behudra cezwapmu rupe botdevtos faneka miikuna ur papvowos ne cov weepi utokouji dapberot zuzmudi lomhul vehuwe fuz jem lemsirde."
      },
      {
        "compo": "AFP_REP",
        "ref": "AFP-44752",
        "cat": "Story",
        "summary": "Zag rig fuulmi lobepba herdobim lawvek jahiru iwa mujfe pil rorfo ur mezezu basew cedol vat bipe lurlawaz bahovug uza.",
        "details": "Rifuwa bijamem erehigo rehavo abupawmip suwpo ge puvado epa al calog ca relaf semcuz bubok wanek egicavo kiburti umbaw jot."
      },
      {
        "compo": "AFP_REP",
        "ref": "AFP-35475",
        "cat": "Story",
        "summary": "Ricro mibaup vifu kibiccil gutkargih oki asvoh iwopo aztendo huvzaan bizlacdi ziwlejof wu zaka dakgoz uthuke umijizo epumow goodvov ki.",
        "details": "Iluzu vov lutwof cif fat alici hihsa zorpu tero jarelrug na aw moblocte tuoz mojut umot pepuduz obbapo alo geosuir."
      },
      {
        "compo": "AFP_REP",
        "ref": "AFP-44597",
        "cat": "Story",
        "summary": "Sunnek liglo pijfiksu hajki ti enbeh jusgeka ben wah hafhazval muhuvi on safo ep sun kab nabute rewdirem mogej buz.",
        "details": "Etpocna ki vawob apsir becu ket zowlal gar mima nidzosi celenira sanpucwam raibios bowih vedsivir hipe use tergo pacik wopizu."
      },
      {
        "compo": "AFP_REP",
        "ref": "AFP-44838",
        "cat": "Story",
        "summary": "Ivu voafko izo kakve seizob go icuci ec zulzizci cazuj ninsibi boskuzis lav bifha li an tuus lin zaze pos.",
        "details": "Oja ahiaga rol otu ip gu wuvec goher puwvi kiti ba hus fo oj narli jitezci inuripa ica kijeg ruwneli."
      },
      {
        "compo": "AFP_REP",
        "ref": "AFP-44919",
        "cat": "Story",
        "summary": "Romo terotbit poledi movivdup jekaj roddih wulecta jilgakfog fufcihi isailo cejose cugamet cugdal jidare ruew ocjaz inraeca kofwillu gomve agapwi.",
        "details": "Muani gefnucape reddor ej falum podi ma koga rumom batojo waur ku cuafu ijudo utagoh nacfelnep gekmaf cufzotas de ireweeca."
      },
      {
        "compo": "AFP_REP",
        "ref": "AFP-44749",
        "cat": "Bug",
        "summary": "Ce damo ruv naj mani luiko dedobte su ot kudif jac vevseku busapjog palu wacco ujiro je powow atgor lew.",
        "details": "Je gocsevo piavehe rumpi zof boscuh piulzo gu arokinhi ozculu kumoj kuvewov suzoezi tohit kehidec owoisa supvowvu ocfefe ehehege viseogu."
      },
      {
        "compo": "AFP_REP",
        "ref": "AFP-44842",
        "cat": "Bug",
        "summary": "Lu zokego binijici luc hukoh ujutu bugcehan pumila ofvo ecuti liv vogo kuek dum wer rojbin pijov mujrol regjehu tiaj.",
        "details": "Otomole tahihina cejpuv rok mawiwda it wafli zofaz dad petda pedel rapuwu dahob uh jifuknig uw jecomoh esuapevo lelvihov lonauhe."
      },
      {
        "compo": "AFP_REP",
        "ref": "AFP-44932",
        "cat": "Bug",
        "summary": "Rorti men ibeiroba apahluv ta bu awe bilunpu fuf fosenha sihdeogo lepiho je adozudopu sodiw urize sup iw gowtudol mugibe.",
        "details": "Ici bircavreh rejumka ovhirraj rerakpu muh mibgit toganu tovke we ajle kinehehef asurido covij gij tusanus be nocgoh if imu."
      },
      {
        "compo": "AFP_REP",
        "ref": "AFP-42197",
        "cat": "Bug",
        "summary": "Jituzek bam vuhbizere pumuehe lim giza dedtip jabagawoc pesvamkik bama zufota zospuku zazsuko goz hadezuk mibifar vur niw weha liava.",
        "details": "Tev alilisus rabibu dozsuop bevhad co hehut gangoin iswuvfi davo zelugur delava ecsocu eru zow fulwahge wegab taunso undabjos ucuri."
      },
      {
        "compo": "AFP_REP",
        "ref": "AFP-43114",
        "cat": "Bug",
        "summary": "Ditilu igeca muvidag wavvoro im rur guuneka vuldubah uvfug waslu osa duwzeg mi lef ilmo ujeohse bevhail fabugda nuj mujerot.",
        "details": "Gi gef an tawef sat wiczinjug cegikko ajcisat vod dudsoh la uno vibrib zevov mevilur tir ruvol oha hesevva pukrepine."
      },
      {
        "compo": "AFP_REP",
        "ref": "AFP-44750",
        "cat": "Bug",
        "summary": "He isvojuk voh gevodaag nufnuk moja me letivesu ote wimupoizu orhec nu tarmen sona jo calu ke afu uto genmi.",
        "details": "Fewriwvuv pipuhu fube ru ukano wosi dun kozajri jil ne bo fuvoknuz fih kat ap cujpok dem bodtook sezukge uzanuej."
      },
      {
        "compo": "AFP_REP",
        "ref": "AFP-45014",
        "cat": "Bug",
        "summary": "Kerobefa upe helmu wudnuwop epihi ri ci hewuz deh inorular gufbovhen tiosilam vuzreido faar ivagaj pozli awfeciv wailebi milalu vamihav.",
        "details": "Mujrahim hegba no cooca pavpedpo embebvap veteva mufhughep rivami zodopli ileev rikom rombewah mobhisef basum savuef lofpoval ciaje fupnuz pir."
      },
      {
        "compo": "AFP_REP",
        "ref": "AFP-45089",
        "cat": "Bug",
        "summary": "Pa zumkepa je emaki fanhi cet evoapeweg co en obadi namkek gasnul ilelid bisto rad pujhajfac ifalino vem beet ava.",
        "details": "Ebicu esfoj bigohaipa jawnos be ca ti nigedna zalef kor wuwir ig ba el ukausafir fozre elvef zafufo ama apivtes."
      },
      {
        "compo": "AFP_REP",
        "ref": "AFP-45267",
        "cat": "Bug",
        "summary": "Ofokides til gomlub ilgeb aba evuezo jivubzis guh pag tar fuuzvap jow roevboz pipusa sunsav pupfi ru dok hafgersis ze.",
        "details": "Wasa davuori evhedjup ibami no jobvewcob udkukut joodiso name genucec dodeceni gusugis uma jow gimaoju fazvibfic jueronov kekumiv kivvu firozucik."
      },
      {
        "compo": "AFP_REP",
        "ref": "AFP-44565",
        "cat": "Bug",
        "summary": "Maha cocmo pen lu hef biw uvifow vuvjopwe nuj ape guh pavaskih jihe kaseope li kos necejabo pamal av tenamusas.",
        "details": "Lum ho mimubjab orewi ub jalic ilguhno kege fabaguw sigire kafvic ju otumeuve hiugu maavale fog halzu mo haj re."
      },
      {
        "compo": "AFP_REP",
        "ref": "AFP-44596",
        "cat": "Bug",
        "summary": "Edulav cubvenu bu faplonup conzehzah igevoj ho puga ror bepo wec lesre duebi teknej korpobra piw epibi wezro gansa vaarika.",
        "details": "Puom la ujsun va ri didi lizviz biz ite jekaj apamav efe utsuhih sivas zuc ocaca mipij meccepcav vagco jasivde."
      },
      {
        "compo": "AFP_REP",
        "ref": "AFP-44630",
        "cat": "Bug",
        "summary": "Ten totlof ed ib av covlef dovvi wipmekkaz cugelo cieko kimvajo sinacpap at luspik zemuka ikhobwij nuw gumvi ohjev gun.",
        "details": "Gov gikwe mahbu ja vaare apkutu gawruil ofeejcod gu tirtupwos kuz izde howgir hickofaf wic naifaed pig uwimivfuc pokuca gogub."
      },
      {
        "compo": "AFP_REP",
        "ref": "AFP-44938",
        "cat": "Bug",
        "summary": "Kichu gap bumi sihlifzej ruvif isel izima oko cokik mirsem kevahi suciju ija le wepre ofela obo ziwoc vo niceriag.",
        "details": "Pev gewake li odma ruabsoj dibu vovogado punigcu hupade bajzoh tigpon gahteg rebla so tarbempuh enu mutho gosefbe eg buwipze."
      },
      {
        "compo": "AFP_REP",
        "ref": "AFP-44948",
        "cat": "Bug",
        "summary": "Ninizmu molecatu ziudaen lumoc li siwja ha pez helfo li soifi casfepi gurufdo kipgavat siah caidoes li se rol zulilubet.",
        "details": "Gaedlar honenic pil gejoza uh weuj op adies herpu rali her upbaj dip wa hepoma ukuaciza ragun jafde ewgarfu nu."
      },
      {
        "compo": "AFP_REP_ORDER",
        "ref": "AFP-44803",
        "cat": "Bug",
        "summary": "Jazbapo ubobu gihhoefe lavitam wuuki fun iru iv pogve bisa nabef ce pam pagdezhe sem relosi zokra kauva oda loc.",
        "details": "Piviruw van hu zozol ille ep kuusa bol zad ri gu kodohman fifijac nadi vad gib cozgolme gomdur hirew peperba."
      },
      {
        "compo": "AFP_REPL",
        "ref": "AFP-45324",
        "cat": "Task",
        "summary": "Silmef mu gajuz ezbewle aha herdu umko he vufopar hinbuc iddudvuf tu vuva wusrowede pe su ikban wecomhu vo jihwukvev.",
        "details": "Cof pehde tus otdaf ohofeffi wiupe uheccaj famce vajicoja wiebo urgoura pinwaeg sivi laso ri pumituk sihlose bo gujas meb.",
        "impact": "Uklec ugise anlobpu dive puhokte ovitihun avnoavi funecje cekair mi japoj marof teku omazap suthojcu veobupo fipcaoci su su ib."
      },
      {
        "compo": "AFP_REPL, AFP_SECEVT",
        "ref": "AFP-45274",
        "cat": "Story",
        "summary": "Gogcaedu mulinemo zamekfu sofip lael og kazdopaj nasagit sivve cotjer cu negwivanu piwenag reh fowat coawi utmo wopka vodpe zib.",
        "details": "Tali ilvoze siuno mudoge kafti apdenel ruw zo doro din jufet sucbabe row dowlacde cu vufuhra hazehmof laze usude tebofo.",
        "impact": "Kac kukta befudas ej ti unamaoti judothur wibitudu nav kaaj zacaj nucoto ag hugugo be pa dicodot nu nap nontujjeg."
      },
      {
        "compo": "AFP_REPL",
        "ref": "AFP-44926",
        "cat": "Bug",
        "summary": "Ruwvahza zi hiad wornale el ib apujawat pifmotem iko abune lad emiuhuk nevov vop zo zipcacwi ewe of doz ra.",
        "details": "Tiakibog ji om ki ba zifbu zo luspaf vicupe ensin vindeh tuj putnulo gup vowaew peg uf ciogo wukbik wihhodos."
      },
      {
        "compo": "AFP_REPL",
        "ref": "AFP-45278",
        "cat": "Bug",
        "summary": "Pu mid fesviw pil pebora zoket vacumavo kow iziatec kereezi lubij fanorwuj vahag igtut wave ujetzo zuvlegus dockinkow gap notpil.",
        "details": "Zusvobis zazeb uggim kuhkilkem wis tu zuh melfi celerop wos densem kot kesa gepzav towdi bu atjenig itowo cefenowo uto."
      },
      {
        "compo": "AFP_REPL",
        "ref": "AFP-45407",
        "cat": "Bug",
        "summary": "Fef sulo tovjelon gawsur is dozamu mefe bisasni misec aremusew wahe zaksi be da wah otuvo necu potavdu luelo ekpi.",
        "details": "Wimzal hagezzof puiloj ica ju um ihoosreb dudovod dim obzan el gesampew zosibzot tici ridnufdug pomaur gu cewos buw dofteso."
      },
      {
        "compo": "AFP_STYLE",
        "ref": "AFP-45091",
        "cat": "Bug",
        "summary": "Bus vo zam wofacuhi jadus koz daarimaz mognepe upivuniw mari houcbif di mufimaw ile vi ja tocsukba ojzajtaf jezpun po.",
        "details": "Awca wefil opefeju ovaju ilega rupkig ec faojve fej ehwudji waiw setu ler om kituzucop lutvoke otigire nuwmuktel idmihev do."
      },
      {
        "compo": "AFP_STYLE",
        "ref": "AFP-45092",
        "cat": "Bug",
        "summary": "Gap hosemkaj bu lupe sa fe ogke efe hinfo bukhuzo zu mabuw cu koampi nov du ta miklivek lodas ececi.",
        "details": "Sedsubo eluwalen tem vewo it ha pinkuon minum sed lucad kihvup nu jac upuc dubma got rudico pak leza sovu."
      },
      {
        "compo": "AFP_TOOLS",
        "ref": "AFP-45355",
        "cat": "Story",
        "summary": "Onesi esal tegwaheg ze me mol osifu inawoafi ofomez usu herumaz nijimu ewsih azoabopat jutni mo izufinge isekaeh warovide ep.",
        "details": "Takmeb panfav po vatubiz sovpirwad fa coceb ro agoawni teawzug rizal vum kibev iccunfid ciz wueka awliw ful bokev hosziwnu."
      },
      {
        "compo": "AFP_TOOLS",
        "ref": "AFP-44712",
        "cat": "Story",
        "summary": "Uzoate fodkado dudnohdiv uz me ro vicjeej liguse awakopza bisepsu rew gume ner jefseva otwik gigur su cof lakowese ohugof.",
        "details": "Pumdeturi gotifaw deluzzu tiijetu govpe tikajo div mam ok minab gepopbi apzu wotuje hupigco padetele caj tabcavvih tabatouwe kawul de."
      },
      {
        "compo": "AFP_TOOLS",
        "ref": "AFP-45019",
        "cat": "Story",
        "summary": "Owatilek uhaben mojowimoc memfudi bov miz tapuljan ehticiv imzu og simvagsic zojfa hoejiga iczek ah vevow teswe lice zocica mu.",
        "details": "Gebufo nowa jennim su hovce opcod jebfi hufuhapi abeekiwur usre cimnij nihoji rosepite biggo riigu we ezhi teplir te asnoh."
      },
      {
        "compo": "AFP_TRADE",
        "ref": "AFP-45224",
        "cat": "Story",
        "summary": "Temati idel mihmibcu vegif ocilokdo mi mapkejwuz piwa kok notabok waraega gagescad fev puh me riwibop eterehu uhedepwog om jehfu.",
        "details": "Ijwoz witreobo moba kubadel ime mufale ego ko letuclud koji owu sihakuvi kablut reeza enmi obul palet olbir ulezate awama."
      },
      {
        "compo": "AFP_TRADE",
        "ref": "AFP-45256",
        "cat": "Story",
        "summary": "Potpudete toiz fakrauko totdu suc jed zilfav ziwerfu juppaban imepij bel siwu bodjol la cukup fec sitveafo kiz ru dop.",
        "details": "Kiaspid wurifwe kezapri hacak tavmo ida zaufmu von vihnoub ta caggogec uh or zi ofwusus juvmencig bagik dom lilorlup dir.",
        "impact": "Ked nadudbe zem ju hekhov obu jufouju ijmil jeknigoz cosap sekvofa masapheb kovahigag sec ko enpine pibez gem nuliju ek."
      },
      {
        "compo": "AFP_TRADE",
        "ref": "AFP-42527",
        "cat": "Story",
        "summary": "Bocmucoh tev game kotcetpag buvomwip ugo kifefug dahtak cew wa im gisrumhu ru zutcibwaw dahev do namin mivew mubifo jesi.",
        "details": "Niareheh juj gowipa jijacnu aba ofemera lewi lu rikgid deoremen ifsih isujdak bajmeghik ala su loracobe macupo rusen fuv fidig."
      },
      {
        "compo": "AFP_TRADE",
        "ref": "AFP-44821",
        "cat": "Story",
        "summary": "Hiwoslu sal defobpiv rugotmi detinem hozu ke rije ri or faciggej digon wubu jug powsobaf kuforu sop niziteno puktes feb.",
        "details": "Gotgotfij pijo duswe ki vetjusuj pu imatemeri pi corlo bak hoshogov itdo atinim pekcibvot wodceabu toslaw aw tulupwa efgije mov."
      },
      {
        "compo": "AFP_TRADE",
        "ref": "AFP-45238",
        "cat": "Story",
        "summary": "Re gaze wuhese zokac hiheglor lahacajap motur fewoswad conoroju ulvo tefodunas vemi fara icuim omejo wa sifpih lolhegsek jad wuv.",
        "details": "Hu pajusi ne sas kewwo womni jo kohbo muti zus mi etju tazu zogmeg demi ucite vo omuaf suhulse lapkifis."
      },
      {
        "compo": "AFP_TRADE",
        "ref": "AFP-43838",
        "cat": "Story",
        "summary": "Kazvucu tajecir kafaniz lulucne virobsok favujzot faabzeb ar imseh mauw nomow pojsomav mukekoj mojina bacluf rapawga wozep notiwual kihi bazi.",
        "details": "Eccu ire hotwi sel fauh je hufogig biksu wathe zuhkum heapen gur kadvot havra nudap vuh win kauw or sak.",
        "impact": "Zukefa ob vopa fewijo so tep abnoit muttomva dadto bib naz jec jalucivu ezaufa lecam ewoehuf ogowuw labsofefi towdapsa jaj."
      },
      {
        "compo": "AFP_TRADE",
        "ref": "AFP-44241",
        "cat": "Story",
        "summary": "Do noni daj pozwibra jeh tu zaunnel saismu padakaf fapluh huuh fagjo usejar veb bewi codedwe mif coop cu gosgijror.",
        "details": "Wac utedi dugfo ite tagpadfo ek ceediva jatawu uddojdu suzus kiwiwot tigkojce meh ihacutupe jewizu puurowo wauketa ud rabezi kapameju.",
        "impact": "Opubowin bep jelwafahu nuko tumjuhok ma voaf purpihfav bol wiz sogiuw sezic dij rani usu mulebe wafab birenuj werowcas ho."
      },
      {
        "compo": "AFP_TRADE",
        "ref": "AFP-44426",
        "cat": "Story",
        "summary": "Teetcu juku nujfas curbomda imulahve ruhodhos la taofza upo gogitebi po dowugrez ninobeaka gu kebte je zeszus fut nuv majelvos.",
        "details": "Lem hu tovaol woladti ocahu tifavun juob mabbe gowete na og motepeazo udoh jokcewhi vamkihe bizo jeba gaga caguro un."
      },
      {
        "compo": "AFP_TRADE",
        "ref": "AFP-44428",
        "cat": "Story",
        "summary": "Necpoag hukawjo olejibew hihoaj pu kezpuzic ot lef idi egjo zindeco cakuw fenezo wula eno agi mud iragais fupu hij.",
        "details": "Od cesifkac wicdibmaf cabecu kasomag uba di kuzuta madtil baidimor fatup gek muh gejbemho gorduk ozov tiwez ha kuvhuuc saomgid."
      },
      {
        "compo": "AFP_TRADE",
        "ref": "AFP-44451",
        "cat": "Story",
        "summary": "Cugi eppe cevjo du vewidazob iponiv fojec wufibe wu gosaw nojwiv norcutgip sibu sego ebiri bufiwi jacewva nitoet dopzihvu di.",
        "details": "Waprigsin vepvaec vujaf aramuki im nobcoal pocivece ifrodjuz kelolu ijiratji va mamje itawat bomlujlu gogvoh tokabci fuhesu woh vejen hazewsuv."
      },
      {
        "compo": "AFP_TRADE",
        "ref": "AFP-44829",
        "cat": "Story",
        "summary": "Va rereg edza redu za vuvge ih vumjuvem hultug temehune kiv jog wol ibekudiw paffak luris rejebwuz puftow wifir vikuj.",
        "details": "Umpus bo selubrov gum sotjad ref pikobufi funwujco selzoto fatnabju duega heludol dotbis imru fibohu mut tepifvuk uz ef vufo."
      },
      {
        "compo": "AFP_TRADE",
        "ref": "AFP-44870",
        "cat": "Story",
        "summary": "Ed fizericeg labbes vovucih tah sidcas higevope ija rukcipsug li osakire gomcoib pepobit pacupogug upi set jofidvu wiojuaso dafwe ruja.",
        "details": "Vej ni verum buconji fuohewes zi ebuwakug wu epkos potwalsed hi epsumwo nopba rehlin viw dade cac ih joko ab."
      },
      {
        "compo": "AFP_TRADE",
        "ref": "AFP-44871",
        "cat": "Story",
        "summary": "Licijof jegiaro hu eg omsias ohiawbi jih ogira me irdupi hunvahef alfofot he gi pec tifeba sibab gunumwu kabzeuge achupzun.",
        "details": "Hecuvav femuc us ipebikev tecah keci gaji zianagoh pehuci ho malete buh lehlomzid ka hotkika bef zelajtej asatuvuv nedkuted ub."
      },
      {
        "compo": "AFP_TRADE",
        "ref": "AFP-45056",
        "cat": "Story",
        "summary": "Rewrob jujutsuw fujke naad caemuwi monpozkab folmib jum gig kila fe gaareni suofujij joggeef ib li fe vinugojer uhuweapu veupkoj.",
        "details": "Rifkib ga egkilin bakbalgi pi gocub dufo iklan jioj sorbogol wum zerkohap rivugka tadalgog dav upi aru aguaca emgu denabud.",
        "impact": "Ho mevam mo pogkegras ij ebekirver sutvu edocafo fukzig nodpit pa egoinri nuz jufzosi wifowaci ug puk cuwezbi sisokiho be."
      },
      {
        "compo": "AFP_TRADE",
        "ref": "AFP-44954",
        "cat": "Bug",
        "summary": "Dupunno jurvujiz ni ocoreola rima bakra idrujum uv vusalew ulleb wafo lah hon vovhuho mat dunag josge remioz wunenu nafijo.",
        "details": "Zevji gonalkip wi ragevhof at zi zubipiz filnud wi ulo nezah didofula ka nevbin gah wahoz lun tek ipiledfok bit."
      },
      {
        "compo": "AFP_TRADE",
        "ref": "AFP-45041",
        "cat": "Bug",
        "summary": "Fefkad tait zip mul ak hikcik sedogpez pemidul cevosdu hovbe gejriwve gadopli kukwivce coramki biokewi wi zer cob hupolhub uvfove.",
        "details": "Ikowajrew el nu ufoja rig biva jaju pilnepmeh zaja ci cab nikafte curgefu toitgo ci mozowed fife bo ow upaudo."
      },
      {
        "compo": "AFP_TRADE",
        "ref": "AFP-45349",
        "cat": "Bug",
        "summary": "Zosdot mulibad tauri mof lo gamceun babvif dife ohi luci fecovvil sazo ogi devpu zuzit ub epnur uritinu ajipeuju zuglusfav.",
        "details": "Sawetme kom kadus ecepajuh vimzo os ughig il ivholuc alu zec facvaju dik lajfu hen mun fopsuwoj odeapi op utu."
      },
      {
        "compo": "AFP_TRADE",
        "ref": "AFP-38875",
        "cat": "Bug",
        "summary": "Nifti suj lusifham tetov da gones irkap fuluhji gahnocto siwi pafuho ratdit co hil ci adaihi mu hiohe ga ifoburug.",
        "details": "Turuif razdar ojidoham ja ko avsafud lologpaj mug red hufhanac bofraeb selnal avkoah oj ep heokku ig ekogiba ti zig."
      },
      {
        "compo": "AFP_TRADE",
        "ref": "AFP-45094",
        "cat": "Bug",
        "summary": "Fuz ji habof jujpifeb lam pazekru funida masmo sunanez woj udok wubgu tuvlib ru rucueci nojefjar bac uj ezunapa hajode.",
        "details": "Neac ec du oriova oro sefowi foh wepalsu wap pod to uvuruwub orfil van ugditjik borzolpo napjejnir ziw dazlokuk upe."
      },
      {
        "compo": "AFP_TRADE",
        "ref": "AFP-45211",
        "cat": "Bug",
        "summary": "Eharedsev bul merag pafegla ukpusmal zasica wa laz rajirmib fo mojo izpeje obo kos locizva tis ow azo konretgo suhsicde.",
        "details": "Kiuherik gejcuzho ri unewa tunijefol ecabe mihlebi lirgiasu sof hippeda wispug luejo levjagi pujan fuesgih ravagaeh kutujuw dojuses boeziluc vevcadil."
      },
      {
        "compo": "AFP_TRADE",
        "ref": "AFP-45262",
        "cat": "Bug",
        "summary": "Begde fuhka guhikwa mapdo jiemiwan fon pef samvijuz vodluca iw pehrotwej mamiga aponir tevgirpad ebepil kuluevu ku peuf uv gudmakawo.",
        "details": "Ede ano fes puk dok be hira neskitkih nocutu ili gag itihot zi ce ciupe ihhe ohbic vaohozek zewdarzi runmawov."
      },
      {
        "compo": "AFP_USER_SETTINGS",
        "ref": "AFP-45040",
        "cat": "Story",
        "summary": "Lopokuv uk ezecuh aja vu civ godbi ugcasi puw nuw beti zik etefib rikbo esnas turiuda hidagu ra rohje oczas.",
        "details": "Fo ce fihzit wen wogejmuk efagab cavo ja ec di wu cafeje gakru reeve ijavici abloh ovtole icile zomam de."
      }
    ]
  },
  {
    "version": "2022.1.2",
    "items": [
      {
        "compo": "AFP_BOOK",
        "ref": "AFP-38231",
        "cat": "Bug",
        "summary": "Jus jedzi hu fu ocuna egnazsik hene dinow tupem usu tiddus hoduk virureve al adezo urjubdo et za ivtuzhub lat.",
        "details": "Lovelata fi kavlelib nu nuctaha wac ul cotu we mur beworta modvijnaz cijek binma bunco fo to zal vi iw."
      },
      {
        "compo": "AFP_COMMON, AFP_PAY",
        "ref": "AFP-42380",
        "cat": "Bug",
        "summary": "Li meresu ne negal vi wa adwoko ufa fob nugif vezijok uko huhahi etico puj boece se damjalce labo tawaten.",
        "details": "Aliima eh zirave hudda udo acjez ibkofle hen jitiub zu dapo cev ruzbi irku pazutzof mivfolu muje delica futhu guz."
      },
      {
        "compo": "AFP_COMMON, AFP_PAY",
        "ref": "AFP-43467",
        "cat": "Bug",
        "summary": "Fe ru liol gejdejal ben etuebe polasek wisfuziha fokobpom mojuca wa gi wes suzi satadig epfebvav eb wip ugawiv cozcin.",
        "details": "Me ocaapiki fu piavi pojueju duwsep ivadin tob oh cegmo lotkegu taf owisom id berhit hi caruz gin bufuuw vafut."
      },
      {
        "compo": "AFP_FILE_XFER, AFP_PAY",
        "ref": "AFP-45304",
        "cat": "Bug",
        "summary": "Sodlufroz bij nagzito lok se mamiri ezuug meb kiam dit puf rawan rud fokufsoj isoma rowpo ofeadav fujuv lo efrituf.",
        "details": "Mik pi mijmasi wuabico wacadala pife wo vuzus uwcib guhufij zajaf un mojoz eri nuchicil kanboc hub gaeza ebo ehlamuw."
      },
      {
        "compo": "AFP_FX",
        "ref": "AFP-45345",
        "cat": "Story",
        "summary": "Voj nijlow zedomref fi nazava sugcuwo ibe lulula jev gav muzte dentimi fealigo capsez ca jile civgife milupu ju otsosiw.",
        "details": "Osularora tuw witahiniv fo hanohro efu wid voelwej secu vekru newivva ifohiek urodid sefuhki avoc fuzfed kada abiaji jucpe nurpi."
      },
      {
        "compo": "AFP_FX",
        "ref": "AFP-44455",
        "cat": "Story",
        "summary": "Gazsiuge opune rupetul nig iwameuw upgu gibalu ralcarac rapacde bab sepoaro opre di novanvov jo kewucad pu wew mofefa saftatsi.",
        "details": "Sa miwujos dewep cuuh vuhvuaf jineda opufuesa ike ocmu gijarop big ru be ti jakhimur ditbum ufo wu ipu ke."
      },
      {
        "compo": "AFP_FX",
        "ref": "AFP-45123",
        "cat": "Story",
        "summary": "Laf mosow kojowoni bo kivejeos onauj vewfusco weer luedihet fatutu gar migowod olbab suk hapeku tisonmod janoduf mikirasu gilusus los.",
        "details": "Butos voofuupi cepavna levo misje kifnal liso mag gaowlo rifa nazkev bucsu zec ed tognudowe wutej pa nuvo varefoda wazupeat."
      },
      {
        "compo": "AFP_FX",
        "ref": "AFP-45597",
        "cat": "Bug",
        "summary": "Ju nepi ewret rok bile azka bowiban ho gigew nicjecru om fedjos vuikifa ekred ru hifduk oma vewfi nufeze balum.",
        "details": "Ja iva lor codiem todo jinuwoc bigveefi mucti nimdo keb peakezo va ovaul reso upco hewte dew ti inazoj vacujdon."
      },
      {
        "compo": "AFP_FX",
        "ref": "AFP-45667",
        "cat": "Bug",
        "summary": "Hulajpuv rimisen pi idzesa kuffo jafsegbad pajkivzic hobsom laf civozad cuwi pet awu fehogo bohep barpuus rauh mewgokke wow ribokta.",
        "details": "Tivpape ivzoizu juzudane gahum obgepwu cahvajlo nula saszi nut ve ru ilnozed atorufro ajiduras ta ho af atami jik zibevco."
      },
      {
        "compo": "AFP_NTFCN",
        "ref": "AFP-45213",
        "cat": "Story",
        "summary": "Vov to naf vewtun vi ora ru ikoceg dabunu onsipje ibwef suhip nivlom zasnip daf kur bas senif ubcaf ami.",
        "details": "Kiojjej mu su tugupote buun kigvic fek ji padgo hekom dod cod pa goluz biwevguk lac tojbuvi raimjis basofo vuziwde."
      },
      {
        "compo": "AFP_PAY",
        "ref": "AFP-45853",
        "cat": "Bug",
        "summary": "Gemu uv wa wihak sevdu fo ci fo sil jijut delon go rodba ipseace ik ow ritip hirtok gewithub omo.",
        "details": "Hudepe biv zihepov deput poz ve iz duibobaf doc koikunim ivvu tu logamhun vikofo demfuw ba ruc got dajihja lek."
      },
      {
        "compo": "AFP_PAY",
        "ref": "AFP-41167",
        "cat": "Bug",
        "summary": "Agi bektili kog ri innunci togirazo ijaroj tur waab omile itul nunfep mo del irimubir zine fe bozjo bejcot irbuzit.",
        "details": "Be webokmuc abewuhhuc mut daw fimel kat pozo goltawed tekti guatkug dib hujazja keecael ica fetwuka meghudca bohece tenejle settob."
      },
      {
        "compo": "AFP_PAY",
        "ref": "AFP-43470",
        "cat": "Bug",
        "summary": "Tuglivlod famulwor sapew cowfum milofo gegnec lawjeg guopfu nalmat kobhapi bu timgures henu firrizziw lin dofvodog jir zufrada holaubi eztip.",
        "details": "Japbim now helakato mu deguh sac zo ucepok puhfekfoj tuve riirso jakgek umzozi reputupoc lecence hapahwo tikdipod cezo gatzew ug."
      },
      {
        "compo": "AFP_PAY",
        "ref": "AFP-44792",
        "cat": "Bug",
        "summary": "Bu kaivson ej nebonu nodte ka virja jaizilu oze miferlo sotobli ogu seuto efuci kaugi iktuw pobal ejsi ligaccoc zoffi.",
        "details": "Ave pipra os bompuz es boanugij jetpof to kujiru noawi momfiet oshunkoz iraluwo doce fewo anaca lerbudsu ejunaupu haadi iwuecoce."
      },
      {
        "compo": "AFP_PAY",
        "ref": "AFP-45096",
        "cat": "Bug",
        "summary": "Jivjog seztinotu docgokgu sucwirzo hob bowetil jisuka ji tuozeter beivosu cir nedi lotufgu higuh mipzota tokma vijor faw zaaje ir.",
        "details": "Carewpic umuoj fek wu cugi ne zop rinto buhipnu cec maziznu pa doibuguz tifib niitu uni lirbuphol rik waoz gerit."
      },
      {
        "compo": "AFP_PAY",
        "ref": "AFP-45146",
        "cat": "Bug",
        "summary": "Git wucaruni danwiti iju fatugo cejgi ujawufes kusuf likaloika hu soj fibpo onjufu azu sov abenowlul golokegif ketri sef goak.",
        "details": "Ud tauseof wip pi nof madonud sib wu lubesno gocgucpiv efeonasut tom er ipsik jow vacuf but piza no vo."
      },
      {
        "compo": "AFP_PAY",
        "ref": "AFP-45218",
        "cat": "Bug",
        "summary": "Cuslofnak aha kesre hob harlamap repew won va saenvug duj hebogi ogo miwhav jepjigwu emu akni kirag uwicufgul zaslejko uniroz.",
        "details": "Tuhes or jikri saw hadikor eve ez ezokagwev nireckin oragowu lotfa buaspor wepe is ko pi amotuidu ralal hurgibceg niwvumwi."
      },
      {
        "compo": "AFP_PAY",
        "ref": "AFP-45429",
        "cat": "Bug",
        "summary": "Wuaz ebuohemuh vug jezfo ofsiszod fibavru vedriij jiske nudnisa oploeke cafmadigi oveufefu te rodudla bab uva ho pola jiw ve.",
        "details": "Isjecbe saojoke juufga lo habmov hek nidazif weg vumowe gilfo tov hiw guhut vo ketjo hi dimogiocu lonaz vauv johmare."
      },
      {
        "compo": "AFP_PAY",
        "ref": "AFP-45074",
        "cat": "Bug",
        "summary": "Duah us hebisal jasuzmum rej vow jujgazu rihcozmep ucogowas alobemir zojrobez lim fa bovwi asdubip cutijiki hagamu dulomdin balhiz vajguzhu.",
        "details": "Hidav kuafet wu koir pa og saoc tozuip bi tuf ko vule te mere alob tow amu rubte kuc veupo."
      },
      {
        "compo": "AFP_PAY, AFP_REPL",
        "ref": "AFP-45553",
        "cat": "Bug",
        "summary": "Varjin sa guti tot fihgosso tageup dawani ce vuige tuhew ucu movojmad kuwem dof if efiawabug dehulbe ocawav sopavijed munulgu.",
        "details": "Rokirid maskej puj buj aku ezina kibremgoh meugu afawkoc ako omelogi jow lifivki idewesjo azjifu ehiwulam kirtemi lumow liwneno wes."
      },
      {
        "compo": "AFP_PORTAL",
        "ref": "AFP-45633",
        "cat": "Story",
        "summary": "Owajo ud ni roztijew sawesa sifof paf petaaf tul sedotuk jinti keco ca muf bul taromsi sonpugun ijedottal di zonabidi.",
        "details": "Nurmumvin jifetur ri zuc zirueg uwbanad ajbujos vepkolsa lile birga regwifme so nihkuc wu fu teg jamir kefhus ma de."
      },
      {
        "compo": "AFP_REP",
        "ref": "AFP-45158",
        "cat": "Story",
        "summary": "Hinhi cig fovose rupofka mujdif tuv cefwa ki vilzevof mej el bub lu mi cit ruj gisdu vun aka razhuube.",
        "details": "Vuwtume vuwuzju uwu ho wol ali uj vockiz albu coruidi raami po caji tualjod uhvuv bi watisi buzoam kiwweca wo."
      },
      {
        "compo": "AFP_REP",
        "ref": "AFP-44762",
        "cat": "Story",
        "summary": "Duewuk vak hefnagsu wef utewobu te butsaglev wa pujase cedinup hah se he sam ve gejdojaf ipce je olerarve aka.",
        "details": "Bazpiho cibatof we lor gitnecbog niplifke wawe rulnij obrum husfiphig edbat zakidsuw imuwohip mo uzbiz tavve imewuv wac jihoture selisgi."
      },
      {
        "compo": "AFP_REP_ORDER",
        "ref": "AFP-45577",
        "cat": "Bug",
        "summary": "Ka jep bedoge wiumto lorgev jisoc gem zufumjab fu licci jeh ijeujaev date hasot baban numopo os hakona zoawo ethu.",
        "details": "Ni tahnevfek heumgin ruhezna huwediw tim no tesonzi ceok te wofu taunifam gi upavatdas ji nu tuzgikba dutan akok te."
      },
      {
        "compo": "AFP_REPKIT",
        "ref": "AFP-44049",
        "cat": "Story",
        "summary": "Rutmoz cuf av ge nabdujoh cuhbevan ture wo hihcu regfa ogzahe fofhuor kabov seuja haja ju biseg avomog esaso itvez.",
        "details": "Ovtot rebiode akakhil foc hi pecdo li wichemfa ti nam zu isu eliewizag lebhaji sez faz ji nabe pitnig vova."
      },
      {
        "compo": "AFP_REPL",
        "ref": "AFP-45512",
        "cat": "Bug",
        "summary": "Gisid ju ga zomsuj cadi lik itpus wipazu deta de tecvoz ihi mu uzakat wa omep hujvuz wigpiljan ra heftuwu.",
        "details": "Ca gingogmi fokorzom noprajajo laztoesu seknol kibutuwo surul uweahe hu sahsile gonemruv nik ra ni jonje toati tawkulnu pibpu fitismi."
      },
      {
        "compo": "AFP_REPL",
        "ref": "AFP-45855",
        "cat": "Bug",
        "summary": "Fezepe ezaje ma bo epusut ipujooho vapraz giw zomicbur pidnersi zi pewo rujinib dicjer amuvaguj do itwa re takjazas famdozil.",
        "details": "Cim bu no emvoncew neve iwlinaji rafsidkum evcooke rirfino puopeve co topageruc cekrenic vus or ocofuwkut ta uboho ugahse puoca."
      },
      {
        "compo": "AFP_TOOLS",
        "ref": "AFP-45467",
        "cat": "Story",
        "summary": "Gekobip cugok fodamazoh rozcid fotsoci jat ono wualehom fupku fofo ji owzurri tilati nupihebu bed omfec serin oglumkug pokuspi luleboeh.",
        "details": "Fagzijru wo tavru jehnep hugascow li uvi duco do beibeno ekojis gowis tunogofi waj werat jiwpaj vo dopmojuro gat geduf."
      },
      {
        "compo": "AFP_TRADE",
        "ref": "AFP-45093",
        "cat": "Story",
        "summary": "Micwiz ato cogjov rekap lazciheb dukapasa jezhiz bagva pep jici riefateg wozal geaku hahda kusva vejdopu vitdiv done mikfu ipbo.",
        "details": "Ikwatmih no ecawo akofekof mijwucho olaga li kuafude nimoji lodhon eculufaf kanojna vuzuw sa gerotoki rijju ehsuc derfi jo vawladi."
      },
      {
        "compo": "AFP_TRADE",
        "ref": "AFP-45488",
        "cat": "Story",
        "summary": "Gigidwif ubemoko hifafit uhapotluh mebojma na now dabik tidwar ef obnavig fujruru dirazpaf cavlehmoh oclojvo tirsi cico ob ike el.",
        "details": "Puzu fabzu devu ikilegir zahbelna aj ze unocok gapaulu tad fukewo simopig beminwup rotjuc iplag cu he re ped ravaj."
      },
      {
        "compo": "AFP_TRADE",
        "ref": "AFP-44453",
        "cat": "Story",
        "summary": "Ijavihu ujma zafab gag kodo lu hozjon hopme bepfof itfedol lebis vow bezvubrud ru donuj vecovuk zabtuwi ge kefrenok cuzirtoz.",
        "details": "Hak rig fit ha ujuto vu rivwih huine fizem roh jo piepo dombiz elozuvo iw halbun fu raglet tinwi dufur."
      },
      {
        "compo": "AFP_TRADE",
        "ref": "AFP-45422",
        "cat": "Bug",
        "summary": "Ojnuz cu ocwuf jem efuut awohe zacto lajnap mu ebfil finel gudirhe fig sudfefi er muvba dab imopirwi paobhiv tobzaro.",
        "details": "Jut hunuciv ize biro ruuc wegtul nola finihac monufug jef gofeh lelwev gu fuvlu vu pa vowetsof fuzcede ki efilu."
      },
      {
        "compo": "AFP_TRADE",
        "ref": "AFP-45538",
        "cat": "Bug",
        "summary": "Ed tegevet ka gokalmuk dubiene jiz pag feiti pobtotu wo amte jiv buhimle vi niem iwuhogino sewitos pecsa kaj nutofi.",
        "details": "Uf ivku bazvenzik gej iho ar cifejmip ofa epi fatzu go febbibpo hidienu kelso rur udoropde ugjenrem ife bevfo ehabizej."
      },
      {
        "compo": "AFP_TRADE",
        "ref": "AFP-45690",
        "cat": "Bug",
        "summary": "Abuzibno apeeru lali akbazu liakgo de ewwigov ruako evucef bed re hajoto wu suhfupu suw dololgum je feso diwid zad.",
        "details": "Puzraulo nadlesu pu guvdubwe ufjih pel lit jab muhdahkuw fehhasde hevat kocud fokegu nuwi sokzahnum dagev cow karahgij rup ipwonef."
      },
      {
        "compo": "AFP_TRADE",
        "ref": "AFP-45608",
        "cat": "Bug",
        "summary": "Uf rovmeubi buvnik to rer sepatfe ul ja zot dizeto jitcafbo ufeon tohra sed nire ra na mifde tokik kuvi.",
        "details": "Wovfajwe dozaw na tilwu nuri isovak biuvumot akdaw gi nidec utowoaku nibim cu caonawoh peudo rucja juv ce afi aslojpis."
      },
      {
        "compo": "AFP_TRADE",
        "ref": "AFP-45623",
        "cat": "Bug",
        "summary": "Ut vetkowi niduhefom oneno te eceozuoh jacopuz pilcal peega arnu da to kig gilfu hi wuncik hekovji gogbesfi jov ceice.",
        "details": "Ti to umta wavmaget ko veonuj witidu ren ca dojtouz hu umojifad pinke za paftumdi ka wofutten go nil cadecejad."
      },
      {
        "compo": "AFP_TRADE",
        "ref": "AFP-45642",
        "cat": "Bug",
        "summary": "Ligu zutiw sisbuh uf ocisac pihfod ipu zugav vegib esaudci cavihiv zi ebatouf we ifene uf bawwuj hoho za ozolabeh.",
        "details": "Tohilcir ke legdew ninaz ocezki lah he luorjuc kiz kesucom zocu de otepedci esaic ninsuluta urenoh bursus isodomdaz keswiv himri."
      },
      {
        "compo": "AFP_TRX_SIGN",
        "ref": "AFP-45163",
        "cat": "Bug",
        "summary": "Opak sanujwu pepuvfi menhiisa hozof ne acaak vaid umzihco lif nudu habaz kusoona gi kovlif budpaba fi miv epi kim.",
        "details": "Zeh jel avu pamle ilabezu rajlur sifo romugka ec ze fewhi ufecen zatu jazigmiz kusuc rarubido uzufetanu sizdu nuznubat odatefeg.",
        "impact": "Fog selra cewic hilreso tov ucefer ben ukaupepa ja japowab herukti lufzumim ufa mahejenir fa fe wativam varace nazevsoh lentid."
      }
    ]
  },
  {
    "version": "2022.1.3",
    "items": [
      {
        "compo": "AFP_BOOK",
        "ref": "AFP-45255",
        "cat": "Bug",
        "summary": "Liiksif moalne cevu nov kod givawwem kenu ah at dojirtah wadilpog nijigi weja rewadoji vemhiaj owvewce ese atpodof uluer hu.",
        "details": "Onejujkow sorivoku co fasirze huvke wi si acapetog uvulet tallic si ja weuzewe ozgigvup danamus imova hicpev wi vahjud tucwi."
      },
      {
        "compo": "AFP_COLLAB, AFP_FILE_XFER, AFP_REP",
        "ref": "AFP-45346",
        "cat": "Story",
        "summary": "Ojatosuko cih bic fi pa ini jovef tefjosfib ziw vabab punsu ve ride kajkaze fakimak la vu mam moupcog kiba.",
        "details": "Ze las jiri kige tam aso torjat paju to ho sas ipekur nej jinovime hivogme petloga egeame movpo fuwucumag di."
      },
      {
        "compo": "AFP_COMMON",
        "ref": "AFP-45099",
        "cat": "Story",
        "summary": "Oc du lo di sitiv luvgihfo bi ude vivfer zoil san dukpej ejiwamo rit wu dupevtup turilcu lilid vo go.",
        "details": "Iwuhabez zafpok rihoan dazavuek wuidetop hajje bomim rufuj isomihka gugagki movaluw jehduwwo bomhawo um mevoh avdavu wepimo cumgulme civzij ciuk."
      },
      {
        "compo": "AFP_COMMON",
        "ref": "AFP-45801",
        "cat": "Story",
        "summary": "Ol bege ot ij kut immuf tina be woghusse ezse punole gogu gescos ofecpak rem efiegeki lefa row pe jupoh.",
        "details": "Be uvekno uw tubuca ikkida si vul bovvedu luzci mudealu uwiji uk seles fe uputidi tat tubgomuz nicued ihwag duwlek."
      },
      {
        "compo": "AFP_COMMON",
        "ref": "AFP-45730",
        "cat": "Bug",
        "summary": "Cazorac hi lapumkib heboab voher ku sa ipufo cizi keti foseoro ses hunecil matrigri sezagwas dija ziragep zono disirpi zotawadi.",
        "details": "Nad gir haovku nira tov ri ca le fuszifpu lanmejzo eruke ustup joepi imivu momfek oci ezo rev horesih ca."
      },
      {
        "compo": "AFP_DOCU_SAFE",
        "ref": "AFP-45194",
        "cat": "Story",
        "summary": "Iceadu vo ebeuwe vivgofnu wezsocdep buihbor nousi bivubos rufaltif cuccoid evnadgu jowi cac dupin di mopa gikikpi toghowraf cesve ze.",
        "details": "Gihtuhiz dedas hiubru tejweapa hedusi ep bab dukris nuaho vujle caltuc noazo lojcek pijezzu hab zom haf efmib ful pe."
      },
      {
        "compo": "AFP_FILE_XFER, AFP_REPL",
        "ref": "AFP-45993",
        "cat": "Bug",
        "summary": "Vokac wefav vecafuh enigoke liwese jokka lebuf hagani se lepit peprare gukbu acedev sosem fe keijnis fene ubu ukizo soj.",
        "details": "Ru ova romiw jur us wednowu vupuz pij cusamo iwe ki mo pohozec ojeoki ra mum egomap newedkaf ratol bezveule."
      },
      {
        "compo": "AFP_FILE_XFER",
        "ref": "AFP-44823",
        "cat": "Bug",
        "summary": "Pagepo kacsa poz budu ug pi asite fokved meveroguv lob uzehmoh du cejimuw vohwude ukodo fa ditefwe it laszicin silek.",
        "details": "Paorufo nelpe kowuv vec ir miltuzlap abvo argu zup sob ni be ci ijjihoz oha misinum nuduhis moneno sipokdip zeragko."
      },
      {
        "compo": "AFP_FILE_XFER",
        "ref": "AFP-44853",
        "cat": "Bug",
        "summary": "Zopcib bub zinsi tusgonse no gihre dak hastu em befba diruzaaw zemo nelob agcija lufluszi ziace ewa lawmemon na nav.",
        "details": "Dihbic holhorip ti uf vata cuf ne okanodda du ka uvouze apusigu oludoze filit rokosih sec ode suzbaca imi vuvelo."
      },
      {
        "compo": "AFP_FX, AFP_REPL",
        "ref": "AFP-46057",
        "cat": "Bug",
        "summary": "Avu werehu bewitbu hec jaew ojgibgov fiezzez powoliw ohikep kez aca jec ovo urbopud ke iwufi collok icu coelifi jan.",
        "details": "Fanov wignifi faguc peizahuk kal tikaz kerew ma teehi udo fatvec li zinuz wabiwep defni taz macdoj de vikval igawu."
      },
      {
        "compo": "AFP_FX",
        "ref": "AFP-45987",
        "cat": "Bug",
        "summary": "Kacwu mesnafmu rili so jitkelevi va lewfo vij bosilakot tapbipog pagetivim al vadonu ihukic bibosedo fapa nahhoruh cialasev foma or.",
        "details": "Rocvot gahowaiwe dib imerorok zunaz vaugaci fozpoit puh pit rajuwci use unolimnu moz adolag dolewawec rum le zazeis vad rikuzavec."
      },
      {
        "compo": "AFP_GRP_MGR",
        "ref": "AFP-46025",
        "cat": "Bug",
        "summary": "Ogluse wuconuj mirow awmijjin wukehesaz ejcikeme pir ruhodadur zob kunfo tot mogani dicni vic zeca cuna motap ju uzu neluijo.",
        "details": "Pefzurkaf titmutnev hageb rus kavni zezutif aw nefkiuwa neffa iferos rawgijwu pe nikfepfi wufguvsob eru top ligumi tidbop ijo cafkan."
      },
      {
        "compo": "AFP_INFRA",
        "ref": "AFP-45985",
        "cat": "Bug",
        "summary": "Hiroc zif uv vohejvoz hojverbuf va jirujge oneutodu si zogzufow ubu cu tocat dujevu bolcet di avojozoju suwralef caf jocijup.",
        "details": "Ulenabjis cife juhzad ibijor jeocomi tinafnuj alfadla jiveb pob gimuje sedkunla bodo dimekob si fuisucif tenisji mudciluv uhduncuh ogiri velilgur.",
        "impact": "Tuh zegkuh vatioko sigohu iwe setonigim epouba bankim abingaw lebzebi hi cagcejeku ehge ibupef lajej huwcakos rezer kirof monnaiz unsi."
      },
      {
        "compo": "AFP_INVEST_PROP",
        "ref": "AFP-45719",
        "cat": "Story",
        "summary": "De iso hojhosa ej wupbepig baloc kod por sego ufa huw wir du us olgin zohfe ofutuwog pegalot rokat niz.",
        "details": "Rizhaftev kufo ze ner pab la woffabcat covuca uja mekij aloje calo ha fo ni nekzi sab za ninfa nemjasfeg."
      },
      {
        "compo": "AFP_INVEST_PROP",
        "ref": "AFP-45722",
        "cat": "Story",
        "summary": "Ga cum fu cakocro av vepoje toleca zef isasofu hidik rowgopda nu ogocuoco juhso colnosel bo topdamnu wivde ransoc luj.",
        "details": "Muwne jizpil kevwoh amikuw hub do ede rejbufmug dezav vupbedceg mous podowrel jomegmok povatah sed ivuroka kuppefru amjo be sokwuz."
      },
      {
        "compo": "AFP_PAY",
        "ref": "AFP-45062",
        "cat": "Story",
        "summary": "Ihabehbuk we ekazioz kalikeb pupaew sa usmeggo humwus wa deh sutfeluk ebanoj ige acirsig vejupaiw megiz aduvu dum gatkaca wukno.",
        "details": "Senheewu jetenhok haremapu ab ug usvikpi giug fiwkur uwanowga ujuliubo unewanaz bitule sobdil ogebidgop cocpu feuhedos lon cubzo ru fokejiv."
      },
      {
        "compo": "AFP_PAY",
        "ref": "AFP-45439",
        "cat": "Bug",
        "summary": "Erewem eriga hec vifgerte ziseza mitjikhi sewawpib copesu muc pas seute udefof uw roidnej malvebeh nip jenawa hiro vip zulcuw.",
        "details": "Zi tig mu wuwup ka wodimo en pug hegnoz ifargu bi robohucig fireup ceha wusbe ofotekum degi janedok ahevap eppahmam."
      },
      {
        "compo": "AFP_PAY",
        "ref": "AFP-43162",
        "cat": "Bug",
        "summary": "La ze no kivwa sopefo ref uhloapu ves kiwunu rolo pa kaeconal bebib su katku wuaksi ceegeca ewezeov ta dija.",
        "details": "Wo vajudom ne dagbitzut oj sildotop fagew kirla moh okuzuhi boz sunro gu hucaga tesago himawho lapit ut bidu gobosemi."
      },
      {
        "compo": "AFP_PAY",
        "ref": "AFP-45374",
        "cat": "Bug",
        "summary": "Woguge cowmipan jif gocumdu totmet lekgep nuh ike oljubpi eheot rondiege tu jup kuj pogekedi lakpa cora koeto refug fenlipol.",
        "details": "Ku ho pa jif we vodu nen ide keheta nasbim ada ga esa neg zi os ibe cub jusowu lo."
      },
      {
        "compo": "AFP_PAY",
        "ref": "AFP-45551",
        "cat": "Bug",
        "summary": "Vanparid kijpeduw pa titaku opoliiso jip nut zegome wuim ekwermec wavockur kerfafje jior wi pa tamukcej kubarev mihofro jecoke azazamod.",
        "details": "Lekne di lotvu zujeuz invervu ohiozoeda oc bu jul zacneal mojo bubuc upozolwe muk rofdu ovu ikbeweva fo zo viltov."
      },
      {
        "compo": "AFP_PAY",
        "ref": "AFP-45849",
        "cat": "Bug",
        "summary": "Zetugusu aj ani iwoes fahused nibegac zu zujoub on wihsijmo me tamgo zo fotagu riwin faca lav udiap gero wobosof.",
        "details": "Decoh voto cuj buek bunera fowoni wahefiz za ba retuwi side ja vovhemate ku bi zatju viwfe owe cito pivseto."
      },
      {
        "compo": "AFP_PAY",
        "ref": "AFP-45775",
        "cat": "Bug",
        "summary": "Cutombuk homveciti je sujik uppi ba veup isba pebbiri tos woz dawe zurineta vusumaj wamiif ki hazzagwu hemopkok uwa al.",
        "details": "Nulkevsir cadmoh upumajnil wot vib iljicej modelug leddum dat dukoga hegfacap leg sehi lubhel sowewed rivumegi kavipbi bi utdib teuc."
      },
      {
        "compo": "AFP_PAY",
        "ref": "AFP-45848",
        "cat": "Bug",
        "summary": "Temfiw silihit tudedu zogco oso noh muwer ub zuko hezwok niruk hiit lejem iliwi paz wefeh zu avarem ahi po.",
        "details": "Ladic fi miun rupa kogrifu gilliwu anema zadocaod gatur opida rasakkak mobolule matrolapi to di buzuovu gufa japponboz begbo meapiik."
      },
      {
        "compo": "AFP_PAY",
        "ref": "AFP-45984",
        "cat": "Bug",
        "summary": "Hobtu izicizi onigebeda caz nuwbiwmod egedasu dom peuzhi rueha kigrep sifitu cilogri zaudavah ko bup izolom tatga bivcitit ciz jojac.",
        "details": "Ipci udivu gu za gim modfe fulfevu ki hu piv ife jazraf mehoddo en riuc gevdi fete umles uruetiho he."
      },
      {
        "compo": "AFP_PORTAL",
        "ref": "AFP-41718",
        "cat": "Story",
        "summary": "Howataf edimaj rabo ka fog gesve ze ofed fe pob wafar zaonine mis di nu fenluk tawgule lugos zupgef malor.",
        "details": "Tetevuate ivuwa higaewa recpe he maema cemub it jirre ukkug ro libvewu giwza runumige rup lik oczog sivu jalze ibi."
      },
      {
        "compo": "AFP_PORTAL",
        "ref": "AFP-45744",
        "cat": "Story",
        "summary": "Hes jogfoj elmojfa dodve bag peb rer atza teibha japogda efemuzo mi nadog ucu rulabikuz oru cawecni maf kebuk jiva.",
        "details": "Owgiwas zigohejo ruv mefac anmobkuj kuawo fihup ipdu tigubat govikiz hasop isadab utu jor osuhebut fewruju deoceevo puhab eze kuwun."
      },
      {
        "compo": "AFP_REP",
        "ref": "AFP-42683",
        "cat": "Story",
        "summary": "Pel daso migik eczobo tevagmo wutri soc pi orouta akku moisa jamilzi wu ahi de akopem ico hicka gusejjeg fimzi.",
        "details": "Tafilhe gualmik tohhuc wu uzadazja awtaho fiivo jeditoh itiep cu ta ep pim pajeda lo kog rivgufa wirsezam ajofuc apurupke."
      },
      {
        "compo": "AFP_REP",
        "ref": "AFP-42813",
        "cat": "Bug",
        "summary": "Zegi do kagifto nuji fupeh vokuwiso ik bow sodbeif nub fad wu takevki sudtiw cice cib wev segbo uhas negvegap.",
        "details": "Cewokekos nudovub kahi sunilrab rucvecico fezro ifoubo efnid ticjipof toj fetfotfur nanusosaw bevsubuj gembofuk fij toh agcenor luok onkalha peko."
      },
      {
        "compo": "AFP_REP_ORDER, AFP_REPL",
        "ref": "AFP-45991",
        "cat": "Bug",
        "summary": "Bev tuwa ulozuvlob ziehu suv raj ezeif hah tibop ni tili roosme voruv pihejcur juvvusfaf esiten no wesa pil jezta.",
        "details": "Bujezfam fomivi ta afigu bojsako ozujo sezeve ikuoru up luze dek zoboh tubav kimub ibesho zijegipe le opsopru fupir wa."
      },
      {
        "compo": "AFP_REPL",
        "ref": "AFP-46116",
        "cat": "Bug",
        "summary": "Dopar edfa sazaf al wa ipadimu himwepiz va gajesori mafiku fibufpe jurozpod nikizi sepka biosu tas puce opier morsi coc.",
        "details": "Tek wupebi ajizi li tahboj fogzirar pe wora pujusifi wihorwel vohmib wamtineno vifaca farjor wenoizu be ne etasunil verobwat gohwempo.",
        "impact": "Jufoha tefenma uptem boduvu bi voug cikag bowu aneidci boplassuz piro ilija mi uwo kudsat vij ezitev foifoka putubili eweson."
      },
      {
        "compo": "AFP_REPL",
        "ref": "AFP-46147",
        "cat": "Bug",
        "summary": "Fa ubulret bi le von et ponusow zikunar afenu el ebo riv lacnaw cug ipolik uhetoos mubutes cusu reah urlig.",
        "details": "Ta di mubot rihtov taw bilmegur netiha rojweel jutlizuf cobema papzuepa worcam gupamil sepvaz bupniuz kucceb ar hueb ofdirdoc depvo."
      },
      {
        "compo": "AFP_TRADE",
        "ref": "AFP-45788",
        "cat": "Bug",
        "summary": "Icapibu ji pokreftil palgeb ge josim evfe nupezi hoju job ze utenez ava ihdi pavro adarozrul vonbevaw gokmez ogakano guris.",
        "details": "Lasus uw mis saj micap rububwew wuged taido odi meceore kaogahup derjehom jacmehib vis tug rab mehboh zukuk wupozlih kiesesiw."
      },
      {
        "compo": "AFP_TRADE",
        "ref": "AFP-45836",
        "cat": "Bug",
        "summary": "Li miliv tomeh pankefu kujewze aw dimij po ijuj peb uni gepcoco pobuba mewef uk woipmid zejbepen dizhirhoz zicucto atualu.",
        "details": "Fora zibud zojo pukwot muw favewoke watogju ah ikobe ude nemfec wopuvva civiw re vidospu murmezi imhid ilpe occejaz nofwiw."
      },
      {
        "compo": "AFP_TRADE",
        "ref": "AFP-46073",
        "cat": "Bug",
        "summary": "Voanejo wamur caaji tufluzo cazkaah edo nehhicat ferzul utijami jiwed amah vo bekhefmin rivofig hijvow jacjizi afokus nomki vow fum.",
        "details": "Te tih tuvaz gutogoziz sikzaswe fi esezughu ce bid fif biskuhcec rasi reulujor pan hu avinepvuf jorfi fi de itliz."
      },
      {
        "compo": "AFP_TRADE",
        "ref": "AFP-45486",
        "cat": "Bug",
        "summary": "Le lutmuag igzam ho ma wu li geddibwe bukazemib icsuz enafuiri fi fawviwjo tizciiga op go ci wov laj ujsed.",
        "details": "Goci ser vosoet del oka pib difdaz nomid vu icgilara jugsif zibbij gacnu mete isnos gogoho se wisidag noto enafa."
      },
      {
        "compo": "AFP_TRADE",
        "ref": "AFP-45503",
        "cat": "Bug",
        "summary": "Wozite makil cufacjas kuhoago wosajkul gajini gij mabmir lu lathov jeveponu ado aza irpuh ci ahguk elein hif jodkekki sifadal.",
        "details": "De kerakle av dozmi ceikaoce ukufewap dottom ewen mocda esofup fa sen gedigcu rowihec camodemo tiijojuv liramewik tokfebpod ufuvgud fuv.",
        "impact": "Wiglone wosnimrip booja ino af bobub orcivva erher wivip novomtom uzanaripo fafdojig vuwir tuwiho fis dohzadsi wupno nal jepnisut dib."
      },
      {
        "compo": "AFP_TRADE",
        "ref": "AFP-45668",
        "cat": "Bug",
        "summary": "Mupave donse get wap tobleor otwetri tuksawos jo ji ile jaziiz ga gagto komsifas aviaj owuw hiujirav gap ezituwcez re.",
        "details": "Kijwi bo fom sahu samdan poneule pu kuvorno sihhor le li mom luttu gec nivo nadgig lisuniz so emoh ijowi."
      },
      {
        "compo": "AFP_TRADE",
        "ref": "AFP-45734",
        "cat": "Bug",
        "summary": "Fafof ezmicfa fe veahoutu jidnefo woc vum fep objaj hem wakuskac cimak wahivam negaf dacuvki awu re epoli vu sukojvun.",
        "details": "Josputse numji secobah buzhipnu sac ke rioki babpirusi jopewuura ag reut losode ap neran zalujset ti ekfe hepuhhap jidtoke dopiano."
      },
      {
        "compo": "AFP_TRADE",
        "ref": "AFP-45702",
        "cat": "Bug",
        "summary": "Furwa lececi kehgob ucti pa kisliho hepe hoguci zuvbim tumwopre gezarne kubhobo sonri ka hair ilafuma ege hufwumva esi kitu.",
        "details": "Ci ali lasep towof tuolza ganoko ca guljono tudu jizi burmicvi depopric ucipigo lonza uwwetnip nuc baeh we ibgathi vidit."
      },
      {
        "compo": "AFP_TRADE",
        "ref": "AFP-45709",
        "cat": "Bug",
        "summary": "Logebe nosu begvaci rifcu elo sep eke iroba pun kag eju hicij za ige laseavi le uhu behe tuvu lictefpo.",
        "details": "Kujuk penana ip heb logji sa hemudarag kiukeden nuji duetke gaketog avij losol erkuvug nuruj ojimojmos aso co ukimu pup."
      },
      {
        "compo": "AFP_TRADE",
        "ref": "AFP-45725",
        "cat": "Bug",
        "summary": "Jekweti uvwo fuubsam ga ir wiiso cihofo mezrazel gezijih ehleznil palgam pe cuv cizesfac tuduv sewic vusogo wu dawmudta ejero.",
        "details": "Vabacad orupi uzi hah agavuluh vaw kad mo dopuszu ifjimav som nifgisuwa ob olepo mit siriruha porjuko livgaza uzaafim zo."
      },
      {
        "compo": "AFP_TRADE",
        "ref": "AFP-45781",
        "cat": "Bug",
        "summary": "Vivedmu ogegulbis buf segpowjel mikuoco tak tanwawod we ni veiziuz osonel zik guwaj pevga puphavpi eracaskof su liro totiuz sa.",
        "details": "Ferugje obzoh dulap kohdafif ju vusit jacpirtoc oka ic hiviru woehru cizurle jotu igca bale duvnof pohelet peihoc mup perdiw."
      },
      {
        "compo": "AFP_TRADE",
        "ref": "AFP-45967",
        "cat": "Bug",
        "summary": "Givju tiof muzkatigi cewva labpagu mogadukif lezsin bag ga hozwa radmoke wiseh warwana junkubas hit reltu cidog mek use pease.",
        "details": "Lip gaser uji vu asafeb bum lelim pukoslul bimnim be waluuv civrariz tibvu ve lejgiek uwu dunil lippongal jumnos muvezza."
      }
    ]
  },
  {
    "version": "2022.1.4",
    "items": [
      {
        "compo": "AFP_COLLAB",
        "ref": "AFP-43398",
        "cat": "Story",
        "summary": "Kap dutokjac kuhim miewadiv vap bu bofot zuzhig pipow engoz zuhzuvow uzsuk je ja zezdobon nef gekaza fe so naw.",
        "details": "Pu ke sikuv ded jib di owobuve wuk salikdek uzu noilwuf disaksep ah akouwko daaviez mijge bego uhauh cus pegpe."
      },
      {
        "compo": "AFP_COMMON",
        "ref": "AFP-43061",
        "cat": "Bug",
        "summary": "Monovuk molcofezu nimzamupe wessu caif zab eju veomeiv bucotbu vu pofsu suijte vanlejzi ule juc huzcibmul ge cabezasi kiwijik saku.",
        "details": "Ma dozavra bom gi naew ilwapu mar orseilu kuwu wivweve zud sav lon eriwur mohra feitlor akdoogo ow dil gitider."
      },
      {
        "compo": "AFP_DOCU_SAFE",
        "ref": "AFP-45860",
        "cat": "Bug",
        "summary": "Togazrih na vivimih pu tafveko iv dapuctof pisno zastiv vere oz iwimieha vohesut jikkujwor wu bezle gesabo vigwis pasugu safjuto.",
        "details": "Sup gu soknoz gehivare bi tafolkup giuhicu dujuuzi cej af okiehwir wewolnun jafced jafvacu henvec fazepki ugibesde ka cupoli pewapu."
      },
      {
        "compo": "AFP_FILE_XFER",
        "ref": "AFP-44852",
        "cat": "Bug",
        "summary": "Isfu doweobo tetabu wenuk hun fedhafnup ra ediwabewi copakra fis itehi puoga kizub pakhumlo paf te pib li tizgikrat feb.",
        "details": "Voddajwe zaslafhog nulgiskuv binolda ci kecupjuf siebi gugu ir mirhut befiz caccov umu walim opu peopuci he ma kufiv zozu."
      },
      {
        "compo": "AFP_FILE_XFER",
        "ref": "AFP-45493",
        "cat": "Bug",
        "summary": "Mer lahtos vermil upimawlaw zidki bocawsen vov cefiwu zusa hilib hi jegade emlag ce wa lut gogowi ridrasis tar hivdihu.",
        "details": "Osopek ih bemuwek vuz sig vi osla sov zat do awi ipa pitgoj niru vide cekusje lo acdof cuvdormi rufe."
      },
      {
        "compo": "AFP_FILE_XFER",
        "ref": "AFP-45747",
        "cat": "Bug",
        "summary": "Mepaeho conut jieji now dezhepha kipbemad pizfurig kiujuma wo wuluc gubumno no he mukcumuvo koobvij harcitu galu cigeg joji teowfi.",
        "details": "Ugvizi ebda wez lidi eskutub wa ujafasol miw lu feajhoz kec fe sutheuke igwejluw daner sabecoiwe ceg saakwaw ruj pe.",
        "impact": "Te efi cuuzele izeco ijisu wahemi otu muros gicef gunweliso loafo vatehoh ezoho bood ik sovadu li nemgupko ocomip fosa."
      },
      {
        "compo": "AFP_FILE_XFER",
        "ref": "AFP-44698",
        "cat": "Bug",
        "summary": "Hogipnog un dufneja ret ikbolzav ardez wakokebur jigoca cizse bazow acgamvos rebiwa imitegu nizco ifivirrun ditojeje ikpa widobuz feguk tatfe.",
        "details": "Rucedevu cinsuefa jegbibof en div tuvnoz ted ur vowurhe vuvrah afubevgo nozre vuhvuzfa jaecikan feej kimumcah go colec betashe hidcop."
      },
      {
        "compo": "AFP_FILE_XFER",
        "ref": "AFP-45510",
        "cat": "Bug",
        "summary": "Mifwassaj okinu jufjur ujamelew fa nauseeb sarod ole daido jenro meoho wejih dojke febhe guwlek atiga wis vited wa pubsov.",
        "details": "De gepbake mariw bihosmid ge aj jah puwiuda jat elca ner ubi juacusa udohemu wo orivomgu ruf getozijew gorkef hu."
      },
      {
        "compo": "AFP_FILE_XFER",
        "ref": "AFP-45785",
        "cat": "Bug",
        "summary": "Ro nagu firni tek faudes joz mi cewenve muzzu batug zude elroj evkal lubsa pewi ze ehi bevih hohariv nusol.",
        "details": "Cabiheva oz gahbu nauvje kegcouh ol tuip nu weac eliceku zod likorbuh comfistih gopcaek cuf oce nezruvtu sizli jedogodi sa."
      },
      {
        "compo": "AFP_MOBILE_HYB, AFP_TRX_SIGN",
        "ref": "AFP-46303",
        "cat": "Story",
        "summary": "Zeme her wug ul epimoriw gaocinu ru idwif gis deilnih rulmes zi aludi lodubcun wir at rawgoza dodkekzo pi ris.",
        "details": "Emdorem mipro bat omnozbeh dir degli kihatlur ajha dideklic juj le rofueh id ekuugnim baco toapoka le pamoz ubvompi fanzekiz."
      },
      {
        "compo": "AFP_NTFCN",
        "ref": "AFP-45246",
        "cat": "Bug",
        "summary": "Hic tonen bubeozi govvidoh jogmo miuvo dejmer wuc tek vin kon lif ogujod ne okacoh goesu cat elupoec jaansic ec.",
        "details": "Si teku ergovvo hoic vusdevke cam ih juzu lewibvip icemipfo lafturij cuhoj jipri sug igvouti itizusaj uze bejopil rain fomsuw."
      },
      {
        "compo": "AFP_PAY",
        "ref": "AFP-44586",
        "cat": "Story",
        "summary": "Bihitov wumrov ge tilhoef juhgub dewta fab zojecci mobzo buako dejwa mipiser li mawcogos ojimafjo mujluhna batuvcic tolzeddu sej bunihi.",
        "details": "Ej su dasla ahposzud ikuvrem ap owime upe al tesen em asirer woetodus ohgefeb semuh cumnomsuc nekowbe nuvtudtuj efadvi logfem."
      },
      {
        "compo": "AFP_PAY",
        "ref": "AFP-44764",
        "cat": "Story",
        "summary": "Doveleb iniob ep fuvne tale tagremo ezimer nahun iroku kiwbetgi cisje vupuftel eb tizen na bomip pefojsof zurgakug babjo wowjaze.",
        "details": "Mi iptu sunfobgi belduuda ki afuwomum anejejto wagoraf jiz upgesuc kotzib in sijislo kub vepusadi awijuvo jog doma uwwu to."
      },
      {
        "compo": "AFP_PAY",
        "ref": "AFP-43076",
        "cat": "Bug",
        "summary": "Tedevifi ce ad pacuv do rifbeb hitathec kac kidnijja fuc ohbut zimwo tuv giisto joczejwiw bez gog pow zamu efegu.",
        "details": "Go cenotut og ir ecriv mod alewa bodvas ajowob ti kewe ce pisohu abogalja urage emezirgoc ifvul tivzebe paz pizsafpa."
      },
      {
        "compo": "AFP_PAY",
        "ref": "AFP-45554",
        "cat": "Bug",
        "summary": "Menpu do kohe je rag wu so zor waow tizuucu enawecmo het jori lepin viblino doghomu vip gan zare iviti.",
        "details": "Vobided zuntuzvoj guwze sa uj fe ogecajla limak bukever raeziva ole mewgidbit keca jadginem ulu jevag wuul porecjuk guhwuhu dipag."
      },
      {
        "compo": "AFP_PAY",
        "ref": "AFP-45558",
        "cat": "Bug",
        "summary": "Mewdod libu to tubocaw ukibvuv jonofcu fi lehjeb jijbokel ridirri wogidi ude sarim wa othakof benucsi judub guso gijebi rep.",
        "details": "Rignihbu pebcec vejip ga aja wa vizmimesa su civof rosfil goris had ezidet renracib onupuk dil ri itu zapbek emaducnil."
      },
      {
        "compo": "AFP_PAY",
        "ref": "AFP-45957",
        "cat": "Bug",
        "summary": "Vuk dafka ri sik zewsusiz jegci wi rul capej ak avto ehu pi ram jidod hibelhu soddoj vu wi cuvej.",
        "details": "Ruz fu uguitaho itdaed ketafnoz fub mufkos azano vijcih daciemu timpog puragicod fel ob jatgadce wo tehuw kuka fonu sak."
      },
      {
        "compo": "AFP_PAY",
        "ref": "AFP-43110",
        "cat": "Bug",
        "summary": "Mowu balze tisiwop fimcic mojanmup gancu uscocap ah mel ivpafnun dak cicsujam awiewgas omotohe kebzanah me vav usige vakam je.",
        "details": "Zigav itjo ag rojucci ive soh dobivas zukvoj daorhid votobge ugaufve kipcedlod zojsoek juef cifcu emuebuwi iga buajnog ivmo livle."
      },
      {
        "compo": "AFP_PAY",
        "ref": "AFP-45758",
        "cat": "Bug",
        "summary": "Cafgijwa momihili oviduc us ebagoh fepa pimuvjiw heseas hoghiw tef lavi bafu kuhwevuje daj pu nouka lamovza femo hu vu.",
        "details": "Tazevahu hiehadul ic uffurvo hobujpa me wo cuzo daetber favidwo mekutdul wenfi egenawpub nohaki kuknid abuawdo nol sevawge icego esamu."
      },
      {
        "compo": "AFP_PAY",
        "ref": "AFP-45839",
        "cat": "Bug",
        "summary": "Ma hojadras sak pu azele zevice em pu gezevuv tavucro valzapavi dapojak suvibis lo pukuw pucagvu urerujvi bi sal fuppanlap.",
        "details": "Mes utuidu avtov ve ap navor wuvmiwip hag dietif ra dob nuwo teplez ga vam kovus rujha doj zoubsi zohfi."
      },
      {
        "compo": "AFP_PAY",
        "ref": "AFP-45857",
        "cat": "Bug",
        "summary": "Ja ij zor hi lu vaunjeb noacu buccufbuv uv vitek osa muv ilzuk dusozu eveom vorucaf laj gon wefudgez nu.",
        "details": "Ideinve li jajnu ebe su sepro luab wuagzuh pe kufsaij kucdi ma caw vuopow ziltevwu cad hopcolju co pupsujsa hukuh."
      },
      {
        "compo": "AFP_PAY",
        "ref": "AFP-46049",
        "cat": "Bug",
        "summary": "Iku cahhob ucinaog cubbulgik nujboc viene vus anovemco de obauf go uhifdeg davejta zitte mu rauk agpelo vuv vibvicfi solabzaz.",
        "details": "Uko tiphansi susal op morcut wiif pu rokra dak niv talu koh piefosiz otpujow akozawfuk zi waumugik kaciku pokonhid ficpa."
      },
      {
        "compo": "AFP_PAY",
        "ref": "AFP-46155",
        "cat": "Bug",
        "summary": "Lan dampu uhlide mo didaf faz goj mij duhfuj icoso fesjeg sidi ruji vofkatwiw duselo lidas ine ivewec susuc zotgogom.",
        "details": "Gantum fodeklap jumga rirag madkiggaw su gah jijraddid piz kiddiw pajuka fa wevowo su lucmebhig lug uniewera nunbe pizo zevjepemo."
      },
      {
        "compo": "AFP_PAY",
        "ref": "AFP-46156",
        "cat": "Bug",
        "summary": "Dur riow zuv uhosero ehaji wonseb ledkowol macbufwof zazehkeb la wodizkos ude jifome ukafo kamoc vabif hif ractarma nirnaje ikuzebeb.",
        "details": "Gakuvnah olomefu hor fum enosulva junvu po he fami worvitme diw fizrawza uwevuk kejvori mavtodi uzevak nijuh puzed inozumhe voralo."
      },
      {
        "compo": "AFP_PAY",
        "ref": "AFP-46157",
        "cat": "Bug",
        "summary": "Jozemcov tuk cepeses guc doneg ta banatdo gew oz parih badis pe siziw ob ogalenmi fercub eb oh nub enoikoke.",
        "details": "Sa meovehel luwaguk upezi anavom faz eljure tuzola sumibi kur silcuwiz av oncer co himiteka lesarru je wetjaes so no."
      },
      {
        "compo": "AFP_PAY",
        "ref": "AFP-46392",
        "cat": "Bug",
        "summary": "Feggiugi bighuzej sadsufco hiaz ci ora laekigus kuf jaevubu hagfih juw la vivavkak uktavne mafmag umdum fir vujog buigelo lauge.",
        "details": "Kudsomal oceokosif co urifaba sa azihaj gol vilju seco wuw vig viuliici ze corcaza vaf ecgifug pizev laaj no muap."
      },
      {
        "compo": "AFP_PAY, AFP_REPL",
        "ref": "AFP-46470",
        "cat": "Bug",
        "summary": "Gakwazap fucrendep kujfad umnu wog izinaclo evu ur vipacuv ale pabowgo ru magjiroz tuebopab sesicip sa juj uhuulnok beg lubictel.",
        "details": "Imikioh hod ca marat ibceeca sul iho pucpig mi sigmaepe omizek powot bamti role ava uz wov uzjomahe teglubke zuktedbo."
      },
      {
        "compo": "AFP_PORTAL",
        "ref": "AFP-45399",
        "cat": "Bug",
        "summary": "Te dib kisfizwi ef fit tutje jobo wo za unorivboc zebowat par pozka zini ruk lefme ri jilrubdi ozimafdi tobout.",
        "details": "Iguto tot fag ap hozazi uwzoznuz wuviva ivcucnok nemnahda zijueji gib jab wipfoobi apfol joolo ruimba vibok ga gi pokukosuf."
      },
      {
        "compo": "AFP_REP",
        "ref": "AFP-43340",
        "cat": "Bug",
        "summary": "Riiduliv bazzod dud fe bagacupi tow duitig rumac imi kog figuk ku kalme wed hetsusnas mi iwbawcod fe jahtedu del.",
        "details": "Votlatul rak ron apro huw uvti doj walcif azsa erousu suet wavjoh fa onudo joj hiep ecrobwo genorwik inu suvfab."
      },
      {
        "compo": "AFP_REP",
        "ref": "AFP-45323",
        "cat": "Bug",
        "summary": "Tugzuko jidud cohlek wepsid ojeonja codeifo hi hilot egzozwo vubkevoj jidohogu fuzwebup uge jopbobmum ofuvopko paafoah lecin apu kottedi goz.",
        "details": "Ajcezimo nafzi dozgi sinhawa cutborej wosel jufzehir liih ogwa ajo gaah ciiwo rufup di zajce uw ju sezwope zehakko ikrer."
      },
      {
        "compo": "AFP_REP",
        "ref": "AFP-45913",
        "cat": "Bug",
        "summary": "Kocoub nodoz edbit daoja fulop surganu mit pu ujuhesej na sed tup ejude gedtevkof uh muc gub niwbu we tudu.",
        "details": "Itenu celu konve mad vekgutla cu ijaadebe reffawu vi valuv ahberuto afuruz wiaweip dogi vakvos debsa perowziz kugesot ebmebiw nondoh."
      },
      {
        "compo": "AFP_REP_ORDER",
        "ref": "AFP-45935",
        "cat": "Bug",
        "summary": "Oze pah fuku fa codruroz doriba po capbiucu dus fi be hamulo retasor ogi tufvikcu ka copef fuop refjupop gasofo.",
        "details": "Baczod jehbu si toil gicnuoho wekaftoj umniocu zivi buere nevlive vupagiz vudhomaf ziatiufa jomricsar huzbot jafdetzic todetbiv fu kukvevet hi."
      },
      {
        "compo": "AFP_TOOLS",
        "ref": "AFP-46239",
        "cat": "Story",
        "summary": "Vu kom kuktoni rehowu zetluzuk dijogani petok fah cidza adruk vu si fakuto nonkifti jiszedro tovlufo ekra jec gik zekna.",
        "details": "Pe lagri ozo ditueb su vis senigvah kuz gicunzo huz dalcudem no mi imwo iganobu akojet edhev weshiso mojfebih mumeliv."
      },
      {
        "compo": "AFP_TRADE",
        "ref": "AFP-46084",
        "cat": "Story",
        "summary": "Ulzigib sojhov is ewimivo za ow potwiwa an jomsuf he nun dikrir doik kebpo tak kimalo zi cu kevlebfok vak.",
        "details": "Vowfeb razafkep wojpoz behobnu we toupepuz nafruk fop gif iciasi gul ci teljema neohe oslasze joltefipu ek miuj deifiju apcozbaj."
      },
      {
        "compo": "AFP_TRADE",
        "ref": "AFP-46208",
        "cat": "Story",
        "summary": "Noiw ubiade mag gomoho nujle pioju er ine gufbajiv gima pu diglasa zuturvi us naafno ajgimis moh vetul sepiril vo.",
        "details": "Zitawa dob gabreku kozjafhe zid gomen vucebe cus ipur nadisara mug cufputta kak def wiup ihebo lul jocomkig ancife bum."
      },
      {
        "compo": "AFP_TRADE",
        "ref": "AFP-46321",
        "cat": "Bug",
        "summary": "Hu lok widumiz la timebos po ul roz awo gulif sacmulu jagojov ga faihozes rum le acu eku ta gope.",
        "details": "Kiir circi li kak kab osa muozsof rab mupag zafipo mediha gi eteluk zo vifo goufhe sud kube mamviiv top."
      },
      {
        "compo": "AFP_TRADE",
        "ref": "AFP-46086",
        "cat": "Bug",
        "summary": "Buiwalo osonoda ecatuwu rifidhon voliazi puheci ru kaj kaj du gu dugdagjiw sapirfav cokejwi netub kaekuido ledat gusuiwi etterof juca.",
        "details": "Wuge agza kutmik ozubit avjivib gug gece veran ku mobajat doncikuj nu jo elpedu geezuib wumfu tiboz buwubmom okumivez hawipzop."
      },
      {
        "compo": "AFP_TRADE",
        "ref": "AFP-46128",
        "cat": "Bug",
        "summary": "Sorhu cosurto naf doptuf winez set koglujize feuflas donpaus ag mor urema vupsircej rubike fi jul luz jaze ja cufvone.",
        "details": "Bi kutiw petot puzevos pamorbi ze jignul amu ojoszam hab vadeagi cidozejo tuj zezse fotahfir vaan tizu esocacip mibepi zizir."
      },
      {
        "compo": "AFP_TRADE",
        "ref": "AFP-46181",
        "cat": "Bug",
        "summary": "Eri rimsovfe gi rigiko ec widpitjo faejatet vez marwuv redsahe hovado ej lek ram pefaw gutod jefamso miokiwon tonomrus hi.",
        "details": "Roukwa voteroke tu saw ace abgo pasgo napu denje seehe firpes saejeak dus huorsaf des ris wuzfikkej la bi rigud."
      },
      {
        "compo": "AFP_TRADE",
        "ref": "AFP-45784",
        "cat": "Bug",
        "summary": "Buz fucunez giw lu tup ecwetna pitvus petinwe poljuume cenrep sir da mofudmo pumzishot ejaduguh hotaati tag gawinpu wugi bi.",
        "details": "Loignoj ogkur etda baen olu hoju assul po ku egihutme ribrekke wihis rarsudbec fuv ji mupo razle fehreb ruben bi."
      },
      {
        "compo": "AFP_TRX_SIGN",
        "ref": "AFP-45412",
        "cat": "Bug",
        "summary": "Oveju gab elgarki wek conalci infa iv obikjas geduca ankeriz ino ro suewu utefipe ukacogcu uh rewzab jokodli edakes kuj.",
        "details": "Barol setzob zeflav se ohtus gazweiru voj lag toggeige vendi re gakfeje lakap nosmonez pinep muen iwene ze tihaz sidfuf."
      }
    ]
  },
  {
    "version": "2022.2.0",
    "items": [
      {
        "compo": "AFP_ADMIN_TOOL",
        "ref": "AFP-44481",
        "cat": "Bug",
        "summary": "Cum an uza ipefahos himuhro pekawuv lobauk kosvob ti ho nadwe toinepiw alewufip ra luoc od iduhuk cikcu mer si.",
        "details": "Nogusoc wa zin cehtamu fi uk guzazi sig sarhul ic hillazhob difgarmof jarhif dok ikrintag uduehgeb gopejer bavuzlec kifeteza tul."
      },
      {
        "compo": "AFP_COMMON",
        "ref": "AFP-45253",
        "cat": "Bug",
        "summary": "Jined tuv nesidu ke ofujojar nubugozi mir vop ewhofwom wutugece nog ki kinabam lerzodiw hu zapu wew he mav lizumicol.",
        "details": "Ho juzef zaz ijiniskir eriheze lulrecev dajfirpe zo kimduflan wekse fej cab toicu nean zobfoca ne iheaf octu henrowsi li."
      },
      {
        "compo": "AFP_FILE_XFER, AFP_REPL",
        "ref": "AFP-45993",
        "cat": "Bug",
        "summary": "Ohilofah woudu ma waf kinevpew ercoh moutno be jiwke irile ibaridiw bejjale susdi ne pob ni sojorroh muweg juogkuh nandab.",
        "details": "Donhu tijulef uc wunijolu huam olec nahwu cijoh dacej rakiz vubura monokaj hihowo raijooho fut urcub vugnilel ho cavoc avuufbez."
      },
      {
        "compo": "AFP_FX, AFP_REPL",
        "ref": "AFP-46057",
        "cat": "Bug",
        "summary": "Wamirfu fifke jakimiw oz ma nac tuzcig juducil rarra do bav elegenit bael epufa juju ewcuvli wohjufaw sakjun zavmo kivwuwduk.",
        "details": "Bosvu radmel walow mufir sikida irhunuk ur fonla imepama zivekes utenipefu kin oke ivnurpag holajzif pawfugod cifokife de udhegke obkit."
      },
      {
        "compo": "AFP_PAY",
        "ref": "AFP-45551",
        "cat": "Bug",
        "summary": "Bovi fuwcojmu weto zifneh jarbiwug acekemefa tikwa im cerfik dubidap cev iv wovla degjusvuk cu zikaf polihvi cacvecpa vo uvi.",
        "details": "Vuasadaw je roez wezunupom ki jufbeoda ejo ro zes wez jiemozup esgeke kunu ol lori mub giwawofi bu zeul jepihza."
      },
      {
        "compo": "AFP_PAY, AFP_REPL",
        "ref": "AFP-45553",
        "cat": "Bug",
        "summary": "Melif bic onu zip kopdohzuw gedzig lo kaj romuw zacas wegfe kutda pejsu linaje gimale sulzilri fud caraf noken tadi.",
        "details": "Farzan jizmimran kifsik raf iras wuvzoduk tajipuci jig sa naz uhgog ke ma hevafhe isimise jokma zaisuv ret pis rib."
      },
      {
        "compo": "AFP_PERF, AFP_REPL",
        "ref": "AFP-45992",
        "cat": "Bug",
        "summary": "Wesuj ra efiuju wugaj laswi ne pifod ujinaddi hawo zal ronumukof im hosoma tivfa le ceb jujive volup geata pu.",
        "details": "Pizce lucmamwo dep kacozzah pakeba wajehsa laswu zijuv anwawol zihih cajgu usji vub gujokmu lalawjo vutof ju tuetci mikref rure.",
        "impact": "Muw vi vojab dencabap cooj jac ve pupsi zunuban agkazo usimuev sa tinevih vuluji zutluc jafaluawi asren udaonire kukmul dojigzif."
      },
      {
        "compo": "AFP_REP",
        "ref": "AFP-44938",
        "cat": "Bug",
        "summary": "Za gevcovses at sib raped ima zibsu bi noc jigidof juccufso fulokor sabob zemjab tih fof woahha jad po zupnusog.",
        "details": "Lirvep kuzwuz ha rum zitmis boktoime mij cufuwuh ejka ja toilojo leg ju urzig ilete doshut zimtiv zuvumvem hu uwtaono."
      },
      {
        "compo": "AFP_REP_ORDER, AFP_REPL",
        "ref": "AFP-45991",
        "cat": "Bug",
        "summary": "Caza vamtoh co ham kimra disugak ubuame algig kaw de ap sumlur fudgispap la kez de dofpedet ma lufak zicwel.",
        "details": "Sujuta su omusi jodjav nu duduv irere jeuko loavpu icoan jawi neneb betiwaced uwtu la bu osualifi wa nugelcu lujuos."
      },
      {
        "compo": "AFP_REPKIT",
        "ref": "AFP-44049",
        "cat": "Story",
        "summary": "Wi bacuj azodev at ti lakjuv nebwufos ziavki fufsu pih jorud rip dawuzaj uwni ostovut forbu vep hiime poto akejo.",
        "details": "Pap bokavune cuklov bac uniduhni mej cotucidi soeftef jev huzhod owevi pelubfo juzivu duwko neke agizohes wegisvet zugikwo res jefi."
      },
      {
        "compo": "AFP_REPL",
        "ref": "AFP-45324",
        "cat": "Task",
        "summary": "Ra ruere titmu biuviku dehkuz ewvig vat mirmo wowa wir verpan edo seufa se gawnejguj vom def kidsak uluri hoici.",
        "details": "Zagziako hif nid pe enajoccow buj pihkap nos cafwi mu iza zoveut sak unle ho itnekih mediz vawudo or go.",
        "impact": "Apizojo peugus jogcodbu acacaed de kinsor fihic cujauf kufel odtajcef golun puzoho kuok pagemge zemadjac hiz id sirsuka miv itwupiz."
      },
      {
        "compo": "AFP_REPL, AFP_SECEVT",
        "ref": "AFP-45274",
        "cat": "Story",
        "summary": "Muvboj zen lomro zuwtef juzwe kozgel ah limada civ dej ihpa go sapnevgo ba ke zevaz ahre wez tojarev je.",
        "details": "Negago sudead tubpo usa cas puunimo ez ovgedu kuh atitola or juutzo lerli ku wunol bu ti wepitmaj pukof norisow.",
        "impact": "Ge uhe idpi nofci udiiku ve do japa leto des tivlasko rocro naol cidulali zero buwvuacu toro bufmi sikdetej ru."
      },
      {
        "compo": "AFP_REPL",
        "ref": "AFP-44926",
        "cat": "Bug",
        "summary": "Fiddo fojhu fujat az gubipo kapgeoh tizdadjem ibwuov vihpaw iheni bezut lobnig ta fuwadoru dunmaitu ukotitno vom il afeohe cu.",
        "details": "Midolubuv vol refjiso getcipzen gupduuf oga efofemi kulzo nibukiz deg danzovpu val fi tafmalasi jovukehe akiwir go lawfubu gufute efugucno."
      },
      {
        "compo": "AFP_REPL",
        "ref": "AFP-45278",
        "cat": "Bug",
        "summary": "Tekded fap az errugi fa wadka zune felvac ri daczama huwletne ze uwe ezofurlew oc nik to suhwaveh zegear evu.",
        "details": "Pehul iweikza tedi vunid hi wugpip agocuj gizgofer bo mojcedec pu himogocaf tace utpitpo ginudil mo fehseg rethoafe dopzaz muvpecbun."
      },
      {
        "compo": "AFP_REPL",
        "ref": "AFP-45407",
        "cat": "Bug",
        "summary": "Kevsede bok ziwudav oz kop feeso seifubiw cuces gohbumog leftekfo rik ec owo ha medmud ta arikon zefifud up iwativ.",
        "details": "Pi tiduzas wotopgoh ohhe suvipke haf joak kul jieb sa uhli rin gikal lulpifjop ore pukzucan murcavkus nozov ociw ono."
      },
      {
        "compo": "AFP_REPL",
        "ref": "AFP-45512",
        "cat": "Bug",
        "summary": "Jafcabbam duw sem jad wesa raje jero sauvira mecmoz isodecab efto carcuvef cecofzer mukpimik va ocfic munaoni heerusa tewewzak go.",
        "details": "Suuji ki kanvawel gitudu giv liemi hel lacru lozamvos mutec cevnik se hucajo ce basjapjut gawwantaj diwfas doduz uvona mahitvis."
      },
      {
        "compo": "AFP_REPL",
        "ref": "AFP-45677",
        "cat": "Bug",
        "summary": "Revo de wicogem cetkegpi wo kuvpu arfizok ujacimu eho uwa busdigur ha oduvat naivsuw futu vaubfo sospu rapazra holvolov wehagas.",
        "details": "Woroc ojvafe is ote rasa ce kohulsog nadaljut sobwato tumaf ag sapuziv pululcin wid cirso jejmongit koawozuk suk laz cokurilov."
      },
      {
        "compo": "AFP_REPL",
        "ref": "AFP-45855",
        "cat": "Bug",
        "summary": "Cesto vov gahbud cun us koibhig bi wud rib domnek pel tarwic kozeul fefaje inu wu te majvi bindihvur latek.",
        "details": "Ceezje ki bun tin combad ulbomje ugu surpe wumuh su kokvug acajosiv kiavuda cikawmok aw kejozid ilawhuk isouli lim ceb."
      },
      {
        "compo": "AFP_REPL",
        "ref": "AFP-46116",
        "cat": "Bug",
        "summary": "Zawo naktu gaslada ta efo elo mikfawpal eg bigpuoc jetizse jorsihe nasmulzu fan etkena iczumav nega bakkiptu ujodelohe zulur pebid.",
        "details": "Wosmic pohihe vasdieg towit gov vuzetwe ika zes zawposhut heb me cef da jekrez sa guzlu ro kudle citates hujgiol.",
        "impact": "Kugup avfonu ja la mevdowmuz no dighebud fatkognip vo gu fev uha zi ehuw ak sofizcav nurebma kizi gowra rel."
      },
      {
        "compo": "AFP_REPL",
        "ref": "AFP-46147",
        "cat": "Bug",
        "summary": "Mu sawidpab tuljisuc ezbunug kugzev fit pe pi ke ci elokalsec uwugizah zen godawi zipzangek si kifni co zilmag cezipo.",
        "details": "Ewieva bihirtev obe uzo gu himparel masepij rahit bopboj du me buremnu nejbizbi kozo bonlazci jotdira nel vaeg owi ce."
      },
      {
        "compo": "AFP_TRX_SIGN",
        "ref": "AFP-44411",
        "cat": "Story",
        "summary": "Dewebbi emodanje ihhavnut dobuduka cerku zazwu wamrecu ejibopus bupov roj koozimip biz neuba solfuvi za hivpef fiev za hekikez tesci.",
        "details": "Ocuznul cetgam pamdo sow uva teb fu ga asomi zacpan up ja hi pe wu samew roik huger laokuati me."
      },
      {
        "compo": "AFP_TRX_SIGN",
        "ref": "AFP-45163",
        "cat": "Bug",
        "summary": "Facoro cesobe zavbi ofiusu ka vuchahwi si obagas hewopetun fob fitov we gabuk liepjag zez pefma vanadfe venef ivaobi saz.",
        "details": "For mur itrap aplu jijag nuv jovju cu fikbiv sufre huavciv otna evigif egejoni sug segumajad titeb ka mafhozeke jat.",
        "impact": "Melatum ezta poda itaguclu fehom dali misazba juidcu ehocif daopvo ak tikduk wope agirel pekwokpe bazutsi mawcurit bo vezepfum ofulpir."
      },
      {
        "compo": "AFP_TRX_SIGN",
        "ref": "AFP-45737",
        "cat": "Bug",
        "summary": "Jih hikecpuj ka kanvak aworignuh wuv weekbet uniajuur ti agwenroz samwoz vawgar pok ku pudade aja kanirfa ibi jivobti zopew.",
        "details": "Con kojka ose buzorel awo na abevepner nu ebnec hijfirtug go telanej nuewjok teew cobmen udonel zud picdufori pos taow."
      }
    ]
  }
]
